{"pages":[],"posts":[{"title":"《长生集》","text":"结就长生集，以慰心中事。 书恨卷帘流风去，行雁行又归。闲漫翻古籍，书晦凋华姿。竟夕殊未止，翌日复还来。欲弃圣贤去，唯恐负芳菲。芳菲虽不待，合梦柳枝垂。晴雪依野渡，醉眼顾采薇。 圣诞节·林总别家有感常恐佳节至，孑然亦孤身。提笔知言浅，独酌醉风尘。昔我折柳去，今夕又一春。春色凉如故，久立渐沉沦。已辞故乡久，碌碌谁可闻？更声忽欲止，蜡尽泪无痕。欲返山河远，叶落难归根。 白发近来，因职业之故，对空巢老人多有接触。作散诗《白发》，感念春秋。寂寂长街雪，但闻犬吠声。农户夜不寐，白发悄点灯。子欲远行去，锁眉细拈针。缝作红马褂，望儿只母心。旦辞故乡去，经年杳无闻。白发如枯槁，南望又一春。洞房花事好，红烛情意真。白发病中卧，垂眼意沉沉。衣锦归故里，欲报慈母恩。寻母母不至，孤冢草木深。 与小冰接诗2首谁驱阳春化白雪，惊蛰谹谹夜闻蛩。柳絮积阴成宿雨，新草芃葆笑更浓。调筝亦无知音赏，垂眸拭茶心渐空。桃李倾花不为我，我自抱梦向东风。 又 雨打浮萍远，风压芦苇低。漂漂千里游，蹉跎欺故枝。羁旅花落尽，独坐月盈时。夜半犹言早，灯下已兴迟。朔风温清酒，桑梓言我痴。何处无皎月，何必吟苦诗。我报关山险，飞光无慈悲。 悼怀长者余光中长者忽已殁，但闻竟彷徨。初识《乡愁》里，感君心劳伤。自古多豪俊，天意不使长。太白醉月落，武侯草凄凉。灵均遗壮志，太傅鸿文央。人生何所似，念此意惶惶。寻梦携鹤去，惊起觉露霜。感此语呜咽，事事本无常。 闲情桃花染小园，金缕拂庭轩。敛裙檐下坐，淡香合书掀。 忆公瑾猜是今生无缘分，杳杳相隔记不真。君笑赤壁我未生，我生君是梦里人。安能求君一回见，道阻迢迢夜更深。乾坤阴阳无处觅，惟以此文寄鬼神。 依谱填词菩萨蛮南风一夜知花少，空山不语钟声杳。倦意眼朦胧，拭茶闲意空。调筝金兽晚，意尽歌声浅。之子归徐徐，情真还是疏。 沁园春·赠秦淮歌女皓月当空，隐隐琴声，良辰正佳。绘满庭风月，幽馆僻路，碧竹情节，十里桃花。是旧时人，横笛轻奏，怕惹杨华居水涯。更年换，倚红墙凭望，落日微斜。 时光散落昨天，细数过，遗甜果蜜瓜。看朱颜鸾镜：风情依旧，初心尤存，姿态仍佳。目敛清辉，双眸锁恨，不说经年旧琵琶。都言是，那三年旖旎，碾尽芳华。 临江仙忘故 寂寂梧桐长夜雨，策马碾碎香魂。凭栏闲看落花纷。风微落幕，笑我太天真。 对月庐边曾醉酒，渐行渐远无闻。青春莫作恨来瞋。无缘无份，且过且消痕。 采薇 青草涧边虫斗趣，稻香深处鸣蛙。迷津野渡小船斜。搴惟花尽，风入响青瓜。 农妇炊烟随袅袅，孩童嬉笑年华。功名不过指中沙。抱琴携鹤，白鹭作邻家。 岁末有感 月隐重楼楼静谧，长街银杏翩跹。裹衣呵手去冬寒，凉风有恨，欺我未着冠。 年少不知花事晚，如今行事弥坚。来年春燕去归还，藏诗千万，笔落尽书笺。 问情 幼时问情懵懂，支颐轻笑容容。少时问情情意浓，伤春悲往事，沉醉眼朦朦。 近日问情凝噎，蜷身侧卧意空。沉思漫看落花风，自先沉稳后，再论与谁同。 发奋 深巷朦胧微雨，长风摇曳春花。经年底事已音哑。随波逐浪去，碌碌葬天涯。 壮志怎堪零落，初心续作无暇。青云为盖地为家，纵观天下事，挥遒写风华。 杂心闲赋归心赋红尘之飘零兮，常徘徊而不往。采山间之葛藤兮，燃灯絮而织就。绘阴阳之云肩兮，枕风月而成眠 。感君子所遇兮，欲言而又止。凝故心成赋兮，借文章以歌咏。 驾鲲鹏以遨游兮，骋天地而凌风。御人间之车马兮，扶楼阙而高歌。览盛世之灯火兮，观八方之气象。守本心之不尘兮，携君子而归宁。 结庐于东篱兮，散发而乘凉，漫步于山林兮，拈花而寻芳。访故居之樵者兮，以素心而为友。因君子之陪同兮，觉人世而无忧。愿四时之变化兮，并肩而不惧。或昼夜之更替兮，偕行而同作。 嗟乎！路之修兮，搀扶而共勉。运之薄兮，风雨而同舟。托君以红颜兮，虽伤而未悔。望生涯之迢迢兮，长伴而不弃。 现代诗题北仓图书馆昼夜的更迭， 是时间的沧桑。 于万盏浮灯下高歌， 在八方俱寂中凝望。 追溯岁月的痕迹， 偶然听见历史的绝响 从此， 他将文化复兴， 铭记在心， 悄然刻画纸上。 绕过摩肩接踵的人群， 穿过沉寂古拙的街巷， 顿足俯仰。 我看见， 他用坚韧的意志， 记录城市过往， 寒来暑去， 锻造今天的北仓。","link":"/2019/02/26/《长生集》/"},{"title":"前端学习的4个网站","text":"前端学习的4个网站大部分的人心中都有一个编程梦，能使用自己编写的软件，那将是一件多么cool的事。真正选择从事程序员行业的只是诸多梦想家中的践行者。梦想家们以诸如：“我数学不好”、“我逻辑太差”、“我英语不行”的借口使自己宽慰。实际上在真正开发过程中，可能更需要的其他的一些品质。比如：坚持、求新、思考、发量。 前端是一门包括html/css、JavaScript的语言，入门比较快，能在很短的学习周期内建立第一个静态页面，在继续学习的过程中，你甚至更创建一个无比炫酷的网站。 这次推荐4个能够系统学习前端的网站。 1.W3shool链接：https://www.w3school.com.cn/ W3shool的前端基础知识比较全面，非常适合作为新手的入门进程。它提供在线实例测试工具。根据w3cshool规划的目录，可以很快的对前端有一个初步的认识。 令人遗憾的是W3shool在解释某些内容时存在一些错误，而且内容比较少，不能深入学习。 2.Techbrood链接：https://techbrood.com/h5b2a?p=index Techbrood适用于对前端有了初步认识的朋友进阶，适合精细化整理前端知识。 该网站的内容包含了： web简介 html5入门 css3入门 svg入门 JavaScript入门 css3进阶 html5进阶 …… Techbrood的 3.IT 修真院链接：http://www.jnshu.com/occupation/1/task IT修真院属于培训机构。我并非是推荐大家去报班学习，我们可以利用修真院的任务来锻炼我们已经学习过的前端技术，而且可以通过提交任务让师兄免费为我们检查代码并给出他们的意见。 对于初学者而言，修真院前期的任务比较难，可以通过其他人的提问及回答来丰富自生的知识。 在学习中修真院并不提倡看视频学习而是要去在实际操作中查阅资料，这个观点要根据我们自己的实际情况来作出反应。 ps.如果大家觉得必须要抱一个培训班，建议多横向对比，多去知乎、简书等平台看看已经培训过建议。 4.MDN web docs链接：https://developer.mozilla.org/zh-CN/ 没什么说的，MDN是前端最全面、最系统、更新最快的文档学习地方。","link":"/2019/11/01/前端学习的4个网站/"},{"title":"前苏格拉底哲学","text":"古希腊城邦 —— 共同体中的人​ 核心特征： 城邦制、小国寡民 ​ 政治上： 直接民主制 ​ 希腊哲学的根本观念： 和谐与秩序 ​ 贸易的发展导致度量衡的标准化，开始铸造钱币。社会差别开始出现。 ​ 第一代 泰勒斯 （阿那克西曼德——阿那克西米尼） ​ 第二代 赫拉克利特 巴门尼德 ​ 第三代 恩培多克勒 阿那克萨戈拉 德谟克利特 ​ 其他流派 毕达哥拉斯学派 泰勒斯公元前5世纪生活在希腊殖民地米利都（公元前624年~公元前546年），依据是希罗多德的说法：泰克斯正确预测了依此据认为发生在公元前585年的日食。传说泰勒斯到过埃及，测量过一座金字塔的高度，其办法是在一天中当他影子的长度等于他身体长度的时候测量这座金字塔的影子。 亚里士多德《形而上学》说泰勒斯首创了一种寻求万物本原和归宿的哲学，并相信这种本原或来源是水。 泰克斯追问什么是宇宙的最根本的建筑材料。实体（构成基础的东西）代表的是变化中不变元素和多样中的统一性。实体问题后来成为希腊哲学的主要问题之一。 泰勒斯对变化如何发生的问题作出了一个间接的回答：始基（水）从一种状态变成另一种状态。变化的问题也成为希腊哲学的一个基本问题。 从神话思维进不到了逻辑思维 ​ 前提： 变化是存在的。 ​ 问题： 所有变化当中不变的元素是什么？ ​ 论据： 对水的观察。 ​ 答案： 水是所有变化中的元素。 ​ 蕴意： 万物是可以理解的。 阿那克西曼德和阿那克西米尼阿那克西曼德和阿那克西米尼都是米利都人。阿那克西曼德大概生活在公元前610年到前546年之间，与泰勒斯同时代，但比他年轻一些。阿那克西米尼可能生活在大约公元前585年到前525年之间。阿那克西米尼只留下三份简短的残篇，其中一篇可能还是伪作。 阿那克西曼德 他不认为水是不变的始基，他认为始基是apeiron。但是他“损失”了某种东西：apeiron并不像水那样可观察，用非感性的东西来说明感性的现象、对象及其变化。 阿那克西米尼 他关注泰勒斯的答案中的另一弱点。水从自己的未分化的状态转变为它的种种分化的状态，泰克斯并没有回答这个问题。阿那克西米尼断言：气是始基。气的“聚集状态”是由温度和密度决定的。后来被称为四元素的四种实体，阿那克西米尼都提到了：土、气、火和水。 泰克斯、阿那克西曼德和阿那克西米尼被叫做米利都学派的自然哲学构成了第一代希腊哲学家。他们之后的哲学家们以一种逻辑的方式追随着他们的思想。 赫拉克利特、巴门尼德、芝诺赫拉克利特 他是不为世人所理解的愤世嫉俗隐居哲学家，常用晦涩但意味深长的隐喻方式表达自己的观点。米利都的哲学家们明确的涉法原理神话的东西，赫拉克利特则常常用近乎神话的形式表达思想，他运用直觉和相信。他的著作中常提到其他哲学家，一个哲学传统建立，包含着种种内部的争辩和评论。 第一代哲学家假定发生变化，追问贯穿所有变化的不变的元素是什么。第二代哲学对这个前提提出质问：变化存在吗？ 赫拉克里特：万物都处于不断的变化或流动之中。 巴门尼德： 没有任何东西实在变化的状态之中的 ​ 赫拉克利特实际所说的是： 万物处于流动状态之中。 但是，变化是根据一种不变的规律发生的。 并且， 这种规律包含了对立面的相互作用。 但是这种对立面相互作用的方式，作为一个整体创造出和谐。 他并不否人事物可以持续相当长的时间，但在所有有生有灭的对象背后并支持着这些对象的基本原则是不同力量之间的相互作用，而这些力量之间的平衡是根据规律或logos而发生变化的。作为其基础的实体并不是始基，而是logos，它多样性中的隐蔽的统一性。 赫拉克里特难以诠释：将火作为始基；还是将火这个词当作变化的比喻？ 赫拉克利特： 一切事物都能转换成火，火也能转换成一切事物，正像货物换成黄金，黄金换成货物一样。 赫拉克利特关于不同交替力量之间的紧张关系的那个一般命题：战争或冲突。指的是这种宇宙论紧张关系，正是这种紧张关系构成了万物之“父”，即万物的基本原则。 赫拉克利特：战争是万物之父，也是万物之王。 巴门尼德 是赫拉克利特的同时代人，公元前500年前后在哲学上很活跃。他住在南意大利的希腊殖民地爱利亚。据说巴门尼德在他的家乡是一个德高望重的人，他积极参加公共事务和政治事务，包括立法。巴门尼德写了一首几乎完整地流传下来的哲学诗篇。我们还拥有像柏拉图的《巴门尼德篇》这样的第二手材料。 巴门尼德声称变化在逻辑上是不可能的，重构论证如下： 凡所是【存在】的，是【存在】着。 凡所不是【存在】的，不是【存在】。 凡所是【存在】的，可以被思想。 凡所不是【存在】的，无法被思想。 ​ 变化这个观念蕴含着某物的进入是【存在】的状态，以及某物不再具有是【存在】的状态； 比方说，一个苹果从绿的变成红的。绿这种颜色消失了，变成“非是【非存在】”。这表明变化预设了非是【非存在】，也就是无法被思想的东西。我们因此无法用思想来把握变化。因此，变化是逻辑上不可能的。 巴门尼德清楚知道感官知觉的各种各样变化，提出两难： 理性说在变化在逻辑上不可能，而我们的感觉则告诉我们变化是存在的。巴门尼德作为典型的希腊人，以理性的方式告诉我们必须相信理性：理性是正确的；我们的感觉在欺骗我们。 反对意见说，这是精神失常的说法。这种反对意见在巴门尼德在世时就已经有人提出了。但是，我们还是要看一下蕴意。到那时为止人类历史上还从未有过像这样完全依赖于逻辑的思路，哪怕是他们的感觉的证据也无法动摇他们的事情。在这个意义上巴门尼德是第一个理性主义者。巴门尼德有意将其理性论辩进行到底，这意味着他是对逻辑推理的发展作出实质性贡献的第一批人之一。 巴门尼德在理性和感觉之间建立了一个不可调和的分野： 理性承认实在是静止的，是一个统一体。感觉仅仅告诉我们一个处于变化状态、具有多样性的非实在。 巴门尼德对感觉和可感对象尤其忽视，以至于好像感觉所呈现的任何事物都被认为是缺乏实在性的。可感对象不是【存在】，如果对巴门尼德的这个诠释是正确的话，我们几乎可以说他是一元论的一个代表：所是【存在】的，是一种类型的东西，而不是多种类型的东西，而这种实在只能通过理性被把握。 芝诺 是巴门尼德的学生，他设法为巴门尼德关于变化是逻辑上不可能的学说进行辩护。其办法是表明相反的学说——认为变化是可能的——会导致逻辑悖论。 芝诺设法用阿基里斯和乌龟的故事来表明这样一种悖论： 居间的立场： 恩培多克勒和阿那克萨戈拉第三代哲学家既主张万物处于流动状态之中，又主张变化是不可能的“一种合理的反应是说这两种说法都错了；真理处于两者之间：某些事物处于流动状态之中，而其他事物则处于静止状态之中。 第三代哲学家把他们的任务看作是在赫拉克利特和巴门尼德之间进行协调，所以被称作居间的哲学家的缘故。 恩培多克勒 公元前492年到前432年，居住在西西里的阿克拉家，既是一位自然哲学家，也是一位先知。 他考虑四元素：火、气、水、土和恨（分割作用）、爱（统一作用） 区别于米利都学派： 存在四种不可变化、原始的元素（泰勒斯和德谟克利特） 四元素保持自己的特性 不同量的四元素可能彼此结合（分解）（统一（分裂）的力量） 除了原始实体外还存在其他力量，变化和力量不是内在于原始实体的（参见亚里士多德）居间的哲学家告诉我们，自然哲学是如何朝着德谟克利特及其原子论学说发展的。 阿那克萨戈拉 公元前498年到前428年。雅典是他公共生活的中心，他曾与伯里克利有交往，当他离经叛道观点与传统信仰发生冲突时，不得不离开雅典，除了他的其他观点之外，他还主张太阳并不是神祇，而是一团炽热的火球。 元素是无限的，对变化的解释与恩培多克勒相同 只考虑一种力量——心灵。这种心灵或力量驱动变化朝向一个目标 德谟克利特公元前460年到前370年，来自色雷斯的阿布德拉。涉足当时多数科学分支“论幸福”，“论死后的生命”，“论世界秩序和思维规则”，“论节奏与和谐”，“论诗”，“论农业”，“论数学”，“论正确的语言和含糊的语词”，“论和谐的字母和不和谐的字母”，等等。” （🐸牛皮，反正我是跪了） 原子论： 存在一种始基——不可分割的微小粒子，它们在虚空中运动，仅受机械方面的规定。虚空，非存在，是存在——是原子运动的前提条件。 ​ 问题 答案 ​ （什么） 1. 不可分割的微小粒子（原子） ​ …… 2. 虚空 ​ （如何） 3. 机械决定论（不是由神圣的理性或人类的理性所决定结合或分解） 毕达哥拉斯学派早期哲学重要流派，成员从公元前540年起生活在南部意大利的希腊殖民地。毕达哥拉斯学派是有关实体、自然的根本元素和变化的老问题。然而不同于其他流派，他们的基本观念不是物质元素，而是结构和形式，或数学关系。数学知识之所以是确定，还因为数学定理时候逻辑上被证明。 主张自然之门用数学打开： 对和声学的研究表明，在数学和像音乐这样非物质的东西之间也有一种对应。 毕达哥拉斯定理表明，数学也可以运用于物质食物的。 所谓天体的圆周运动，意味着这些物体也是服从数学的。 毕达哥拉斯学派是在双重意义上理性主义者： 提出以数学证明的形式出现的理论论据。 实在是“基于”所有感性现象之上的数学形式当中发现，人是通过理性而不是感官获得关于实在的知识的。 毕达哥拉斯学派里宗教神秘主义与数学为基础的理性主义并存。 同巴门尼德一样，毕达哥拉斯最后也对世界持二元论观点：","link":"/2019/02/21/前苏格拉底哲学/"},{"title":"JavaScript选项卡功能","text":"前端学习的4个网站本文作为一个我学习了blue大佬js视频的小笔记。 在各种网站中JavaScript的选项卡一个非常实用而且常见的的功能，笔记中会详细的记录如何实现这个功能的。 选项卡效果演示请大家原谅我不知道如何在markdown里面放置动图…. 原始效果 这个效果的结构由上面的具体月份+下面每个月的任务安排构成。 想要实现的效果是当我鼠标移动到每个月份的时候，下面的任务随月份而改变，就像这样： 当我的鼠标移入到2月份的时候，下面的任务就变成了“快乐学习”。 如何使用js实现这种快速而且代码不冗杂的情况下实现这个选项卡的功能呢？请继续往下看。 html代码首先放置我的html的代码。从代码可以看见，我的具体任务盒子就设置了一个，这样做的好处是不会让html的代码放置过多的盒子，使得html的代码更加容易理解和解读。 12345678910111213141516171819202122232425262728293031323334353637&lt;!--这是html--&gt; &lt;div id=\"study\"&gt; &lt;!--这是我的标题--&gt; &lt;h2&gt;前端学习计划&lt;/h2&gt; &lt;!--这是具体的月份--&gt; &lt;ul&gt; &lt;li class=\"active\"&gt; &lt;h3&gt;1月&lt;/h3&gt;&lt;span&gt;Jan&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;2月&lt;/h3&gt;&lt;span&gt;Feb&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;3月&lt;/h3&gt;&lt;span&gt;Mar&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;4月&lt;/h3&gt;&lt;span&gt;Apr&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;5月&lt;/h3&gt;&lt;span&gt;May&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;6月&lt;/h3&gt;&lt;span&gt;Jun&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;7月&lt;/h3&gt;&lt;span&gt;Jul&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;8月&lt;/h3&gt;&lt;span&gt;Aug&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;9月&lt;/h3&gt;&lt;span&gt;Sept&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;10月&lt;/h3&gt;&lt;span&gt;Oct&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;11月&lt;/h3&gt;&lt;span&gt;Nov&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;12月&lt;/h3&gt;&lt;span&gt;Dec&lt;/span&gt;&lt;/li&gt; &lt;/ul&gt; &lt;!--这是放置每个月任务的盒子，这里我默认显示了1月--&gt; &lt;div id=\"task\"&gt; &lt;h4&gt;1月任务&lt;/h4&gt; &lt;p&gt;好好学习&lt;/p&gt; &lt;/div&gt; &lt;/div&gt; css代码这是css代码，细节的朋友会发现，我 并没有在css里面设置hover属性，因为我都使用了js来完成鼠标事件。 具体的配色我会在文中末尾备注，喜欢配色的朋友可以直接使用。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950/*这里是css代码*//*设置最外层盒子的样式*/#study { width: 520px; margin: 20px auto; background-color: #fffae4; padding-bottom: 10px;}/*设置主标题的样式*/h2 { background-color: #40627c; color: #d0a825; text-align: center; height: 50px; line-height: 50px; border-radius: 10px 10px 0 0;}/*使下面任务盒子的标题没有外边距*/h4 { margin: 0;}/*使用flex布局，让每个月按我需要的形成3行4列*/ul { list-style: none; display: flex; flex-wrap: wrap;}/*设置每个月份之间的距离和自身颜色*/ul li { margin: 5px; float: left; text-align: center; border: 1px solid pink; width: 100px; height: 100px; background-color: #e8e595; color: #d0a825;}/*这里是下面任务盒子的样式*/#task { background-color: #e8e595; height: 80px; margin: 10px 40px; color: #40627c; padding: 10px;}/*这是上面每个月份鼠标移入时候的颜色*/.active { background-color: #40627c;} js代码这里是js代码，大家结合注释仔细的看就好了。 12345678910111213141516171819202122232425262728293031323334//这里是js的代码 &lt;script&gt; //定义一个数据来存放每个月的任务，以后只需要修改数组内容就可以修改页面显示的任务内容了，我只定义到4月 var arr = [ \"好好学习～1月\", \"快乐学习～2月\", \"放弃学习～3月\", \".....~4月\" ]; //这三组是把html的元素存放在我定义的变量里 var oDiv = document.getElementById(\"study\"); var aLi = oDiv.getElementsByTagName(\"li\"); var aDiv = oDiv.getElementsByTagName(\"div\")[0]; //开始循环 for (i = 0; i &lt; aLi.length; i++) { // 设置一个index来计算月份 aLi[i].index = i; //鼠标移入的时候 aLi[i].onmouseover = function() { for (i = 0; i &lt; aLi.length; i++) { //首先清除每个html里的每个li的active类名，使他们的颜色变为默认 aLi[i].className = \"\" } //给html里的每个li设置active类名，获得背景色 this.className = \"active\"; //i从0开始算，+1从1开始计算 // 使用括号包裹this.index+1，数字优先相加，避免被拼接成字符串 //用数组来定义每个月的任务 aDiv.innerHTML = \"&lt;h4&gt;\" + (this.index + 1) + \"月任务&lt;/h4&gt;&lt;p&gt;\" + arr[this.index] + \"&lt;/p&gt;\"; } } &lt;/script&gt; 页面配色为了显示效果，我加粗了文字效果 内容所属 色号 标题、任务字色与悬浮色 #40627 背景色 #ffae4 月份字体色 #d0a825 月份背景色 #e8e595 以上就是全部的内容，感谢观看。","link":"/2019/11/06/JavaScript选项卡功能/"},{"title":"宋代文学（二）北宋初期文学与诗文革新运动","text":"北宋初期文学北宋初期文学处于沿袭唐五代文风的过渡阶段，也出现了新的变化： 柳开等人的倡导和写作的古文 王禹偁革新诗风和文风 杨亿等人西昆体 晏殊的令词创作 王禹偁与宋初文风和诗风背景： 宋初文坛承接晚唐五代文风余绪，盛行骈俪声偶之辞，妍华而不免肤浅，未有新意。，柳开、穆修等人倡导复古和坚持写作古文，他们的复古主张和实践，为宋代古文运动开了头。其中有突出创作实绩的是王禹偁。 柳开：自觉恢复韩、柳古文的传统，反对五代浮艳文风，标举文统和道统，主张文道合一，著《河东先生集》。 穆修：强调教化作用，力求结构章法的变化，多用散行单句，不务雕琢堆砌，不求华糜艳丽。 王禹偁 宋初作家成就较大的一位，诗、文创作突出，促进宋初诗风、文风的变革，著《小畜集》。 早年侧重学白居易的闲适唱和诗，贬官商州后，学习白居易讽喻诗，更进学习杜甫，创作了大量反映社会现实、关心民生疾苦的作品。 代表作： 诗：五、七言效法白居易的平易诗风，近体诗、绝句不乏清淡清远的格调。代表作《村行》 文：古文与四六文兼备，改变五代以来雕绘习气，创作古雅简淡之风，成为欧阳修改革文风的先声。同时他的文章有现实政治内容和鲜明的思想倾向，代表作《唐河店妪传》。 杨亿和西昆体、晚唐体西昆体： 广义：兼指四六文。 狭义：单指其近体律诗。 杨亿：宋初著名文臣，与王钦若等编撰《册府元龟》。诗风学李商隐，讲究辞采，风格典丽，表现才学和功力，亦有清峭感怆的讽喻之作。 西昆体成为流派的标志：《西昆酬唱集》的编撰。主张“历览遗编，研味前作，挹其芳润”。 西昆体讲究修辞，大量用典，以学问为诗，是宋初文学的突出特色，与后来的江西诗派有相同之处。 晚唐体： 模仿贾岛、姚合诗风，以清逸幽居为旨趣。 林逋：是颇受推重的晚唐体诗人，虽学贾岛诗的斟酌，其诗也有其性情的孤淡清逸，代表作《山梅小园》 晏殊的令词晏殊 晚唐五代过渡到北宋的关键人物，受南唐冯延巳影响。审美取向清丽典雅，词风风流闲雅，温润秀洁。继承唐五代词艺术经验上，以明净的语言、深刻而纤细的内心体验、曲折精巧的构思，表现了情感的经历和对人生的思考。精美圆熟的艺术表现，雅致含蓄的倾向，展示出宋词风格的新特色，直接影响欧阳修、晏几道等人。 代表作：《浣溪沙·一曲新词酒一杯》《玉楼春·绿杨芳草长亭路》 欧阳修与北宋诗文革新北宋中叶的古文运动确定了古文在散文领域的正宗地位，进而影响到诗歌，讲究“气格”，产生“以文为诗的现象”。因此这场文学变革被称为“诗文革新运动”。欧阳修是这场运动的领袖，有力推动了北宋文学的发展，使宋文、宋诗独树一帜。宋代士风和文风的根本转变，都是从他开始。 欧阳修的文学贡献欧阳修 文： 欧阳修散文成就最高，影响最大。虽以学习韩愈标榜，风格完全不同。欧阳修的文澄塘潋滟，情波荡漾、含蓄委婉。摒弃韩文艰涩怪奇，发展“文从子顺”，建立起平易流畅、委屈婉转的风格。绝妙之处在于平易流畅中富有曲折变化，含蓄蕴藉而又平易近人，富有诗味，是欧阳修散文的显著特点。 代表作：《醉翁亭记》《与高斯谏书》《原弊》《朋党论》 欧阳修的赋开了宋代文赋先河，变旧赋的骈偶对仗为骈散相间、奇偶错杂。保留铺陈的特性，又使文气趋于舒缓。 代表作：《秋声赋》 诗： 早年受西昆诗人的启蒙，故能从宋初诗歌的演变着眼，给西昆体以一定的肯定。大力提倡梅尧臣“诗穷而后工”的古淡奇峭、苏舜钦的横放雄豪。他自己则学韩愈的“以文为诗”，带有韩愈那种浩荡变怪的散文化倾向，变重情韵为重气格，开始了宋诗自具面目而有别于唐诗的时代。欧诗是唐转宋的枢纽，一方面保留了诗体相对整齐凝练的传统，一方面使诗体形式具有弹性，使诗的节奏、声律多变，语言自然流畅。在以均衡对称、声律和谐圆润为美的唐诗外，建立了不讲究均衡而以古拙取胜的宋诗格调。 欧阳修在古体诗中表现为散文化倾向，以古文章法写诗，讲究转折顿挫，句子彻底散行，长短句杂出，少用偶句，故意作得似对非对，造成散文调而非诗调，诗中常用语助词。由于常用古文的句法、气势入诗，故可称为古文诗体。其创作追求气格，其风格或曰古健、古硬、气雄、气豪，或曰怪奇、奇壮、奔放，皆重气格所致。 代表作《庐山高》 他的诗开创了取材广泛、命意新颖、以文为诗和以议论为诗的一代诗风。于命意上追求深刻创新，透过事物的表象进一步表达他对事物的认识，在描述中杂以议论。 代表作《和王介甫明妃曲》 欧阳修虽然学韩愈的痕迹，但能独树一帜、自成一家风格，其风格与其散文一样，也有平易的特色。 代表作《戏答元珍》 词： 欧阳修作词并不经意，仅为了“聊佐清欢”，其中情词的比例较大。受冯延巳影响，继承南唐“思深辞丽”的特点，在词中融入了更多感情体验。除了花间风味的温润秀洁之作，也有抒发其旷达胸怀，风格豪放的词章，他的豪放气概的词，是出于性情气质，并非有意追求新风格，这一点与苏轼词有所不同。 代表作《蝶恋花·庭院深深深几许》《踏莎行·候馆梅残》《朝中措·送刘仲原甫出守维扬》《玉楼春·尊前拟把归期说》 梅尧臣和苏舜钦他们两人开宋诗一代之面目，风格虽然不同，却推动了宋诗的发展。 梅尧臣：覃思精微，故宋诗之始峻、笔始遒； 苏舜钦：超迈横绝，而宋诗之势始雄、气始舒。 梅尧臣 字圣俞，宣州宣城人。与欧阳修同为北宋前期诗文革新运动领袖，是杜甫与江西诗派之间的承传者。与苏舜钦其名，时号“苏梅”。代表作《宛陵先生文集》。 梅尧臣的诗题材广泛，其内容有两类：一类是干预政治、反映社会现实和民生疾苦的作品；另一类是写个人日常生活的琐碎事物。他的多数作品以第二类为主，取材个人化、生活化、琐碎化的倾向。他寻找前人未曾注意的题材，或在前人写过的题材上翻新，同时以哲理性的人生思考贯穿其中，加深了诗歌内涵，开宋词好为新奇、力避陈熟、富于理趣的风气。 代表作《汝坟贫女》 宋代对于平淡有宽狭不同的解释，梅尧臣的“平淡”属于“古淡”，是老树着花的美。但他面临社会矛盾和个人身世的激变时，他的古淡趋向于劲峭苦硬；仕宦失意追求隐逸山林时，则发展为冲和恬淡而蕴涵深意。 代表作《鲁山山行》《东溪》 苏舜钦 字子美，是欧阳修为盟主的诗文革新的重要倡导者，代表作《苏文士文集》。 他是关心社会而力主改革弊政的诗人，忧国忧民的政治热情，患难悲愤的生活经历，豪迈刚烈的性格，都促使他用豪犷激切、直抒胸臆的方式写诗。 代表作《吴越大汉》《奉酬公素学士见招之作》 苏舜钦的诗歌以豪犷雄放的作品最引人注目，尤其是他前期的诗歌，揭露于抨击时弊无以避讳，充满一种奋不顾身的气概，但也难免粗燥、生硬，缺乏蕴藉隽永的韵味。在他贬谪过上闲居生活后，寄情山水自然景物的诗多了起来，不乏情景交融、精炼含蓄的佳作。 代表作《夏意》 王安石的文学成就及其他王安石 字介甫，号半山，抚州临川人。宋代杰出的政治家，在文学上也取得了相当高的成就，以“天变不足畏，祖宗不足法，人言不足恤”的魄力施行“熙宁变法”，以连遭挫折而失败。 文： 作为政治家，王安石的文论重在致用，把文章看作为政治服务的工具，具有忽视文学特性的倾向。王安石的散文一定程度上贯穿了他的文学主张，特别是在有关政令教化、适于世用的政论文中。王安石驾驭语言的能力非常强，简练明快，笔力雄健。近代政论家梁启超、严复等人文章受其影响，他的文章成就很高： 议论文字： 结构谨严，析理透辟； 叙事抒情之作：随笔挥洒，曲尽其妙。 王安石的政论文严谨，语言朴素简洁而说理透彻，概括性很强。代表作《答司马谏议书》 他的小品文尤脍炙人口，虽篇幅不长，而笔力雄健，富有感情，文风峻刻，与预见他那种刚毅勇敢的政治家风度。代表作《读孟尝君传》 诗词： 王安石诗歌“奇崛“，以瘦劲刚建为特征，是王安石追求的一种艺术境界，与其坚强刚毅，果敢有为的”拗相公“本色有关。但他的诗进入老境后，化奇崛于寻常之中，既有清新闲适，又有沉郁悲壮，被称为”半山体”（或称“王荆公体“）。晚年以绝句为主，雅丽精绝，含蓄深婉，体现了部分宋诗风貌特征，又有向唐诗复归的倾向。 王安石诗歌有早期和晚期之别。 早期诗直道其胸中事，意味较薄，也反映其独特的歌仍特征和精神风貌。写了不少感时、咏史或怀古的诗篇，寄托远大的政治抱负和批判精神，如：《河北民》。政治上力排众议、实行变法，在诗歌创作方面也尽力打破常规，语意求新，诗句求工，语调劲峭，如：《登飞来峰》。 晚年罢相归隐后，王安石浮躁之气消弭，性情老成含蓄，感慨的怀抱趋于冷淡，而艺术和修养更加进步，多创作描写自然山水的小诗，新颖别致而雅丽精绝，如：《泊船瓜洲》《书湖阴先生壁》《江上》 王安石的词成就不及诗歌，但富有自己的个性，不受五代以来绮靡柔弱词风的影响，开拓了词的题材内容和表现范围，为苏、辛词开了路，如： 《桂枝香·金陵怀古》 王令 字逢原，广陵人，病逝时年仅28岁。王令一生境遇困苦，但胸怀济世之志，识度高远。他是北宋诗文革新中能别开生面的重要诗人，独特的诗歌风格，在宋初诗人中独具面目。代表作《广陵先生文集》。 王令见知于王安石，被称为“奇才”。他的诗学韩愈、孟郊，追求奇、，内容多写胸襟抱负及当时的社会现实，气魄雄壮，风格奇崛豪放，峻拔劲健。他的诗想象力丰富，富于浪漫色彩。如： 《假山》。他的诗歌特点，主要在于气势雄壮，粗犷豪迈，如： 《暑热思风》。 曾巩、苏洵和苏辙曾巩 字子固，世称南丰先生，建昌南丰人。代表作《元丰类稿》。 曾巩的散文受欧阳修赏识，文学主张和古文与欧阳修风格相近。其文古雅平整，雍容冲和，卓然为一家。后代文学家看来，曾巩与欧阳修一道是开文章“义法”的人物。 他的恶写作手法和技巧风格具有自己特色，开阖、承转、起伏、回环有法度，显得规矩严密，因此在八大家中最易学习，明清的唐宋文派和桐城派散文作者，学古文多由模仿曾文入手。 曾巩的文章追求雍容典雅的艺术风格，叙事、议论都成河平淡，委屈周详。代表作《墨池记》 长于议论，引经据古，明白详尽； 布局完整谨严，节奏舒缓不破； 语言干净，思致明晰。 苏洵 字明允，眉州眉山人。是大器晚成的散文家，厚积薄发，作文以学养为基础而重气势，文字雄奇坚劲，喜议政议军，带有战国纵横家的色彩。他的文章以议论为主，结构严谨、说理周详、气势磅礴而曲折多变，如： 《上欧阳内翰第一书》。 苏辙 字子由，号颍滨遗老，眉山人。他的文章在接受父兄疏放洒脱文风影响的同时，以欧文为学习楷模，把委婉纡徐的艺术情趣融入自己的作品中，故“汪洋淡泊，有一唱三叹之声“，近乎欧文之神韵，如： 《黄州快哉亭记》。 苏辙文风淡泊平和，议论以稳健见长，而其秀杰之气终不可授，在宋代散文中，能做到独自树旗帜。","link":"/2019/02/23/宋代文学（二）北宋初期文学与诗文革新运动/"},{"title":"宋代文学（三）宋代文学大观","text":"文学作品的鉴赏得置于时代背景之中，然后与作者生平勾联。然而此次，我对历史背景将不做阐述，作者生平与时代背景百科可考，为了节省篇幅，也不做过多介绍。 这篇笔记是以宋代文学的创作者为主线，介绍其创作风格及对文学发展的贡献，偶尔会摘录代表性作品。 内容枯燥，谨慎入内。 北宋初期文学北宋初期文学处于沿袭躺五代文风的过渡阶段，为宋代文学的发展作了铺垫： 柳开等人倡导和写作的古文； 王禹偁革新诗风和文风； 杨亿等人的西昆体； 晏殊令词创作 柳开著《河东先生集》 反对五代浮艳文风，回复“韩柳”古文传统。主张文道合一，提倡复古、简朴文风。 穆修柳开之后的古文作家。 强调教化作用，力求结构章法变化，多用散行单句，不堆砌文藻，不追球艳丽。 王禹偁诗歌平淡清远，为文古雅简淡。代表作《小畜集》 他散文表现出的平易自然的风格成为欧阳修诗文改革运动的先绳。 作品分期： 早年：学习白居易的闲适唱和诗； 贬官后：学习白居易讽谕诗，更进学杜甫诗风 七言古诗学习白居易的平易风格； 近体诗、绝句尚有清淡清远的格调 倡导古文写作，反对五代的雕绘风气，创作古雅简淡的作品。其中多有现实的政治内容和鲜明的思想倾向。 12345西昆体是宋初的文学创作风格。讲究修辞，大量用典故，以学问为诗。整体上注重形式，轻内容。艺术上学习李商隐的风格，呈现出整饬、典丽的艺术特征。代表人物：杨亿、钱惟演、刘筠 杨亿西昆体代表诗人，与王钦若等编撰《册府元龟》。 作诗讲究辞采，风格典丽，表现才学和功力，也有清峭感怆的讽谕之作。 123晚唐体是模仿唐朝贾岛、姚合的诗作，主题多为清逸隐幽。代表人物：林逋 林逋“梅妻鹤子”，以江湖散人子诗装点山林，用细碎小巧的笔法写清苦幽静的隐居生活。 诗歌风格：孤淡清逸。 《山院小梅》 众芳摇落独暄妍，占尽风情向小园。 疏影横斜水清浅，暗香浮动月黄昏。 霜禽欲下先偷眼，粉蝶如知合断魂。 幸有微吟可相狎，不须檀板共金樽。 晏殊继承唐五代词的艺术经验，作词在语言上明净雅致，构思上曲折精巧，内容上表现了情感经历和对人生的思考，直接影响欧阳修、晏几道等人。 风格：含蓄委婉 代表作《珠玉词》《晏元献遗文》（清代人所著） 《踏莎行》 小径红稀，芳郊绿遍，高台树色阴阴见。春风不解禁杨花，蒙蒙乱扑行人面。 翠叶藏莺，朱帘隔燕，炉香静逐游丝转。一场愁梦酒醒时，斜阳却照深深院。 北宋诗文革新北宋中叶的古文运动出了确定古文在散文领域的正宗地位，而且作诗也讲究“气格”、“以文为诗”。其中欧阳修是这场运动的文坛盟主，他对众文人的推崇，有力推动了北宋文学的发展，使宋诗、词自具面目，宋代士风和文风从根本上开始转变。 欧阳修北宋诗文革新运动的领导者，继承发扬韩愈的古文理论，开创一代文风，同时也对诗风和词风进行了革新。 文学贡献： 文 散文：学习韩愈，发展“文从字顺”，言简而明、信而通。 特点：从具体事物出发，写得婉转曲折、含蓄蕴藉。同时又使得文章富有情感和 诗味。 代表作《醉翁亭记》 赋：开启宋赋先河，变骈偶对仗为骈散相间、奇偶错杂。保留赋铺陈叙述的特性，又让文章趋于和缓。 诗 学习韩愈的“以文为诗”，诗歌创作散文化 追求气格 开创了取材广泛、命题新颖、以文为诗及议论为诗的风格 词 与晏殊同为北宋初花间词人代表，除占比例较大的情词外，也有抒发旷达胸怀，风格豪放的作品。 《浪淘沙》 把酒祝东风，且共从容。垂杨紫陌洛城东。总是当时携手处，游遍芳丛。聚散苦匆匆，此恨无穷。今年花胜去年红。可惜明年花更好，知与谁同？ 梅尧臣与苏舜钦齐名“苏梅”，著《宛陵先生文集》。 艺术特点：平淡其表，深邃其里 诗歌“古淡”，社会矛盾与个人身事激变时，趋于劲峭苦硬； 宦途不顺归隐山林，则表现为冲和恬淡，蕴含深意 《鲁山山行》 适与野情惬,千山高复低。好峰随处改,幽径独行迷。 霜落熊升树,林空鹿饮溪。人家在何许?云外一声鸡。 苏舜钦采用豪犷激切、直抒胸臆的方式写诗： 前期：揭露和抨击时弊，有奋不顾身的气概，也有粗燥、生硬，缺乏隽永的缺点。 后期：诗风多变，寄情山水，有幽独闲放的趣味。 《淮中晚泊犊头》 春阴垂野草青青，时有幽花一树明。 晚泊孤舟古祠下，满川风雨看潮生。 王安石创造“半山体”（又名”王荆公体“），有《王临川集》《临川集拾遗》 文学成就： 文：重以致用，简练明快，笔力雄健 政论文：严谨，语言朴素简洁，说理透彻； 散文：议论说理见长； 小品文：笔力雄健，富有感情，文风峭刻； 议论文：结构严谨，析理透辟； 叙事抒情文：随笔挥洒，曲尽其妙。 诗词：化奇崛于寻常，既清新闲适，又沉郁悲壮，被称为“半山体” 早期：直抒胸臆，意味较薄 晚年：以绝句为主，新颖别致，雅丽精绝，形成“深婉不迫‘的风格，体验宋诗风貌，又有唐诗复归倾向。 《书湖阴先生壁》 茅檐长扫净无苔，花木成畦手自栽。一水护田将绿绕，两山排闼送青来。 曾巩世称“南丰先生”，文章“古雅、平和、正直“，著《元丰类稿》。 文学特点： 追求雍容典雅的艺术风格，文章冲和平淡，委屈周详； 长于议论，引经据典，明白详尽； 布局谨严，节奏舒缓，语言干净，思致明晰。 代表作 《墨池记》 苏洵苏洵文章以学养为基础，重气势，有战国纵横家色彩，擅长散文，尤其擅长政论文。著《嘉祐集》。 写作特点：结构谨严、说理周详、气势磅礴、曲折多变。 文风：精练劲建、简古质朴；笔锋老辣，纵横博辩。 苏辙学习欧阳修淡泊平和文风，议论以稳健见长。著有《栾城集》。 作品委婉纡徐的艺术情趣融入其中，苏轼称其散文“汪洋淡泊，有一唱三叹之声，而其秀杰之气终不可没”。 苏轼文学成就： 散文成就 议论文 纵横捭阖，气势充沛，雄辩恣肆； 议论透辟，通俗明晓，深入浅出，文采斐然。 记叙文 文学价值最高，最具独创性的，以山水游记和亭台堂阁记为代表； 游记表现出借景立论的特点； 记叙文为文学性散文，展现苏轼随物赋形的本领，体现他才情横溢的奇思妙想 诗歌创作 创作概况 主要分为：社会政治诗、山水景物诗、和陶诗、题画诗 以贬谪黄州为界限，早期写富有批判精神的社会政事诗，后期则抒发被贬后的感慨。 创作特色 “以文为诗”，以议论为诗，将事物形象感受与哲理思考结合； 创造“东坡体”，擅长七言，风格多样； 基本风格： 刚健含婀娜的清丽雄健； 豪放加平淡的清旷闲逸。 词的革新意义 超旷高远胸襟 “以诗为词”，用诗的品格改造传统本色的词体，用诗的精神提高词的品味 题材的拓展 士大夫文人的生活内容带到词中； 将情感范围扩大到朋友、师生、兄弟、夫妻之间； 农村题材正式入词 咏物词有开拓之功 豪放旷达的风格 打破了以婉丽柔媚为美的局限，抒发士大夫情致的创作心理； 苏词气象宏大，雄健清刚，创新词风，突破音律束缚。 《冬景》 荷尽已无擎雨盖，菊残犹有傲霜枝。 一年好景君须记，最是橙黄橘绿时。 《望江南》 春未老，风细柳斜斜。试上超然台上看，半壕春水一城花，烟雨暗千家。 寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶，诗酒趁年月。 江西诗派江西诗派是以黄庭坚为宗主、对宋代影响最大的诗歌流派，他们对宋诗的发展有很大贡献。 黄庭坚著《山谷集》《山谷外集》《山谷别集》。 题材内容： 日常交际应酬的赠答诗、次韵诗、咏物诗； 反映民生疾苦和时事政治的诗，直接涉及现实； 表现自我人格和襟怀的抒情写意诗。 诗歌特色： 学习杜甫诗歌，多用拗句； 以学问为诗，以故为新，变俗为雅，追求生新瘦硬，工于练字（善用动词、形容词、语助虚词） 创造“山谷体” 基本特征：求生避熟，求雅脱俗 艺术特点： 学杜为宗旨，重视句法，发展拗句、拗律的体制； 强调“无一字无来处”，用典以故为新、变俗为雅，长于点化铸造，富有思致和机趣； 好奇尚硬，造语洗净铅华，独树隽旨，风格生新瘦硬峭拔，兼备浏亮芊绵的一面。 词： 雅俗并存： 一方面词名颇高，但词风俚俗； 雅词带有兀拗俊洁的个性色彩。 《寄黄几复》 我居北海君南海，寄雁传书谢不能。桃李春风一杯酒，江湖夜雨十年灯。持家但有四立壁，治病不蕲三折肱。想见读书头已白，隔溪猿哭瘴溪藤。 《清平乐》 春归何处。寂寞无行路。若有人知春去处。唤取归来同住。 春无踪迹谁知。除非问取黄鹂。百啭无人能解，因风飞过蔷薇。 陈师道作诗凭学力专精，讲苦吟，求奇拙。 创作力求精简字句，摒弃华辞丽藻，其诗无华无才，只有瘦硬。 创作“后山体”诗风。 陈与义创造“简斋体”，著有《简斋集》。 诗歌创作： 前期：内容多为抒怀、咏物、唱和的作品，风格清新冲淡，明净雅致。 后期：内容多为忧国感时，诗风雄阔浑厚，沉郁悲壮。 简斋体： 指他后期创作的诗歌； 对仗不注重字面的工稳精巧，注重上下句的气脉联系，让诗的意境更加圆融； 诗风遒劲，思力沉挚，取材和诗境恢弘，形成了雄浑、沉郁的独特艺术风格。 北宋词坛可分为三个时期： 北宋词初期：继承花间派与南唐词风而有变化 北宋词创造时期：出现了一批推动宋词发展的关键人物 北宋词总结期：集大成者的周邦彦与南渡词人 柳永北宋最有名“通俗歌曲作家”，北宋和南宋诗词承先启后的词人，著《乐章集》。 题材内容： 表现下层市民情感、观念、价值标准； 言情词，描写风尘女子与艳情； 羁旅行役词； 城市风光； 柳永词的开拓意义： 继承了民间词的传统； 扩大了题材内容（主要在于文化下移）； 对宋词的贡献： 创制慢词，完善慢词体制和表现手法； 章法上，注重叙事完整，描写细腻的效果，语言通俗（柳词广泛流传的根本原因）； 韵脚平仄的变化，吸引和感染观者； “曲祖”称号 《八声甘州》 对潇潇暮雨洒江天，一番洗清秋。渐霜风凄紧，关河冷落，残照当楼。是处红衰翠减，苒苒物华休。唯有长江水，无语东流。不忍登高临远，望故乡渺邈，归思难收。叹年来踪迹，何事苦淹留？想佳人妆楼颙望，误几回、天际识归舟。争知我，倚阑杆处，正恁凝愁！ 秦观与柳永合称“秦柳”，与周邦彦合称“秦周”，著《淮海词》（又名淮海居士长短句） 题材：相思离别的情感； 音律上：平仄协调、音节和谐、节奏鲜明，具有音乐美； 特点： 清新雅致又明白晓畅 抒情中融入议论，委婉深沉又自然流畅 《减字木兰花》 天涯旧恨，独自凄凉人不问。欲见回肠，断尽金炉小篆香。黛蛾长敛，任是春风吹不展。困倚危楼，过尽飞鸿字字愁。 晏几道著有《小山词》。 题材：爱情生活 词风：语言清丽、感情真挚 《临江仙》 梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时。落花人独立，微雨燕双飞。记得小蘋初见，两重心字罗衣。琵琶弦上说相思。当时明月在，曾照彩云归。 贺铸俗称“贺龟头”，诗集《庆湖遗老集》，词集《东山词》。 艺术特点： 盛丽、妖冶者继承花间词风，如《青玉案》，得到“贺梅子”称号； 抑塞不平之气时于笔端发之。 周邦彦“正宗”、“集大成”者，与柳永并称“周柳”，著有《清真集》《片玉集》。 题材内容：男女之情，相思离别。 艺术成就： 继承柳永铺叙的特点，曲折变化； 章法布局开阖回旋，既有柳永的叙事容量和感情力度，又避免了直露无余，章法布局上常使用不同感情的相互衬托手法；以景结尾。 语言典雅、音律精严，融前人诗词入句。 《旧游·记愁横浅黛》 记愁横浅黛，泪洗红铅，门掩秋宵。坠叶惊离思，听寒螿夜泣，乱雨潇潇。凤钗半脱云鬓，窗影烛光摇。渐暗竹敲凉，疏萤照晚，两地魂消。 迢迢，问音信，道径底花阴，时认鸣镳。也拟临朱户，叹因郎憔悴，羞见郎招。旧巢更有新燕，杨柳拂河桥。但满目京尘，东风竟日吹露桃。 李清照著有《漱玉词》。 《词论》 一是尚雅：指思想的雅正和语言音律的文雅； 二是主张“词别是一家”，诗词有别。 创作风格： 前期：绰约轻倩，自然妩媚，清丽淡雅； 后期：沉郁哀痛。 创作特点： “易安体”； 语言清新淡雅又通俗易晓； 善于将语言变化与声调、词情相结合。 《武陵春·春晚》 风住尘香花已尽，日晚倦梳头。物是人非事事休，欲语泪先流。 闻说双溪春尚好，也拟泛轻舟，只恐双溪舴艋舟，载不动许多愁。 朱敦儒有词三卷，著为《樵歌》。 描写男欢女爱、离愁别绪的传统题材： 南渡前追求的是轻狂放逸的人生境界； 靖康之难后抒发国破家亡的沉痛之情、晚年隐居写了大量隐逸词。 词风为独创的“樵歌体”： 淡而静的空旷境界中，透出潇洒； 风格自然飘逸、语言浅白如话，自成一格。 《西江月》 世事短如春梦，人情薄似秋云。不须计较苦劳心。万事原来有命。 幸遇三杯酒好，况逢一朵花新。片时欢笑且相亲。明日阴晴未定。 辛派词人辛弃疾他代表了南宋爱国词的最高成就，达到了词体艺术的高峰，发出了时代最强音，形成“稼轩体”。著有《稼轩词》，又名《稼轩长短句》。 题材内容： 抒发报国豪情和壮志难酬的悲愤。如《鹧鸪天》《破阵子》 壮志难酬、报国无门的愤懑中注入急切。如《水龙吟·登建康赏心亭》《摸鱼儿》 缠绵之情。《青玉案·元夕》 农村田园的生活和景致。如《清平乐》《西江月·夜行黄沙道中》 艺术成就： 豪放词刚柔并济，婉约词柔中有刚，悲壮中有婉转，豪放中有缠绵，柔情中有刚劲道，是辛弃疾词风的独特之处； 喜好议论、以论为词。用典广播，且典源广泛； 以文为词，采用散文句法，创造用散文句入词。 《菩萨蛮》 郁孤台下清江水，中间多少行人泪？西北望长安，可怜无数山。青山遮不住，毕竟东流去。江晚正愁余，山深闻鹧鸪。 张元干词作特点： 前期：“极妩秀之致”； 后期：慷慨激昂 张孝祥其词反映时代特征，极具艺术感染力。南宋周密《绝妙好词》收集的南宋词中，列为第一。 陈亮特点：以救国安民为己任，表现抗战恢复的之气 刘过特点：多壮语，有稼轩词狂放而又幽默的影子，风格、结构都与辛弃疾相似 南宋中期诗文南宋中期是宋代文学发展的又一高峰，出现“中兴四大诗人”。 陆游古代作家中最高产的诗人，有《剑南诗稿》《渭南文集》。 创作时期： 早期：喜藻绘而至清新脱俗； 中期：豪放悲壮； 晚期：清淡秀逸，风格闲适淡泊，但爱国思想和积极奋斗的精神继续保存。 艺术成就： 古体诗风格悲壮； 律师多悲愤之作； 绝句风格清淡秀逸。 陆游词和散文： 词作风格多样，其中激昂慷慨、清淡秀逸、流利绵密为主； 《渭南文集》以记叙文成就最高：《老学庵笔记》《入蜀记》 杨万里著有《城斋集》。 城斋体： 以日常生活的小情趣为题，想象新奇风趣、语言通俗明快、风格流转圆活的特点。 活法诗： 以自然意象为主，恢复诗人感官的天真状态，表现山水景观所蕴含的自然灵性和知觉情意，诗中充满奇趣和活劲。 《小池》泉眼无声惜细流，树阴照水爱晴柔。小荷才露尖尖角，早有蜻蜓立上头。 范成大 著《石湖居士诗集》。 诗歌： 记事诗 抒写瞻望收复河山的心怀和壮语； 鞭挞统治者的卖国屈辱。 田园诗艺术特点： 田园诗和“田园词”、“悯农诗”合二为一。 《夏日》（其七） 昼出耘田夜绩麻， 村庄儿女各当家。 童孙未解供耕织， 也傍桑阴学种瓜。 朱熹著《四书章句集注》《诗集传》《楚辞集注》 诗歌：以诗喻理，情趣、理趣相交织。语言净洁简理，句法自然平易，风格雅正明洁。 散文：功力深刻、理致周密，不矜才使气看来诗平淡无奇，却深厚简单，含不尽之意于言外。 《春日》 胜日寻芳泗水滨，无边光景一时新。等闲识得东风面，万紫千红总是春。 其他散文中期文坛分为两派： 一派是讲事功的功力派，以陈亮和叶适最为有名，其文章以评论时事和讲乱兴衰为特色； 另一派是道家派，以朱熹、真德秀为代表，多讲学之文和语录体。 个体散文的一般特征： 议论文：以扶贫救倾的议论文成就最高，正气贯注，文字最为明达，。受欧、曾影响，南宋散文文字风格更趋向畅达明快和语体化，但也有追求平易而流为冗慢与粗率的弊端，导致文气冗若。 叙事文：叙事性文章显得纡漫拖沓，碑志比较散漫萎弱。 语录体：理学家以无意为文，无章法约束，过于随意，不以文章论 南宋清雅词派姜夔首创了清雅词派，丰富了词体风格内涵，形成“第三派”。使词能够与传统诗文并列并肩，从传统《花间》、南唐、晏殊、柳永、周邦彦所形成的婉丽传统风格中独立出来。 诗学批评方面《诗说》，见解读到而深刻。 词的创作成就最高，影响最大。有《白石道人诗集》，词集名《白石道人歌曲》 情思内涵： 题材上：以感时伤世，咏物言志和追记恋爱恋情为主。 音调和意境上：有情越、高旷的格调，词中塑造的形象往往融入了他本人所具有的高雅气质。 还有反映家国之感、时政感慨的作品，不以描写的真切、感情的激愤取胜，而是让自己的感情上笼罩上凄清的色彩。 艺术成就： 继承周邦彦，与周邦彦合成“周姜”。清空、骚雅成为白石词独特风格的代称。 清空：清空与质实相对。 清幽空灵的意境。多用素洁的意向，营造清疏高旷的境界。如《暗香》 虚字的使用。使语意转折灵活，流走自如，而又传神入微，且能避免平铺直叙的缺点。如《疏影》 独特的笔法。以柔笔写柔情，并能褪尽铅华，更见清刚。如《长亭怨慢》 音律精严，词中求雅。以雅乐注入词体，主要有两种方法： 以古乐府入词，用古乐的雅音革除今曲的淫靡； 以唐法曲音乐注入词中，使“清”、“空”、“淡”的风格代替胡乐的浓艳急促。 《扬州慢》 淮左名都，竹西佳处，解鞍少驻初程。过春风十里，尽荠麦青青。自胡马窥江去后，废池乔木，犹厌言兵。渐黄昏，清角吹寒，都在空城。杜郎俊赏，算而今、重到须惊。纵豆蔻词工，青楼梦好，难赋深情。二十四桥仍在，波心荡、冷月无声。念桥边红药，年年知为谁生。 吴文英主要效法周邦彦，就追求词的典雅含蓄而言，收姜夔影响较大，因此常把他列为周派词人，著《梦窗词》。 题材： 酬酢赠答之作； 哀时伤世之作； 忆旧悼亡之作； 艺术成就： 讲究用典和用字，形成雅丽风格并有独特的情绪体验和表现方式； 章法结构十分独特，时间和空间交错杂糅的叙述方式与亦真亦幻的内容呼应； 语言有自己风格，运用冷僻怪异的字词，形成超逸沉博、浓艳密丽的词风； 《风入松》 听风听雨过清明，愁草瘗花铭。楼前绿暗分携路，一丝柳，一寸柔情。料峭春寒中酒，交加晓梦啼莺。 西园日日扫林亭，依旧赏新晴。黄蜂频扑秋千索，有当时、纤手香凝。惆怅双鸳不到，幽阶一夜苔生。 史达祖“梅溪先生”，咏物词善于取神、用意，著《梅溪词》。 其词词语奇秀清逸，融情景与一家，会句意于两得。 周密著《草窗词》。 词风与姜夔相近，和吴文英起名，并称“二窗”。 其词风格“清丽”，咏物词寄托遥深。 王沂孙著《碧山乐府》（又名《花外集》）。 其词别具悼念故国之思，充满凄苦悲凉意味。 其咏物词，既体物细微，结构细密，又寄托遥深，哀婉动人，惜时有隐晦之病。 张炎“张春水”、“张孤雁”，著《词源》二卷。 上承白石的清空疏宕，近与梦窗的密丽质实区别，表现了明确的风格意识。 创作风格： 宋亡之前：词风雅丽；； 宋亡之后，词风凄凉悲苦； 入元后，词风转变，多为哀音及身世零落之感； 《千秋岁》 数声鶗鴂。又报芳菲歇。惜春更把残红折。雨轻风色暴，梅子青时节。永丰柳，无人尽日飞花雪。莫把幺弦拨。怨极弦能说。天不老，情难绝。心似双丝网，中有千千结。夜过也，东窗未白凝残月。 南宋后期文学南宋后期因为政治动荡黑暗，导致文学的发展每况愈下。“永嘉四灵”、“江湖诗派是主要代表。宋亡之际文天祥等爱国诗人是这一时期的最后一道光芒。 永嘉四灵徐玑，号灵渊； 徐照，子灵晖； 翁卷，字灵舒； 赵师秀：字灵秀； 特征： “四灵”作诗复兴唐诗实际是晚唐体，专做格律诗； 意平语诡，多有怆气，因刻画太甚流于纤仄，也有自然浑圆的作品； 攻五言格律，多咏景物，写萧散野逸之趣，追求平淡简远的韵调； 费心苦吟，刻意求工，其诗冲淡平和、清零清寒的境界，流露山人名士的出世情怀； 12江湖诗派南宋后期影响最大的诗派，因陈起刊刻的《江湖集》得名，多效”四灵“之体，宗尚晚唐体的清巧之思，多属意于苦吟，反对江西派的”资书以为诗“，以不用事为贵。 刘克庄著《后村先生大全集》，词集名《后村长短句》《后村别调》 继承辛派爱国注意传统与豪放词风，是辛派词人的后劲。 作词针对社会时政有感而发，内容多是忧愤悲凉，黍离哀痛的沧桑感。 创作阶段： 前期：从晚唐体、四灵体乳瘦，刻琢精丽，风格清轻简淡。后追求抑扬开阖、悲愤慷慨的作风； 后期：有意追求陆游、杨万里的大家风度，格调更多沉痛、感情更多深刻； 戴复古作诗以苦吟秋工，带有四灵余习。著《石屏集》。 方岳有《秋崖集》。 作诗主清新，工于镂琢，常能制作出新奇对偶，把寻常典故成语巧加组织而成名句。 大多数作品写于罢官乡居时，颇多写景的田园之作。 1遗民作家，其作品多反映亡国悲痛，表现民族气节。 文天祥著《文山先生全集》。 创作阶段： 早期：诗歌比较平庸； 后期： 诗歌：抒发爱国思想情感与坚贞的民族气节，多谢亲身经历，具有纪实性，直抒胸臆，悲壮苍凉； 散文：以纪实著称，富有惊心动魄的传奇性； 词：创作不多，表现了作者至死不渝的民族气节和顽强斗志。 汪元量著《水云集》《湖山类稿》。 创作： 诗：以纪实绝句述亡国之痛，充满了亡国之戚、去国之苦。被称为宋亡“诗史”； 词：直抒胸臆，多写故国之思，常用比兴而不流于隐晦，着笔疏淡而不失于苦寂； 刘辰翁著《须溪集》。 其词大都为宋亡后作，感怀时事，抒发兴亡之感。 诗文以奇怪磊落为宗，不平的心境和抑郁的情绪，使其诗遣词造句显得很艰，意趣迷离，寄托遥深。 郑思肖著《所南翁一百二十图诗集》《郑所南先生文集》。 其诗多写亡国之痛与故国情怀。","link":"/2019/03/02/宋代文学（三）宋代文学大观/"},{"title":"宋代文学（一）宋代文学发展绪论","text":"宋代文学发展概况特征： 承先启后，宏通广播 学术思想： 与汉学并称，宋明理学一脉相承。 文学艺术： 宋词、“宋调”、“唐宋八大家”宋占六家 通俗市民文艺： 与元同列 历史背景​ 公元960年春，宋太祖赵匡胤发动陈桥兵变，黄袍加身建立宋王朝。此后用十年的时间平定荆湖、西蜀和南唐，至宋太宗时平定北方，全国除东北的辽（包括烟云十六州）和西北的西夏以外，大部分地区得到统一，结束了五代十国的分裂割据局面。赵匡胤为避免唐五代以来强藩武将的专横篡夺，建国第二年，以“杯酒释兵权”的策略，解除了禁军将领和节度使的兵权。为加强中央集权，将全国精兵集中开封及其附近，隶属于枢密院，由皇帝直接掌握，枢密院多委派文人担任，使“兵不知将，将不知兵”。 ​ 由于采取“守内虚外”的政策，重文轻武，边备不修，所以终宋之世积弱积贫，为历史版图最小的统一王朝，反映在文学上，也就没有了西汉赋家和盛唐诗人那种恢弘开廓的气象，更多的是“痛切国事、沉郁悲愤”的声音，这一点越到后面越突出。 ​ 面对外有内患，士大夫多革新朝政的议论，朋党之争迭起。 ​ 北宋：改革与保守的党争斗；南宋：主站与主和争论不休。 ​ 对外涉中的辞令，政策争议中的辩论，均需要文章来表达，客观上促进了宋代散文发展。宋代的学校教育和科举制度也十分发达，全国州县普遍设立学校。宋代科目最初是重诗赋，后来重策论，或两者兼试。文人当政是宋代的特色，与之伴随的文人论证风气的形成，则始于科举考试的科目导向，其影响所及，使宋文多论证文章，宋诗也有议论化、散文化的倾向。散文化的写作手法渗透到诗赋骈文、甚至于词句中去，于是有以文为诗、以诗为词等种种破体为本的现象出现。 ​ 宋统一中国后，社会经济很快恢复，造纸术、印刷术的普及，方便了作家诗文集的出版，有利于文化的传播。商业繁荣，城市人口增加、市民阶层扩大、歌乐盛行、文娱生活丰富多彩，给文化世俗化的发展提供了有利条件，于是市民文艺的兴起，如话本小说、鼓子词和诸宫调等，一时蔚为大观。 理学宋儒出入佛老而返归儒学。 他们继承孔孟仁学的道统加以解说，又受佛老思想影响下，兼吸到家学说的某些因素，发展成为新儒学的性理之学，或心性之学。 理学家主张文以载道，但偏重道统新传。因此形成了重道轻文的文学思想。导致文章不免说教，诗也趋向言理，缺少文学的情韵和意味，词及小说戏曲等少受理学影响而自成曲面。 宋词​ 词作为宋代最具影响力的代表问题，数量和质量都很客观。唐圭璋《全宋词》搜集词人一千三百余家，词作二万余首。有小令、中调、长调等各种样式，词体风格更呈现出不同流派争奇斗艳、百花齐放的特点。 ​ 北宋 ​ 晏殊、欧阳修他们继承《花间》、南唐词特点，加以深化、美化，其个人抒情之作，致力于提高 令词的品格。 ​ 柳永他是北宋第一个大量创作慢词的词人，发扬光大了民间慢词，扩大词体的表现范围和深度。写作特点是铺叙蔓延，风格以风俗为主，受到下层受众的喜爱，也招致文人的激烈批判，后来慢词逐渐为文人所接受，成为宋词代表性的体式。 &lt;u&gt;苏轼&lt;/u&gt;苏轼为北宋词风大变。其借词体表现士大夫的自我人格和性情抱负的作品，与应乐工歌妓要求所作的歌者之词大异其趣。“以诗为词”，所咏题材极为广泛，开拓了词的表现领域。写作上指出向上一路，不尚雕琢，不重词藻，不严格律，随手挥洒而自然高妙。 与苏轼同期稍后的词人：秦观、贺铸、晏几道等人，均以绝妙好词见称。​ 秦观​将身世之感并入艳词，对景物和心理的刻画细致入微，被称为婉约之宗。 ​ 晏几道继承晏、欧词风又变本加厉，把令词的技巧更加推进一步，词风凄苦而哀感顽艳。 ​ 贺铸词情意缠绵，语言工丽，与小晏相近。长调慷慨激昂，大气磅礴。 ​ 周邦彦集前人各家之长，使词的艺术技巧更臻完美，是北宋词的集大成者。其题材并未开拓，精通音律，词作音韵协美，修辞醇雅。并在柳永的基础上将慢词技巧加以发展，变平铺直叙为跌宕回环，极具文人气质。 ​ 李清照是南渡之际的杰出女词人，其词以寻常语度入音律而清丽晓畅，被誉为“易安体”。前期词反映闺中以婚后生活较多，后期词写于南渡之后，因国破家亡，夫妻永别，词风沉痛凄苦而哀痛欲绝。 ​ 南宋 ​ 在靖康之难中，汴京沦陷，北宋灭亡。在民族矛盾极其尖锐而统治阶级内部矛盾复杂化的时代，南宋爱国人士慷慨悲歌。他们把词从相思离别、红情绿意的浅斟低唱中解放，代之以豪放雄浑的悲壮声调。 ​ 辛弃疾是南宋词人中最具代表性的，他集民族英雄、爱国词人于一身，他的词激昂慷慨而沉雄悲壮，但又不失词体特有的要渺凄迷之美。《稼轩词》中还有一些婉约含蓄的情词和清新鲜丽的农村词，表现了其词风的多样化。 ​ 南宋爱国词人的作品奏响了宋词的最强音，但南宋的局面终究是屈辱苟安的时期较多，所以中期以后的另一派词人，追求清雅工致，讲求音律格调，注重辞藻，如姜夔、史达祖、吴文英等，形成了南宋清雅词派。 ​ 姜夔他精通音乐，词风清空古雅，如野云孤飞，去留无迹。 ​ 史、吴二人多数为适应歌妓口吻的合律之作，追求音律的协调和词句的秾丽。字面华美，所表达的感情却似有难言之隐，以至于内容晦涩，却也有空灵生动的佳篇 ​ 南宋亡国前后，文天祥、刘克庄、刘辰翁等爱国词人大声疾呼，气薄云天；而周密、王沂孙、张炎等遗民词人，发生了凄凉的叹息，借隐喻抒写亡国之悲痛，已是“亡国之音哀以思”了。 宋诗​ 宋初 ​ 多学唐人：白居易“白体”、李商隐“西昆体”、晚唐诗人“晚唐体”。其中以学西昆体盛行一时。 ​ 西昆体杨亿、钱惟演等人为代表。作诗讲究修辞，属对贴切，绮丽工稳，暗含讽喻。但多数内容贫乏。 ​ 北宋庆历时期，欧阳修、梅尧臣、苏舜钦等人的诗歌创作，关系到整个宋诗的发展方向，将西昆体重雕琢和尚侈丽的流弊，作诗有散文化倾向，主气格、重雄放、求淡远，形成了平易流畅的古淡风格。宋诗揭开了新的一页。 ​ 北宋神宗熙丰时期到哲宗元祐时期 ​ 这时是宋诗的成熟阶段，主盟诗坛的是：王安石、苏轼、黄庭坚。 ​ 王安石他的诗骨鲠傲气而又清新隽逸，不失拗相公本色，他的七绝赓续唐音而雅丽精绝，人称“王荆公体”。 ​ 苏轼“东坡体”可与王安石诗抗行而风格不同，王诗深邃高远，苏轼则是渊博朗畅。苏轼的以文为诗和以才学为诗，在七古长篇中体现得最充分。 ​ 黄庭坚是江西诗派的鼻祖，在诗句的锤炼和推陈出新方面，有独到的功力。风格瘦硬而趋于老成，有老境美。江西诗派结束了北宋诗坛，对南宋诗坛产生了或多或少的影响。 ​ 南宋 ​ 陆游具有战士情怀的爱国诗人，他的诗豪情满怀而激昂慷慨，也有壮志难伸的沉郁顿挫；他晚年寄意山水田园，诗歌意境冲淡和平，表面上空灵静寂，骨子里却腾跃动荡。 ​ 杨万里诗风活泼自然，口语入诗，号称“城斋体”。 ​ 范成大四时田园诗集大成者，其诗多用典故，是学习黄庭坚的山谷体，但却约以婉峭自成一派。 ​ 诸家都从江西诗派中分化，且自成风貌。反对江西诗派自成派系的，有“永嘉四灵”和江湖诗派，他们反对江西诗派末流议论叫嚣的习气，提倡作唐诗。多学晚唐诗体，效仿贾岛、姚合的苦吟，主情切，雕小景，五律诗可观但缺乏个性表现。 ​ 亡国之际 ​ 亡国之际的宋词结束了派别之争和门户之见，写真性情、真精神、慷慨从容。 ​ 汪元量慷慨悲歌，咏亡国时随宫女北徙的见闻，有“诗史”之誉。 ​ 郑思肖《所南集》的诗，寄情于南而愤寓于笔端。 ​ 他们的诗歌抒写仁人志士的怀抱，反映当时各方面的现实情况，为宋诗的结束画上了光辉的句号 叙事文学​ 士大夫： 散文（雅文学） ​ 民间讲唱文学： 话本小说（俗文学） ​ 北宋 ​ 宋初文章沿袭晚唐五代风格，骈文昌盛一时。 ​ 柳开首先提倡韩愈古文，王禹偁、穆修和尹洙等人力求文章精炼简介，但影响不大。 ​ 直到欧阳修，才产生了具有宋代特色的散文，欧阳修门下聚集了一批古文名家，宋代散文发展进入了新天地。 ​ 欧阳修为文委婉自然，纡徐有致； ​ 苏洵文章纵横条达； ​ 苏辙文章汪洋淡泊； ​ 曾巩之文典雅谨严； ​ 王安石为文矫健简洁； ​ 苏轼为文明快朗畅，一泻千里。 ​ 他们的风格迥异，但都能化繁为简，变难为易，追求平易畅达的文风，是宋代顾问获得成功的重要因素。 ​ 理学家周敦颐、张载、程颢、程颐也写出了平易近人的文风，是北宋古文的一个支派。 ​ 南宋 ​ 分为两派： ​ 一派是理学家的古文。理学家古文以朱熹为代表，张栻、吕祖谦等人是追随者。 ​ 朱熹为文辞严理正而平易坦识，提倡明白翔实的文风，排斥辞以害意。 ​ 一派是主功利的思想家的古文。以叶适、陈亮为代表，从诗友关系上看，他们受理学家影响，但文章的内容与理学家不同。他们认为学问在于经世，所以用文章纵论世事，针砭时弊。 ​ 南宋古文虽然可分为两派，但异中有同，为文的主导风格皆朴实无华，平易浅显。宋亡之后的遗民文章，则是以血泪写成，沉痛悲凉，风格迥异于南宋。 ​ 四六文 ​ 不完全摒弃骈文的情况下，将骈文改造，疏淡化、散文化成为宋代流行的四六文。 ​ 欧阳修、曾巩、王安石、苏辙、苏轼等，即使古文大家，又是四六文作者，两种文体兼备。 ​ 宋代四六文受古文影响，文风趋于疏淡明朗和朴实平易，与唐人的骈文是有所不同的。 ​ 宋赋​ 宋代文人的赋除了汉大赋和拟六朝排赋之外，真正具有宋朝特色的，是受古文影响的议论化、散文化的赋，亦称文赋。题材以感时伤怀或对景言志之作为主，如欧阳修的《秋声赋》、苏轼的前后《赤壁赋》等。 ​ 话本小说​ 由民间讲唱文学发展而来、流行于市井的俗文学。 ​ 讲唱文学： 由散文和韵文组成的有讲有唱的一种文体，宋代的讲唱文学有以讲为主的话本，也有以唱为主的鼓子词、诸宫调、覆赚等。 ​ 话本小说是以口语记录下来的白话小说，继承唐“说话”的传统而来，在宋朝，说话这一技艺盛极一时。 ​ 话本小说成为中国白话小说的开端。 ​","link":"/2019/02/19/宋代文学（一） 宋代文学绪论/"}],"tags":[{"name":"诗词类","slug":"诗词类","link":"/tags/诗词类/"},{"name":"网站推荐","slug":"网站推荐","link":"/tags/网站推荐/"},{"name":"笔记：西方哲学史","slug":"笔记：西方哲学史","link":"/tags/笔记：西方哲学史/"},{"name":"JavaScript","slug":"JavaScript","link":"/tags/JavaScript/"},{"name":"笔记：中国文学","slug":"笔记：中国文学","link":"/tags/笔记：中国文学/"}],"categories":[{"name":"创作","slug":"创作","link":"/categories/创作/"},{"name":"前端","slug":"前端","link":"/categories/前端/"},{"name":"哲学","slug":"哲学","link":"/categories/哲学/"},{"name":"文学史","slug":"文学史","link":"/categories/文学史/"}]}