{"pages":[],"posts":[{"title":"JavaScript选项卡功能","text":"本文作为一个我学习了blue大佬js视频的小笔记。 在各种网站中JavaScript的选项卡一个非常实用而且常见的的功能，笔记中会详细的记录如何实现这个功能的。 选项卡效果演示请大家原谅我不知道如何在markdown里面放置动图…. 原始效果 这个效果的结构由上面的具体月份+下面每个月的任务安排构成。 想要实现的效果是当我鼠标移动到每个月份的时候，下面的任务随月份而改变，就像这样： 当我的鼠标移入到2月份的时候，下面的任务就变成了“快乐学习”。 如何使用js实现这种快速而且代码不冗杂的情况下实现这个选项卡的功能呢？请继续往下看。 html代码首先放置我的html的代码。从代码可以看见，我的具体任务盒子就设置了一个，这样做的好处是不会让html的代码放置过多的盒子，使得html的代码更加容易理解和解读。 12345678910111213141516171819202122232425262728293031323334353637&lt;!--这是html--&gt; &lt;div id=\"study\"&gt; &lt;!--这是我的标题--&gt; &lt;h2&gt;前端学习计划&lt;/h2&gt; &lt;!--这是具体的月份--&gt; &lt;ul&gt; &lt;li class=\"active\"&gt; &lt;h3&gt;1月&lt;/h3&gt;&lt;span&gt;Jan&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;2月&lt;/h3&gt;&lt;span&gt;Feb&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;3月&lt;/h3&gt;&lt;span&gt;Mar&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;4月&lt;/h3&gt;&lt;span&gt;Apr&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;5月&lt;/h3&gt;&lt;span&gt;May&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;6月&lt;/h3&gt;&lt;span&gt;Jun&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;7月&lt;/h3&gt;&lt;span&gt;Jul&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;8月&lt;/h3&gt;&lt;span&gt;Aug&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;9月&lt;/h3&gt;&lt;span&gt;Sept&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;10月&lt;/h3&gt;&lt;span&gt;Oct&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;11月&lt;/h3&gt;&lt;span&gt;Nov&lt;/span&gt;&lt;/li&gt; &lt;li&gt; &lt;h3&gt;12月&lt;/h3&gt;&lt;span&gt;Dec&lt;/span&gt;&lt;/li&gt; &lt;/ul&gt; &lt;!--这是放置每个月任务的盒子，这里我默认显示了1月--&gt; &lt;div id=\"task\"&gt; &lt;h4&gt;1月任务&lt;/h4&gt; &lt;p&gt;好好学习&lt;/p&gt; &lt;/div&gt; &lt;/div&gt; css代码这是css代码，细节的朋友会发现，我 并没有在css里面设置hover属性，因为我都使用了js来完成鼠标事件。 具体的配色我会在文中末尾备注，喜欢配色的朋友可以直接使用。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950/*这里是css代码*//*设置最外层盒子的样式*/#study { width: 520px; margin: 20px auto; background-color: #fffae4; padding-bottom: 10px;}/*设置主标题的样式*/h2 { background-color: #40627c; color: #d0a825; text-align: center; height: 50px; line-height: 50px; border-radius: 10px 10px 0 0;}/*使下面任务盒子的标题没有外边距*/h4 { margin: 0;}/*使用flex布局，让每个月按我需要的形成3行4列*/ul { list-style: none; display: flex; flex-wrap: wrap;}/*设置每个月份之间的距离和自身颜色*/ul li { margin: 5px; float: left; text-align: center; border: 1px solid pink; width: 100px; height: 100px; background-color: #e8e595; color: #d0a825;}/*这里是下面任务盒子的样式*/#task { background-color: #e8e595; height: 80px; margin: 10px 40px; color: #40627c; padding: 10px;}/*这是上面每个月份鼠标移入时候的颜色*/.active { background-color: #40627c;} js代码这里是js代码，大家结合注释仔细的看就好了。 12345678910111213141516171819202122232425262728293031323334//这里是js的代码 &lt;script&gt; //定义一个数据来存放每个月的任务，以后只需要修改数组内容就可以修改页面显示的任务内容了，我只定义到4月 var arr = [ \"好好学习～1月\", \"快乐学习～2月\", \"放弃学习～3月\", \".....~4月\" ]; //这三组是把html的元素存放在我定义的变量里 var oDiv = document.getElementById(\"study\"); var aLi = oDiv.getElementsByTagName(\"li\"); var aDiv = oDiv.getElementsByTagName(\"div\")[0]; //开始循环 for (i = 0; i &lt; aLi.length; i++) { // 设置一个index来计算月份 aLi[i].index = i; //鼠标移入的时候 aLi[i].onmouseover = function() { for (i = 0; i &lt; aLi.length; i++) { //首先清除每个html里的每个li的active类名，使他们的颜色变为默认 aLi[i].className = \"\" } //给html里的每个li设置active类名，获得背景色 this.className = \"active\"; //i从0开始算，+1从1开始计算 // 使用括号包裹this.index+1，数字优先相加，避免被拼接成字符串 //用数组来定义每个月的任务 aDiv.innerHTML = \"&lt;h4&gt;\" + (this.index + 1) + \"月任务&lt;/h4&gt;&lt;p&gt;\" + arr[this.index] + \"&lt;/p&gt;\"; } } &lt;/script&gt; 页面配色为了显示效果，我加粗了文字效果 内容所属 色号 标题、任务字色与悬浮色 #40627 背景色 #ffae4 月份字体色 #d0a825 月份背景色 #e8e595 以上就是全部的内容，感谢观看。","link":"/2019/11/06/JavaScript选项卡功能/"},{"title":"《长生集》","text":"结就长生集，以慰心中事。 书恨卷帘流风去，行雁行又归。闲漫翻古籍，书晦凋华姿。竟夕殊未止，翌日复还来。欲弃圣贤去，唯恐负芳菲。芳菲虽不待，合梦柳枝垂。晴雪依野渡，醉眼顾采薇。 圣诞节·林总别家有感常恐佳节至，孑然亦孤身。提笔知言浅，独酌醉风尘。昔我折柳去，今夕又一春。春色凉如故，久立渐沉沦。已辞故乡久，碌碌谁可闻？更声忽欲止，蜡尽泪无痕。欲返山河远，叶落难归根。 白发近来，因职业之故，对空巢老人多有接触。作散诗《白发》，感念春秋。寂寂长街雪，但闻犬吠声。农户夜不寐，白发悄点灯。子欲远行去，锁眉细拈针。缝作红马褂，望儿只母心。旦辞故乡去，经年杳无闻。白发如枯槁，南望又一春。洞房花事好，红烛情意真。白发病中卧，垂眼意沉沉。衣锦归故里，欲报慈母恩。寻母母不至，孤冢草木深。 与小冰接诗2首谁驱阳春化白雪，惊蛰谹谹夜闻蛩。柳絮积阴成宿雨，新草芃葆笑更浓。调筝亦无知音赏，垂眸拭茶心渐空。桃李倾花不为我，我自抱梦向东风。 又 雨打浮萍远，风压芦苇低。漂漂千里游，蹉跎欺故枝。羁旅花落尽，独坐月盈时。夜半犹言早，灯下已兴迟。朔风温清酒，桑梓言我痴。何处无皎月，何必吟苦诗。我报关山险，飞光无慈悲。 悼怀长者余光中长者忽已殁，但闻竟彷徨。初识《乡愁》里，感君心劳伤。自古多豪俊，天意不使长。太白醉月落，武侯草凄凉。灵均遗壮志，太傅鸿文央。人生何所似，念此意惶惶。寻梦携鹤去，惊起觉露霜。感此语呜咽，事事本无常。 闲情桃花染小园，金缕拂庭轩。敛裙檐下坐，淡香合书掀。 忆公瑾猜是今生无缘分，杳杳相隔记不真。君笑赤壁我未生，我生君是梦里人。安能求君一回见，道阻迢迢夜更深。乾坤阴阳无处觅，惟以此文寄鬼神。 依谱填词菩萨蛮南风一夜知花少，空山不语钟声杳。倦意眼朦胧，拭茶闲意空。调筝金兽晚，意尽歌声浅。之子归徐徐，情真还是疏。 沁园春·赠秦淮歌女皓月当空，隐隐琴声，良辰正佳。绘满庭风月，幽馆僻路，碧竹情节，十里桃花。是旧时人，横笛轻奏，怕惹杨华居水涯。更年换，倚红墙凭望，落日微斜。 时光散落昨天，细数过，遗甜果蜜瓜。看朱颜鸾镜：风情依旧，初心尤存，姿态仍佳。目敛清辉，双眸锁恨，不说经年旧琵琶。都言是，那三年旖旎，碾尽芳华。 临江仙忘故 寂寂梧桐长夜雨，策马碾碎香魂。凭栏闲看落花纷。风微落幕，笑我太天真。 对月庐边曾醉酒，渐行渐远无闻。青春莫作恨来瞋。无缘无份，且过且消痕。 采薇 青草涧边虫斗趣，稻香深处鸣蛙。迷津野渡小船斜。搴惟花尽，风入响青瓜。 农妇炊烟随袅袅，孩童嬉笑年华。功名不过指中沙。抱琴携鹤，白鹭作邻家。 岁末有感 月隐重楼楼静谧，长街银杏翩跹。裹衣呵手去冬寒，凉风有恨，欺我未着冠。 年少不知花事晚，如今行事弥坚。来年春燕去归还，藏诗千万，笔落尽书笺。 问情 幼时问情懵懂，支颐轻笑容容。少时问情情意浓，伤春悲往事，沉醉眼朦朦。 近日问情凝噎，蜷身侧卧意空。沉思漫看落花风，自先沉稳后，再论与谁同。 发奋 深巷朦胧微雨，长风摇曳春花。经年底事已音哑。随波逐浪去，碌碌葬天涯。 壮志怎堪零落，初心续作无暇。青云为盖地为家，纵观天下事，挥遒写风华。 杂心闲赋归心赋红尘之飘零兮，常徘徊而不往。采山间之葛藤兮，燃灯絮而织就。绘阴阳之云肩兮，枕风月而成眠 。感君子所遇兮，欲言而又止。凝故心成赋兮，借文章以歌咏。 驾鲲鹏以遨游兮，骋天地而凌风。御人间之车马兮，扶楼阙而高歌。览盛世之灯火兮，观八方之气象。守本心之不尘兮，携君子而归宁。 结庐于东篱兮，散发而乘凉，漫步于山林兮，拈花而寻芳。访故居之樵者兮，以素心而为友。因君子之陪同兮，觉人世而无忧。愿四时之变化兮，并肩而不惧。或昼夜之更替兮，偕行而同作。 嗟乎！路之修兮，搀扶而共勉。运之薄兮，风雨而同舟。托君以红颜兮，虽伤而未悔。望生涯之迢迢兮，长伴而不弃。 现代诗题北仓图书馆昼夜的更迭， 是时间的沧桑。 于万盏浮灯下高歌， 在八方俱寂中凝望。 追溯岁月的痕迹， 偶然听见历史的绝响 从此， 他将文化复兴， 铭记在心， 悄然刻画纸上。 绕过摩肩接踵的人群， 穿过沉寂古拙的街巷， 顿足俯仰。 我看见， 他用坚韧的意志， 记录城市过往， 寒来暑去， 锻造今天的北仓。","link":"/2019/02/26/《长生集》/"},{"title":"前端学习的4个网站","text":"大部分的人心中都有一个编程梦，能使用自己编写的软件，那将是一件多么cool的事。真正选择从事程序员行业的只是诸多梦想家中的践行者。梦想家们以诸如：“我数学不好”、“我逻辑太差”、“我英语不行”的借口使自己宽慰。实际上在真正开发过程中，可能更需要的其他的一些品质。比如：坚持、求新、思考、发量。 前端是一门包括html/css、JavaScript的语言，入门比较快，能在很短的学习周期内建立第一个静态页面，在继续学习的过程中，你甚至更创建一个无比炫酷的网站。 这次推荐4个能够系统学习前端的网站。 1.W3shool链接：https://www.w3school.com.cn/ W3shool的前端基础知识比较全面，非常适合作为新手的入门进程。它提供在线实例测试工具。根据w3cshool规划的目录，可以很快的对前端有一个初步的认识。 令人遗憾的是W3shool在解释某些内容时存在一些错误，而且内容比较少，不能深入学习。 2.Techbrood链接：https://techbrood.com/h5b2a?p=index Techbrood适用于对前端有了初步认识的朋友进阶，适合精细化整理前端知识。 该网站的内容包含了： web简介 html5入门 css3入门 svg入门 JavaScript入门 css3进阶 html5进阶 …… Techbrood的 3.IT 修真院链接：http://www.jnshu.com/occupation/1/task IT修真院属于培训机构。我并非是推荐大家去报班学习，我们可以利用修真院的任务来锻炼我们已经学习过的前端技术，而且可以通过提交任务让师兄免费为我们检查代码并给出他们的意见。 对于初学者而言，修真院前期的任务比较难，可以通过其他人的提问及回答来丰富自生的知识。 在学习中修真院并不提倡看视频学习而是要去在实际操作中查阅资料，这个观点要根据我们自己的实际情况来作出反应。 ps.如果大家觉得必须要抱一个培训班，建议多横向对比，多去知乎、简书等平台看看已经培训过建议。 4.MDN web docs链接：https://developer.mozilla.org/zh-CN/ 没什么说的，MDN是前端最全面、最系统、更新最快的文档学习地方。","link":"/2019/11/01/前端学习的4个网站/"},{"title":"前苏格拉底哲学","text":"古希腊城邦 —— 共同体中的人​ 核心特征： 城邦制、小国寡民 ​ 政治上： 直接民主制 ​ 希腊哲学的根本观念： 和谐与秩序 ​ 贸易的发展导致度量衡的标准化，开始铸造钱币。社会差别开始出现。 ​ 第一代 泰勒斯 （阿那克西曼德——阿那克西米尼） ​ 第二代 赫拉克利特 巴门尼德 ​ 第三代 恩培多克勒 阿那克萨戈拉 德谟克利特 ​ 其他流派 毕达哥拉斯学派 泰勒斯公元前5世纪生活在希腊殖民地米利都（公元前624年~公元前546年），依据是希罗多德的说法：泰克斯正确预测了依此据认为发生在公元前585年的日食。传说泰勒斯到过埃及，测量过一座金字塔的高度，其办法是在一天中当他影子的长度等于他身体长度的时候测量这座金字塔的影子。 亚里士多德《形而上学》说泰勒斯首创了一种寻求万物本原和归宿的哲学，并相信这种本原或来源是水。 泰克斯追问什么是宇宙的最根本的建筑材料。实体（构成基础的东西）代表的是变化中不变元素和多样中的统一性。实体问题后来成为希腊哲学的主要问题之一。 泰勒斯对变化如何发生的问题作出了一个间接的回答：始基（水）从一种状态变成另一种状态。变化的问题也成为希腊哲学的一个基本问题。 从神话思维进不到了逻辑思维 ​ 前提： 变化是存在的。 ​ 问题： 所有变化当中不变的元素是什么？ ​ 论据： 对水的观察。 ​ 答案： 水是所有变化中的元素。 ​ 蕴意： 万物是可以理解的。 阿那克西曼德和阿那克西米尼阿那克西曼德和阿那克西米尼都是米利都人。阿那克西曼德大概生活在公元前610年到前546年之间，与泰勒斯同时代，但比他年轻一些。阿那克西米尼可能生活在大约公元前585年到前525年之间。阿那克西米尼只留下三份简短的残篇，其中一篇可能还是伪作。 阿那克西曼德 他不认为水是不变的始基，他认为始基是apeiron。但是他“损失”了某种东西：apeiron并不像水那样可观察，用非感性的东西来说明感性的现象、对象及其变化。 阿那克西米尼 他关注泰勒斯的答案中的另一弱点。水从自己的未分化的状态转变为它的种种分化的状态，泰克斯并没有回答这个问题。阿那克西米尼断言：气是始基。气的“聚集状态”是由温度和密度决定的。后来被称为四元素的四种实体，阿那克西米尼都提到了：土、气、火和水。 泰克斯、阿那克西曼德和阿那克西米尼被叫做米利都学派的自然哲学构成了第一代希腊哲学家。他们之后的哲学家们以一种逻辑的方式追随着他们的思想。 赫拉克利特、巴门尼德、芝诺赫拉克利特 他是不为世人所理解的愤世嫉俗隐居哲学家，常用晦涩但意味深长的隐喻方式表达自己的观点。米利都的哲学家们明确的涉法原理神话的东西，赫拉克利特则常常用近乎神话的形式表达思想，他运用直觉和相信。他的著作中常提到其他哲学家，一个哲学传统建立，包含着种种内部的争辩和评论。 第一代哲学家假定发生变化，追问贯穿所有变化的不变的元素是什么。第二代哲学对这个前提提出质问：变化存在吗？ 赫拉克里特：万物都处于不断的变化或流动之中。 巴门尼德： 没有任何东西实在变化的状态之中的 ​ 赫拉克利特实际所说的是： 万物处于流动状态之中。 但是，变化是根据一种不变的规律发生的。 并且， 这种规律包含了对立面的相互作用。 但是这种对立面相互作用的方式，作为一个整体创造出和谐。 他并不否人事物可以持续相当长的时间，但在所有有生有灭的对象背后并支持着这些对象的基本原则是不同力量之间的相互作用，而这些力量之间的平衡是根据规律或logos而发生变化的。作为其基础的实体并不是始基，而是logos，它多样性中的隐蔽的统一性。 赫拉克里特难以诠释：将火作为始基；还是将火这个词当作变化的比喻？ 赫拉克利特： 一切事物都能转换成火，火也能转换成一切事物，正像货物换成黄金，黄金换成货物一样。 赫拉克利特关于不同交替力量之间的紧张关系的那个一般命题：战争或冲突。指的是这种宇宙论紧张关系，正是这种紧张关系构成了万物之“父”，即万物的基本原则。 赫拉克利特：战争是万物之父，也是万物之王。 巴门尼德 是赫拉克利特的同时代人，公元前500年前后在哲学上很活跃。他住在南意大利的希腊殖民地爱利亚。据说巴门尼德在他的家乡是一个德高望重的人，他积极参加公共事务和政治事务，包括立法。巴门尼德写了一首几乎完整地流传下来的哲学诗篇。我们还拥有像柏拉图的《巴门尼德篇》这样的第二手材料。 巴门尼德声称变化在逻辑上是不可能的，重构论证如下： 凡所是【存在】的，是【存在】着。 凡所不是【存在】的，不是【存在】。 凡所是【存在】的，可以被思想。 凡所不是【存在】的，无法被思想。 ​ 变化这个观念蕴含着某物的进入是【存在】的状态，以及某物不再具有是【存在】的状态； 比方说，一个苹果从绿的变成红的。绿这种颜色消失了，变成“非是【非存在】”。这表明变化预设了非是【非存在】，也就是无法被思想的东西。我们因此无法用思想来把握变化。因此，变化是逻辑上不可能的。 巴门尼德清楚知道感官知觉的各种各样变化，提出两难： 理性说在变化在逻辑上不可能，而我们的感觉则告诉我们变化是存在的。巴门尼德作为典型的希腊人，以理性的方式告诉我们必须相信理性：理性是正确的；我们的感觉在欺骗我们。 反对意见说，这是精神失常的说法。这种反对意见在巴门尼德在世时就已经有人提出了。但是，我们还是要看一下蕴意。到那时为止人类历史上还从未有过像这样完全依赖于逻辑的思路，哪怕是他们的感觉的证据也无法动摇他们的事情。在这个意义上巴门尼德是第一个理性主义者。巴门尼德有意将其理性论辩进行到底，这意味着他是对逻辑推理的发展作出实质性贡献的第一批人之一。 巴门尼德在理性和感觉之间建立了一个不可调和的分野： 理性承认实在是静止的，是一个统一体。感觉仅仅告诉我们一个处于变化状态、具有多样性的非实在。 巴门尼德对感觉和可感对象尤其忽视，以至于好像感觉所呈现的任何事物都被认为是缺乏实在性的。可感对象不是【存在】，如果对巴门尼德的这个诠释是正确的话，我们几乎可以说他是一元论的一个代表：所是【存在】的，是一种类型的东西，而不是多种类型的东西，而这种实在只能通过理性被把握。 芝诺 是巴门尼德的学生，他设法为巴门尼德关于变化是逻辑上不可能的学说进行辩护。其办法是表明相反的学说——认为变化是可能的——会导致逻辑悖论。 芝诺设法用阿基里斯和乌龟的故事来表明这样一种悖论： 居间的立场： 恩培多克勒和阿那克萨戈拉第三代哲学家既主张万物处于流动状态之中，又主张变化是不可能的“一种合理的反应是说这两种说法都错了；真理处于两者之间：某些事物处于流动状态之中，而其他事物则处于静止状态之中。 第三代哲学家把他们的任务看作是在赫拉克利特和巴门尼德之间进行协调，所以被称作居间的哲学家的缘故。 恩培多克勒 公元前492年到前432年，居住在西西里的阿克拉家，既是一位自然哲学家，也是一位先知。 他考虑四元素：火、气、水、土和恨（分割作用）、爱（统一作用） 区别于米利都学派： 存在四种不可变化、原始的元素（泰勒斯和德谟克利特） 四元素保持自己的特性 不同量的四元素可能彼此结合（分解）（统一（分裂）的力量） 除了原始实体外还存在其他力量，变化和力量不是内在于原始实体的（参见亚里士多德）居间的哲学家告诉我们，自然哲学是如何朝着德谟克利特及其原子论学说发展的。 阿那克萨戈拉 公元前498年到前428年。雅典是他公共生活的中心，他曾与伯里克利有交往，当他离经叛道观点与传统信仰发生冲突时，不得不离开雅典，除了他的其他观点之外，他还主张太阳并不是神祇，而是一团炽热的火球。 元素是无限的，对变化的解释与恩培多克勒相同 只考虑一种力量——心灵。这种心灵或力量驱动变化朝向一个目标 德谟克利特公元前460年到前370年，来自色雷斯的阿布德拉。涉足当时多数科学分支“论幸福”，“论死后的生命”，“论世界秩序和思维规则”，“论节奏与和谐”，“论诗”，“论农业”，“论数学”，“论正确的语言和含糊的语词”，“论和谐的字母和不和谐的字母”，等等。” （🐸牛皮，反正我是跪了） 原子论： 存在一种始基——不可分割的微小粒子，它们在虚空中运动，仅受机械方面的规定。虚空，非存在，是存在——是原子运动的前提条件。 ​ 问题 答案 ​ （什么） 1. 不可分割的微小粒子（原子） ​ …… 2. 虚空 ​ （如何） 3. 机械决定论（不是由神圣的理性或人类的理性所决定结合或分解） 毕达哥拉斯学派早期哲学重要流派，成员从公元前540年起生活在南部意大利的希腊殖民地。毕达哥拉斯学派是有关实体、自然的根本元素和变化的老问题。然而不同于其他流派，他们的基本观念不是物质元素，而是结构和形式，或数学关系。数学知识之所以是确定，还因为数学定理时候逻辑上被证明。 主张自然之门用数学打开： 对和声学的研究表明，在数学和像音乐这样非物质的东西之间也有一种对应。 毕达哥拉斯定理表明，数学也可以运用于物质食物的。 所谓天体的圆周运动，意味着这些物体也是服从数学的。 毕达哥拉斯学派是在双重意义上理性主义者： 提出以数学证明的形式出现的理论论据。 实在是“基于”所有感性现象之上的数学形式当中发现，人是通过理性而不是感官获得关于实在的知识的。 毕达哥拉斯学派里宗教神秘主义与数学为基础的理性主义并存。 同巴门尼德一样，毕达哥拉斯最后也对世界持二元论观点：","link":"/2019/02/21/前苏格拉底哲学/"},{"title":"宋代文学（三）宋代文学大观","text":"文学作品的鉴赏得置于时代背景之中，然后与作者生平勾联。然而此次，我对历史背景将不做阐述，作者生平与时代背景百科可考，为了节省篇幅，也不做过多介绍。 这篇笔记是以宋代文学的创作者为主线，介绍其创作风格及对文学发展的贡献，偶尔会摘录代表性作品。 内容枯燥，谨慎入内。 北宋初期文学北宋初期文学处于沿袭躺五代文风的过渡阶段，为宋代文学的发展作了铺垫： 柳开等人倡导和写作的古文； 王禹偁革新诗风和文风； 杨亿等人的西昆体； 晏殊令词创作 柳开著《河东先生集》 反对五代浮艳文风，回复“韩柳”古文传统。主张文道合一，提倡复古、简朴文风。 穆修柳开之后的古文作家。 强调教化作用，力求结构章法变化，多用散行单句，不堆砌文藻，不追球艳丽。 王禹偁诗歌平淡清远，为文古雅简淡。代表作《小畜集》 他散文表现出的平易自然的风格成为欧阳修诗文改革运动的先绳。 作品分期： 早年：学习白居易的闲适唱和诗； 贬官后：学习白居易讽谕诗，更进学杜甫诗风 七言古诗学习白居易的平易风格； 近体诗、绝句尚有清淡清远的格调 倡导古文写作，反对五代的雕绘风气，创作古雅简淡的作品。其中多有现实的政治内容和鲜明的思想倾向。 12345西昆体是宋初的文学创作风格。讲究修辞，大量用典故，以学问为诗。整体上注重形式，轻内容。艺术上学习李商隐的风格，呈现出整饬、典丽的艺术特征。代表人物：杨亿、钱惟演、刘筠 杨亿西昆体代表诗人，与王钦若等编撰《册府元龟》。 作诗讲究辞采，风格典丽，表现才学和功力，也有清峭感怆的讽谕之作。 123晚唐体是模仿唐朝贾岛、姚合的诗作，主题多为清逸隐幽。代表人物：林逋 林逋“梅妻鹤子”，以江湖散人子诗装点山林，用细碎小巧的笔法写清苦幽静的隐居生活。 诗歌风格：孤淡清逸。 《山院小梅》 众芳摇落独暄妍，占尽风情向小园。 疏影横斜水清浅，暗香浮动月黄昏。 霜禽欲下先偷眼，粉蝶如知合断魂。 幸有微吟可相狎，不须檀板共金樽。 晏殊继承唐五代词的艺术经验，作词在语言上明净雅致，构思上曲折精巧，内容上表现了情感经历和对人生的思考，直接影响欧阳修、晏几道等人。 风格：含蓄委婉 代表作《珠玉词》《晏元献遗文》（清代人所著） 《踏莎行》 小径红稀，芳郊绿遍，高台树色阴阴见。春风不解禁杨花，蒙蒙乱扑行人面。 翠叶藏莺，朱帘隔燕，炉香静逐游丝转。一场愁梦酒醒时，斜阳却照深深院。 北宋诗文革新北宋中叶的古文运动出了确定古文在散文领域的正宗地位，而且作诗也讲究“气格”、“以文为诗”。其中欧阳修是这场运动的文坛盟主，他对众文人的推崇，有力推动了北宋文学的发展，使宋诗、词自具面目，宋代士风和文风从根本上开始转变。 欧阳修北宋诗文革新运动的领导者，继承发扬韩愈的古文理论，开创一代文风，同时也对诗风和词风进行了革新。 文学贡献： 文 散文：学习韩愈，发展“文从字顺”，言简而明、信而通。 特点：从具体事物出发，写得婉转曲折、含蓄蕴藉。同时又使得文章富有情感和 诗味。 代表作《醉翁亭记》 赋：开启宋赋先河，变骈偶对仗为骈散相间、奇偶错杂。保留赋铺陈叙述的特性，又让文章趋于和缓。 诗 学习韩愈的“以文为诗”，诗歌创作散文化 追求气格 开创了取材广泛、命题新颖、以文为诗及议论为诗的风格 词 与晏殊同为北宋初花间词人代表，除占比例较大的情词外，也有抒发旷达胸怀，风格豪放的作品。 《浪淘沙》 把酒祝东风，且共从容。垂杨紫陌洛城东。总是当时携手处，游遍芳丛。聚散苦匆匆，此恨无穷。今年花胜去年红。可惜明年花更好，知与谁同？ 梅尧臣与苏舜钦齐名“苏梅”，著《宛陵先生文集》。 艺术特点：平淡其表，深邃其里 诗歌“古淡”，社会矛盾与个人身事激变时，趋于劲峭苦硬； 宦途不顺归隐山林，则表现为冲和恬淡，蕴含深意 《鲁山山行》 适与野情惬,千山高复低。好峰随处改,幽径独行迷。 霜落熊升树,林空鹿饮溪。人家在何许?云外一声鸡。 苏舜钦采用豪犷激切、直抒胸臆的方式写诗： 前期：揭露和抨击时弊，有奋不顾身的气概，也有粗燥、生硬，缺乏隽永的缺点。 后期：诗风多变，寄情山水，有幽独闲放的趣味。 《淮中晚泊犊头》 春阴垂野草青青，时有幽花一树明。 晚泊孤舟古祠下，满川风雨看潮生。 王安石创造“半山体”（又名”王荆公体“），有《王临川集》《临川集拾遗》 文学成就： 文：重以致用，简练明快，笔力雄健 政论文：严谨，语言朴素简洁，说理透彻； 散文：议论说理见长； 小品文：笔力雄健，富有感情，文风峭刻； 议论文：结构严谨，析理透辟； 叙事抒情文：随笔挥洒，曲尽其妙。 诗词：化奇崛于寻常，既清新闲适，又沉郁悲壮，被称为“半山体” 早期：直抒胸臆，意味较薄 晚年：以绝句为主，新颖别致，雅丽精绝，形成“深婉不迫‘的风格，体验宋诗风貌，又有唐诗复归倾向。 《书湖阴先生壁》 茅檐长扫净无苔，花木成畦手自栽。一水护田将绿绕，两山排闼送青来。 曾巩世称“南丰先生”，文章“古雅、平和、正直“，著《元丰类稿》。 文学特点： 追求雍容典雅的艺术风格，文章冲和平淡，委屈周详； 长于议论，引经据典，明白详尽； 布局谨严，节奏舒缓，语言干净，思致明晰。 代表作 《墨池记》 苏洵苏洵文章以学养为基础，重气势，有战国纵横家色彩，擅长散文，尤其擅长政论文。著《嘉祐集》。 写作特点：结构谨严、说理周详、气势磅礴、曲折多变。 文风：精练劲建、简古质朴；笔锋老辣，纵横博辩。 苏辙学习欧阳修淡泊平和文风，议论以稳健见长。著有《栾城集》。 作品委婉纡徐的艺术情趣融入其中，苏轼称其散文“汪洋淡泊，有一唱三叹之声，而其秀杰之气终不可没”。 苏轼文学成就： 散文成就 议论文 纵横捭阖，气势充沛，雄辩恣肆； 议论透辟，通俗明晓，深入浅出，文采斐然。 记叙文 文学价值最高，最具独创性的，以山水游记和亭台堂阁记为代表； 游记表现出借景立论的特点； 记叙文为文学性散文，展现苏轼随物赋形的本领，体现他才情横溢的奇思妙想 诗歌创作 创作概况 主要分为：社会政治诗、山水景物诗、和陶诗、题画诗 以贬谪黄州为界限，早期写富有批判精神的社会政事诗，后期则抒发被贬后的感慨。 创作特色 “以文为诗”，以议论为诗，将事物形象感受与哲理思考结合； 创造“东坡体”，擅长七言，风格多样； 基本风格： 刚健含婀娜的清丽雄健； 豪放加平淡的清旷闲逸。 词的革新意义 超旷高远胸襟 “以诗为词”，用诗的品格改造传统本色的词体，用诗的精神提高词的品味 题材的拓展 士大夫文人的生活内容带到词中； 将情感范围扩大到朋友、师生、兄弟、夫妻之间； 农村题材正式入词 咏物词有开拓之功 豪放旷达的风格 打破了以婉丽柔媚为美的局限，抒发士大夫情致的创作心理； 苏词气象宏大，雄健清刚，创新词风，突破音律束缚。 《冬景》 荷尽已无擎雨盖，菊残犹有傲霜枝。 一年好景君须记，最是橙黄橘绿时。 《望江南》 春未老，风细柳斜斜。试上超然台上看，半壕春水一城花，烟雨暗千家。 寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶，诗酒趁年月。 江西诗派江西诗派是以黄庭坚为宗主、对宋代影响最大的诗歌流派，他们对宋诗的发展有很大贡献。 黄庭坚著《山谷集》《山谷外集》《山谷别集》。 题材内容： 日常交际应酬的赠答诗、次韵诗、咏物诗； 反映民生疾苦和时事政治的诗，直接涉及现实； 表现自我人格和襟怀的抒情写意诗。 诗歌特色： 学习杜甫诗歌，多用拗句； 以学问为诗，以故为新，变俗为雅，追求生新瘦硬，工于练字（善用动词、形容词、语助虚词） 创造“山谷体” 基本特征：求生避熟，求雅脱俗 艺术特点： 学杜为宗旨，重视句法，发展拗句、拗律的体制； 强调“无一字无来处”，用典以故为新、变俗为雅，长于点化铸造，富有思致和机趣； 好奇尚硬，造语洗净铅华，独树隽旨，风格生新瘦硬峭拔，兼备浏亮芊绵的一面。 词： 雅俗并存： 一方面词名颇高，但词风俚俗； 雅词带有兀拗俊洁的个性色彩。 《寄黄几复》 我居北海君南海，寄雁传书谢不能。桃李春风一杯酒，江湖夜雨十年灯。持家但有四立壁，治病不蕲三折肱。想见读书头已白，隔溪猿哭瘴溪藤。 《清平乐》 春归何处。寂寞无行路。若有人知春去处。唤取归来同住。 春无踪迹谁知。除非问取黄鹂。百啭无人能解，因风飞过蔷薇。 陈师道作诗凭学力专精，讲苦吟，求奇拙。 创作力求精简字句，摒弃华辞丽藻，其诗无华无才，只有瘦硬。 创作“后山体”诗风。 陈与义创造“简斋体”，著有《简斋集》。 诗歌创作： 前期：内容多为抒怀、咏物、唱和的作品，风格清新冲淡，明净雅致。 后期：内容多为忧国感时，诗风雄阔浑厚，沉郁悲壮。 简斋体： 指他后期创作的诗歌； 对仗不注重字面的工稳精巧，注重上下句的气脉联系，让诗的意境更加圆融； 诗风遒劲，思力沉挚，取材和诗境恢弘，形成了雄浑、沉郁的独特艺术风格。 北宋词坛可分为三个时期： 北宋词初期：继承花间派与南唐词风而有变化 北宋词创造时期：出现了一批推动宋词发展的关键人物 北宋词总结期：集大成者的周邦彦与南渡词人 柳永北宋最有名“通俗歌曲作家”，北宋和南宋诗词承先启后的词人，著《乐章集》。 题材内容： 表现下层市民情感、观念、价值标准； 言情词，描写风尘女子与艳情； 羁旅行役词； 城市风光； 柳永词的开拓意义： 继承了民间词的传统； 扩大了题材内容（主要在于文化下移）； 对宋词的贡献： 创制慢词，完善慢词体制和表现手法； 章法上，注重叙事完整，描写细腻的效果，语言通俗（柳词广泛流传的根本原因）； 韵脚平仄的变化，吸引和感染观者； “曲祖”称号 《八声甘州》 对潇潇暮雨洒江天，一番洗清秋。渐霜风凄紧，关河冷落，残照当楼。是处红衰翠减，苒苒物华休。唯有长江水，无语东流。不忍登高临远，望故乡渺邈，归思难收。叹年来踪迹，何事苦淹留？想佳人妆楼颙望，误几回、天际识归舟。争知我，倚阑杆处，正恁凝愁！ 秦观与柳永合称“秦柳”，与周邦彦合称“秦周”，著《淮海词》（又名淮海居士长短句） 题材：相思离别的情感； 音律上：平仄协调、音节和谐、节奏鲜明，具有音乐美； 特点： 清新雅致又明白晓畅 抒情中融入议论，委婉深沉又自然流畅 《减字木兰花》 天涯旧恨，独自凄凉人不问。欲见回肠，断尽金炉小篆香。黛蛾长敛，任是春风吹不展。困倚危楼，过尽飞鸿字字愁。 晏几道著有《小山词》。 题材：爱情生活 词风：语言清丽、感情真挚 《临江仙》 梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时。落花人独立，微雨燕双飞。记得小蘋初见，两重心字罗衣。琵琶弦上说相思。当时明月在，曾照彩云归。 贺铸俗称“贺龟头”，诗集《庆湖遗老集》，词集《东山词》。 艺术特点： 盛丽、妖冶者继承花间词风，如《青玉案》，得到“贺梅子”称号； 抑塞不平之气时于笔端发之。 周邦彦“正宗”、“集大成”者，与柳永并称“周柳”，著有《清真集》《片玉集》。 题材内容：男女之情，相思离别。 艺术成就： 继承柳永铺叙的特点，曲折变化； 章法布局开阖回旋，既有柳永的叙事容量和感情力度，又避免了直露无余，章法布局上常使用不同感情的相互衬托手法；以景结尾。 语言典雅、音律精严，融前人诗词入句。 《旧游·记愁横浅黛》 记愁横浅黛，泪洗红铅，门掩秋宵。坠叶惊离思，听寒螿夜泣，乱雨潇潇。凤钗半脱云鬓，窗影烛光摇。渐暗竹敲凉，疏萤照晚，两地魂消。 迢迢，问音信，道径底花阴，时认鸣镳。也拟临朱户，叹因郎憔悴，羞见郎招。旧巢更有新燕，杨柳拂河桥。但满目京尘，东风竟日吹露桃。 李清照著有《漱玉词》。 《词论》 一是尚雅：指思想的雅正和语言音律的文雅； 二是主张“词别是一家”，诗词有别。 创作风格： 前期：绰约轻倩，自然妩媚，清丽淡雅； 后期：沉郁哀痛。 创作特点： “易安体”； 语言清新淡雅又通俗易晓； 善于将语言变化与声调、词情相结合。 《武陵春·春晚》 风住尘香花已尽，日晚倦梳头。物是人非事事休，欲语泪先流。 闻说双溪春尚好，也拟泛轻舟，只恐双溪舴艋舟，载不动许多愁。 朱敦儒有词三卷，著为《樵歌》。 描写男欢女爱、离愁别绪的传统题材： 南渡前追求的是轻狂放逸的人生境界； 靖康之难后抒发国破家亡的沉痛之情、晚年隐居写了大量隐逸词。 词风为独创的“樵歌体”： 淡而静的空旷境界中，透出潇洒； 风格自然飘逸、语言浅白如话，自成一格。 《西江月》 世事短如春梦，人情薄似秋云。不须计较苦劳心。万事原来有命。 幸遇三杯酒好，况逢一朵花新。片时欢笑且相亲。明日阴晴未定。 辛派词人辛弃疾他代表了南宋爱国词的最高成就，达到了词体艺术的高峰，发出了时代最强音，形成“稼轩体”。著有《稼轩词》，又名《稼轩长短句》。 题材内容： 抒发报国豪情和壮志难酬的悲愤。如《鹧鸪天》《破阵子》 壮志难酬、报国无门的愤懑中注入急切。如《水龙吟·登建康赏心亭》《摸鱼儿》 缠绵之情。《青玉案·元夕》 农村田园的生活和景致。如《清平乐》《西江月·夜行黄沙道中》 艺术成就： 豪放词刚柔并济，婉约词柔中有刚，悲壮中有婉转，豪放中有缠绵，柔情中有刚劲道，是辛弃疾词风的独特之处； 喜好议论、以论为词。用典广播，且典源广泛； 以文为词，采用散文句法，创造用散文句入词。 《菩萨蛮》 郁孤台下清江水，中间多少行人泪？西北望长安，可怜无数山。青山遮不住，毕竟东流去。江晚正愁余，山深闻鹧鸪。 张元干词作特点： 前期：“极妩秀之致”； 后期：慷慨激昂 张孝祥其词反映时代特征，极具艺术感染力。南宋周密《绝妙好词》收集的南宋词中，列为第一。 陈亮特点：以救国安民为己任，表现抗战恢复的之气 刘过特点：多壮语，有稼轩词狂放而又幽默的影子，风格、结构都与辛弃疾相似 南宋中期诗文南宋中期是宋代文学发展的又一高峰，出现“中兴四大诗人”。 陆游古代作家中最高产的诗人，有《剑南诗稿》《渭南文集》。 创作时期： 早期：喜藻绘而至清新脱俗； 中期：豪放悲壮； 晚期：清淡秀逸，风格闲适淡泊，但爱国思想和积极奋斗的精神继续保存。 艺术成就： 古体诗风格悲壮； 律师多悲愤之作； 绝句风格清淡秀逸。 陆游词和散文： 词作风格多样，其中激昂慷慨、清淡秀逸、流利绵密为主； 《渭南文集》以记叙文成就最高：《老学庵笔记》《入蜀记》 杨万里著有《城斋集》。 城斋体： 以日常生活的小情趣为题，想象新奇风趣、语言通俗明快、风格流转圆活的特点。 活法诗： 以自然意象为主，恢复诗人感官的天真状态，表现山水景观所蕴含的自然灵性和知觉情意，诗中充满奇趣和活劲。 《小池》泉眼无声惜细流，树阴照水爱晴柔。小荷才露尖尖角，早有蜻蜓立上头。 范成大 著《石湖居士诗集》。 诗歌： 记事诗 抒写瞻望收复河山的心怀和壮语； 鞭挞统治者的卖国屈辱。 田园诗艺术特点： 田园诗和“田园词”、“悯农诗”合二为一。 《夏日》（其七） 昼出耘田夜绩麻， 村庄儿女各当家。 童孙未解供耕织， 也傍桑阴学种瓜。 朱熹著《四书章句集注》《诗集传》《楚辞集注》 诗歌：以诗喻理，情趣、理趣相交织。语言净洁简理，句法自然平易，风格雅正明洁。 散文：功力深刻、理致周密，不矜才使气看来诗平淡无奇，却深厚简单，含不尽之意于言外。 《春日》 胜日寻芳泗水滨，无边光景一时新。等闲识得东风面，万紫千红总是春。 其他散文中期文坛分为两派： 一派是讲事功的功力派，以陈亮和叶适最为有名，其文章以评论时事和讲乱兴衰为特色； 另一派是道家派，以朱熹、真德秀为代表，多讲学之文和语录体。 个体散文的一般特征： 议论文：以扶贫救倾的议论文成就最高，正气贯注，文字最为明达，。受欧、曾影响，南宋散文文字风格更趋向畅达明快和语体化，但也有追求平易而流为冗慢与粗率的弊端，导致文气冗若。 叙事文：叙事性文章显得纡漫拖沓，碑志比较散漫萎弱。 语录体：理学家以无意为文，无章法约束，过于随意，不以文章论 南宋清雅词派姜夔首创了清雅词派，丰富了词体风格内涵，形成“第三派”。使词能够与传统诗文并列并肩，从传统《花间》、南唐、晏殊、柳永、周邦彦所形成的婉丽传统风格中独立出来。 诗学批评方面《诗说》，见解读到而深刻。 词的创作成就最高，影响最大。有《白石道人诗集》，词集名《白石道人歌曲》 情思内涵： 题材上：以感时伤世，咏物言志和追记恋爱恋情为主。 音调和意境上：有情越、高旷的格调，词中塑造的形象往往融入了他本人所具有的高雅气质。 还有反映家国之感、时政感慨的作品，不以描写的真切、感情的激愤取胜，而是让自己的感情上笼罩上凄清的色彩。 艺术成就： 继承周邦彦，与周邦彦合成“周姜”。清空、骚雅成为白石词独特风格的代称。 清空：清空与质实相对。 清幽空灵的意境。多用素洁的意向，营造清疏高旷的境界。如《暗香》 虚字的使用。使语意转折灵活，流走自如，而又传神入微，且能避免平铺直叙的缺点。如《疏影》 独特的笔法。以柔笔写柔情，并能褪尽铅华，更见清刚。如《长亭怨慢》 音律精严，词中求雅。以雅乐注入词体，主要有两种方法： 以古乐府入词，用古乐的雅音革除今曲的淫靡； 以唐法曲音乐注入词中，使“清”、“空”、“淡”的风格代替胡乐的浓艳急促。 《扬州慢》 淮左名都，竹西佳处，解鞍少驻初程。过春风十里，尽荠麦青青。自胡马窥江去后，废池乔木，犹厌言兵。渐黄昏，清角吹寒，都在空城。杜郎俊赏，算而今、重到须惊。纵豆蔻词工，青楼梦好，难赋深情。二十四桥仍在，波心荡、冷月无声。念桥边红药，年年知为谁生。 吴文英主要效法周邦彦，就追求词的典雅含蓄而言，收姜夔影响较大，因此常把他列为周派词人，著《梦窗词》。 题材： 酬酢赠答之作； 哀时伤世之作； 忆旧悼亡之作； 艺术成就： 讲究用典和用字，形成雅丽风格并有独特的情绪体验和表现方式； 章法结构十分独特，时间和空间交错杂糅的叙述方式与亦真亦幻的内容呼应； 语言有自己风格，运用冷僻怪异的字词，形成超逸沉博、浓艳密丽的词风； 《风入松》 听风听雨过清明，愁草瘗花铭。楼前绿暗分携路，一丝柳，一寸柔情。料峭春寒中酒，交加晓梦啼莺。 西园日日扫林亭，依旧赏新晴。黄蜂频扑秋千索，有当时、纤手香凝。惆怅双鸳不到，幽阶一夜苔生。 史达祖“梅溪先生”，咏物词善于取神、用意，著《梅溪词》。 其词词语奇秀清逸，融情景与一家，会句意于两得。 周密著《草窗词》。 词风与姜夔相近，和吴文英起名，并称“二窗”。 其词风格“清丽”，咏物词寄托遥深。 王沂孙著《碧山乐府》（又名《花外集》）。 其词别具悼念故国之思，充满凄苦悲凉意味。 其咏物词，既体物细微，结构细密，又寄托遥深，哀婉动人，惜时有隐晦之病。 张炎“张春水”、“张孤雁”，著《词源》二卷。 上承白石的清空疏宕，近与梦窗的密丽质实区别，表现了明确的风格意识。 创作风格： 宋亡之前：词风雅丽；； 宋亡之后，词风凄凉悲苦； 入元后，词风转变，多为哀音及身世零落之感； 《千秋岁》 数声鶗鴂。又报芳菲歇。惜春更把残红折。雨轻风色暴，梅子青时节。永丰柳，无人尽日飞花雪。莫把幺弦拨。怨极弦能说。天不老，情难绝。心似双丝网，中有千千结。夜过也，东窗未白凝残月。 南宋后期文学南宋后期因为政治动荡黑暗，导致文学的发展每况愈下。“永嘉四灵”、“江湖诗派是主要代表。宋亡之际文天祥等爱国诗人是这一时期的最后一道光芒。 永嘉四灵徐玑，号灵渊； 徐照，子灵晖； 翁卷，字灵舒； 赵师秀：字灵秀； 特征： “四灵”作诗复兴唐诗实际是晚唐体，专做格律诗； 意平语诡，多有怆气，因刻画太甚流于纤仄，也有自然浑圆的作品； 攻五言格律，多咏景物，写萧散野逸之趣，追求平淡简远的韵调； 费心苦吟，刻意求工，其诗冲淡平和、清零清寒的境界，流露山人名士的出世情怀； 12江湖诗派南宋后期影响最大的诗派，因陈起刊刻的《江湖集》得名，多效”四灵“之体，宗尚晚唐体的清巧之思，多属意于苦吟，反对江西派的”资书以为诗“，以不用事为贵。 刘克庄著《后村先生大全集》，词集名《后村长短句》《后村别调》 继承辛派爱国注意传统与豪放词风，是辛派词人的后劲。 作词针对社会时政有感而发，内容多是忧愤悲凉，黍离哀痛的沧桑感。 创作阶段： 前期：从晚唐体、四灵体乳瘦，刻琢精丽，风格清轻简淡。后追求抑扬开阖、悲愤慷慨的作风； 后期：有意追求陆游、杨万里的大家风度，格调更多沉痛、感情更多深刻； 戴复古作诗以苦吟秋工，带有四灵余习。著《石屏集》。 方岳有《秋崖集》。 作诗主清新，工于镂琢，常能制作出新奇对偶，把寻常典故成语巧加组织而成名句。 大多数作品写于罢官乡居时，颇多写景的田园之作。 1遗民作家，其作品多反映亡国悲痛，表现民族气节。 文天祥著《文山先生全集》。 创作阶段： 早期：诗歌比较平庸； 后期： 诗歌：抒发爱国思想情感与坚贞的民族气节，多谢亲身经历，具有纪实性，直抒胸臆，悲壮苍凉； 散文：以纪实著称，富有惊心动魄的传奇性； 词：创作不多，表现了作者至死不渝的民族气节和顽强斗志。 汪元量著《水云集》《湖山类稿》。 创作： 诗：以纪实绝句述亡国之痛，充满了亡国之戚、去国之苦。被称为宋亡“诗史”； 词：直抒胸臆，多写故国之思，常用比兴而不流于隐晦，着笔疏淡而不失于苦寂； 刘辰翁著《须溪集》。 其词大都为宋亡后作，感怀时事，抒发兴亡之感。 诗文以奇怪磊落为宗，不平的心境和抑郁的情绪，使其诗遣词造句显得很艰，意趣迷离，寄托遥深。 郑思肖著《所南翁一百二十图诗集》《郑所南先生文集》。 其诗多写亡国之痛与故国情怀。","link":"/2019/03/02/宋代文学（三）宋代文学大观/"},{"title":"宋代文学（一）宋代文学发展绪论","text":"宋代文学发展概况特征： 承先启后，宏通广播 学术思想： 与汉学并称，宋明理学一脉相承。 文学艺术： 宋词、“宋调”、“唐宋八大家”宋占六家 通俗市民文艺： 与元同列 历史背景​ 公元960年春，宋太祖赵匡胤发动陈桥兵变，黄袍加身建立宋王朝。此后用十年的时间平定荆湖、西蜀和南唐，至宋太宗时平定北方，全国除东北的辽（包括烟云十六州）和西北的西夏以外，大部分地区得到统一，结束了五代十国的分裂割据局面。赵匡胤为避免唐五代以来强藩武将的专横篡夺，建国第二年，以“杯酒释兵权”的策略，解除了禁军将领和节度使的兵权。为加强中央集权，将全国精兵集中开封及其附近，隶属于枢密院，由皇帝直接掌握，枢密院多委派文人担任，使“兵不知将，将不知兵”。 ​ 由于采取“守内虚外”的政策，重文轻武，边备不修，所以终宋之世积弱积贫，为历史版图最小的统一王朝，反映在文学上，也就没有了西汉赋家和盛唐诗人那种恢弘开廓的气象，更多的是“痛切国事、沉郁悲愤”的声音，这一点越到后面越突出。 ​ 面对外有内患，士大夫多革新朝政的议论，朋党之争迭起。 ​ 北宋：改革与保守的党争斗；南宋：主站与主和争论不休。 ​ 对外涉中的辞令，政策争议中的辩论，均需要文章来表达，客观上促进了宋代散文发展。宋代的学校教育和科举制度也十分发达，全国州县普遍设立学校。宋代科目最初是重诗赋，后来重策论，或两者兼试。文人当政是宋代的特色，与之伴随的文人论证风气的形成，则始于科举考试的科目导向，其影响所及，使宋文多论证文章，宋诗也有议论化、散文化的倾向。散文化的写作手法渗透到诗赋骈文、甚至于词句中去，于是有以文为诗、以诗为词等种种破体为本的现象出现。 ​ 宋统一中国后，社会经济很快恢复，造纸术、印刷术的普及，方便了作家诗文集的出版，有利于文化的传播。商业繁荣，城市人口增加、市民阶层扩大、歌乐盛行、文娱生活丰富多彩，给文化世俗化的发展提供了有利条件，于是市民文艺的兴起，如话本小说、鼓子词和诸宫调等，一时蔚为大观。 理学宋儒出入佛老而返归儒学。 他们继承孔孟仁学的道统加以解说，又受佛老思想影响下，兼吸到家学说的某些因素，发展成为新儒学的性理之学，或心性之学。 理学家主张文以载道，但偏重道统新传。因此形成了重道轻文的文学思想。导致文章不免说教，诗也趋向言理，缺少文学的情韵和意味，词及小说戏曲等少受理学影响而自成曲面。 宋词​ 词作为宋代最具影响力的代表问题，数量和质量都很客观。唐圭璋《全宋词》搜集词人一千三百余家，词作二万余首。有小令、中调、长调等各种样式，词体风格更呈现出不同流派争奇斗艳、百花齐放的特点。 ​ 北宋 ​ 晏殊、欧阳修他们继承《花间》、南唐词特点，加以深化、美化，其个人抒情之作，致力于提高 令词的品格。 ​ 柳永他是北宋第一个大量创作慢词的词人，发扬光大了民间慢词，扩大词体的表现范围和深度。写作特点是铺叙蔓延，风格以风俗为主，受到下层受众的喜爱，也招致文人的激烈批判，后来慢词逐渐为文人所接受，成为宋词代表性的体式。 &lt;u&gt;苏轼&lt;/u&gt;苏轼为北宋词风大变。其借词体表现士大夫的自我人格和性情抱负的作品，与应乐工歌妓要求所作的歌者之词大异其趣。“以诗为词”，所咏题材极为广泛，开拓了词的表现领域。写作上指出向上一路，不尚雕琢，不重词藻，不严格律，随手挥洒而自然高妙。 与苏轼同期稍后的词人：秦观、贺铸、晏几道等人，均以绝妙好词见称。​ 秦观​将身世之感并入艳词，对景物和心理的刻画细致入微，被称为婉约之宗。 ​ 晏几道继承晏、欧词风又变本加厉，把令词的技巧更加推进一步，词风凄苦而哀感顽艳。 ​ 贺铸词情意缠绵，语言工丽，与小晏相近。长调慷慨激昂，大气磅礴。 ​ 周邦彦集前人各家之长，使词的艺术技巧更臻完美，是北宋词的集大成者。其题材并未开拓，精通音律，词作音韵协美，修辞醇雅。并在柳永的基础上将慢词技巧加以发展，变平铺直叙为跌宕回环，极具文人气质。 ​ 李清照是南渡之际的杰出女词人，其词以寻常语度入音律而清丽晓畅，被誉为“易安体”。前期词反映闺中以婚后生活较多，后期词写于南渡之后，因国破家亡，夫妻永别，词风沉痛凄苦而哀痛欲绝。 ​ 南宋 ​ 在靖康之难中，汴京沦陷，北宋灭亡。在民族矛盾极其尖锐而统治阶级内部矛盾复杂化的时代，南宋爱国人士慷慨悲歌。他们把词从相思离别、红情绿意的浅斟低唱中解放，代之以豪放雄浑的悲壮声调。 ​ 辛弃疾是南宋词人中最具代表性的，他集民族英雄、爱国词人于一身，他的词激昂慷慨而沉雄悲壮，但又不失词体特有的要渺凄迷之美。《稼轩词》中还有一些婉约含蓄的情词和清新鲜丽的农村词，表现了其词风的多样化。 ​ 南宋爱国词人的作品奏响了宋词的最强音，但南宋的局面终究是屈辱苟安的时期较多，所以中期以后的另一派词人，追求清雅工致，讲求音律格调，注重辞藻，如姜夔、史达祖、吴文英等，形成了南宋清雅词派。 ​ 姜夔他精通音乐，词风清空古雅，如野云孤飞，去留无迹。 ​ 史、吴二人多数为适应歌妓口吻的合律之作，追求音律的协调和词句的秾丽。字面华美，所表达的感情却似有难言之隐，以至于内容晦涩，却也有空灵生动的佳篇 ​ 南宋亡国前后，文天祥、刘克庄、刘辰翁等爱国词人大声疾呼，气薄云天；而周密、王沂孙、张炎等遗民词人，发生了凄凉的叹息，借隐喻抒写亡国之悲痛，已是“亡国之音哀以思”了。 宋诗​ 宋初 ​ 多学唐人：白居易“白体”、李商隐“西昆体”、晚唐诗人“晚唐体”。其中以学西昆体盛行一时。 ​ 西昆体杨亿、钱惟演等人为代表。作诗讲究修辞，属对贴切，绮丽工稳，暗含讽喻。但多数内容贫乏。 ​ 北宋庆历时期，欧阳修、梅尧臣、苏舜钦等人的诗歌创作，关系到整个宋诗的发展方向，将西昆体重雕琢和尚侈丽的流弊，作诗有散文化倾向，主气格、重雄放、求淡远，形成了平易流畅的古淡风格。宋诗揭开了新的一页。 ​ 北宋神宗熙丰时期到哲宗元祐时期 ​ 这时是宋诗的成熟阶段，主盟诗坛的是：王安石、苏轼、黄庭坚。 ​ 王安石他的诗骨鲠傲气而又清新隽逸，不失拗相公本色，他的七绝赓续唐音而雅丽精绝，人称“王荆公体”。 ​ 苏轼“东坡体”可与王安石诗抗行而风格不同，王诗深邃高远，苏轼则是渊博朗畅。苏轼的以文为诗和以才学为诗，在七古长篇中体现得最充分。 ​ 黄庭坚是江西诗派的鼻祖，在诗句的锤炼和推陈出新方面，有独到的功力。风格瘦硬而趋于老成，有老境美。江西诗派结束了北宋诗坛，对南宋诗坛产生了或多或少的影响。 ​ 南宋 ​ 陆游具有战士情怀的爱国诗人，他的诗豪情满怀而激昂慷慨，也有壮志难伸的沉郁顿挫；他晚年寄意山水田园，诗歌意境冲淡和平，表面上空灵静寂，骨子里却腾跃动荡。 ​ 杨万里诗风活泼自然，口语入诗，号称“城斋体”。 ​ 范成大四时田园诗集大成者，其诗多用典故，是学习黄庭坚的山谷体，但却约以婉峭自成一派。 ​ 诸家都从江西诗派中分化，且自成风貌。反对江西诗派自成派系的，有“永嘉四灵”和江湖诗派，他们反对江西诗派末流议论叫嚣的习气，提倡作唐诗。多学晚唐诗体，效仿贾岛、姚合的苦吟，主情切，雕小景，五律诗可观但缺乏个性表现。 ​ 亡国之际 ​ 亡国之际的宋词结束了派别之争和门户之见，写真性情、真精神、慷慨从容。 ​ 汪元量慷慨悲歌，咏亡国时随宫女北徙的见闻，有“诗史”之誉。 ​ 郑思肖《所南集》的诗，寄情于南而愤寓于笔端。 ​ 他们的诗歌抒写仁人志士的怀抱，反映当时各方面的现实情况，为宋诗的结束画上了光辉的句号 叙事文学​ 士大夫： 散文（雅文学） ​ 民间讲唱文学： 话本小说（俗文学） ​ 北宋 ​ 宋初文章沿袭晚唐五代风格，骈文昌盛一时。 ​ 柳开首先提倡韩愈古文，王禹偁、穆修和尹洙等人力求文章精炼简介，但影响不大。 ​ 直到欧阳修，才产生了具有宋代特色的散文，欧阳修门下聚集了一批古文名家，宋代散文发展进入了新天地。 ​ 欧阳修为文委婉自然，纡徐有致； ​ 苏洵文章纵横条达； ​ 苏辙文章汪洋淡泊； ​ 曾巩之文典雅谨严； ​ 王安石为文矫健简洁； ​ 苏轼为文明快朗畅，一泻千里。 ​ 他们的风格迥异，但都能化繁为简，变难为易，追求平易畅达的文风，是宋代顾问获得成功的重要因素。 ​ 理学家周敦颐、张载、程颢、程颐也写出了平易近人的文风，是北宋古文的一个支派。 ​ 南宋 ​ 分为两派： ​ 一派是理学家的古文。理学家古文以朱熹为代表，张栻、吕祖谦等人是追随者。 ​ 朱熹为文辞严理正而平易坦识，提倡明白翔实的文风，排斥辞以害意。 ​ 一派是主功利的思想家的古文。以叶适、陈亮为代表，从诗友关系上看，他们受理学家影响，但文章的内容与理学家不同。他们认为学问在于经世，所以用文章纵论世事，针砭时弊。 ​ 南宋古文虽然可分为两派，但异中有同，为文的主导风格皆朴实无华，平易浅显。宋亡之后的遗民文章，则是以血泪写成，沉痛悲凉，风格迥异于南宋。 ​ 四六文 ​ 不完全摒弃骈文的情况下，将骈文改造，疏淡化、散文化成为宋代流行的四六文。 ​ 欧阳修、曾巩、王安石、苏辙、苏轼等，即使古文大家，又是四六文作者，两种文体兼备。 ​ 宋代四六文受古文影响，文风趋于疏淡明朗和朴实平易，与唐人的骈文是有所不同的。 ​ 宋赋​ 宋代文人的赋除了汉大赋和拟六朝排赋之外，真正具有宋朝特色的，是受古文影响的议论化、散文化的赋，亦称文赋。题材以感时伤怀或对景言志之作为主，如欧阳修的《秋声赋》、苏轼的前后《赤壁赋》等。 ​ 话本小说​ 由民间讲唱文学发展而来、流行于市井的俗文学。 ​ 讲唱文学： 由散文和韵文组成的有讲有唱的一种文体，宋代的讲唱文学有以讲为主的话本，也有以唱为主的鼓子词、诸宫调、覆赚等。 ​ 话本小说是以口语记录下来的白话小说，继承唐“说话”的传统而来，在宋朝，说话这一技艺盛极一时。 ​ 话本小说成为中国白话小说的开端。 ​","link":"/2019/02/19/宋代文学（一） 宋代文学绪论/"},{"title":"宋代文学（二）北宋初期文学与诗文革新运动","text":"北宋初期文学北宋初期文学处于沿袭唐五代文风的过渡阶段，也出现了新的变化： 柳开等人的倡导和写作的古文 王禹偁革新诗风和文风 杨亿等人西昆体 晏殊的令词创作 王禹偁与宋初文风和诗风背景： 宋初文坛承接晚唐五代文风余绪，盛行骈俪声偶之辞，妍华而不免肤浅，未有新意。，柳开、穆修等人倡导复古和坚持写作古文，他们的复古主张和实践，为宋代古文运动开了头。其中有突出创作实绩的是王禹偁。 柳开：自觉恢复韩、柳古文的传统，反对五代浮艳文风，标举文统和道统，主张文道合一，著《河东先生集》。 穆修：强调教化作用，力求结构章法的变化，多用散行单句，不务雕琢堆砌，不求华糜艳丽。 王禹偁 宋初作家成就较大的一位，诗、文创作突出，促进宋初诗风、文风的变革，著《小畜集》。 早年侧重学白居易的闲适唱和诗，贬官商州后，学习白居易讽喻诗，更进学习杜甫，创作了大量反映社会现实、关心民生疾苦的作品。 代表作： 诗：五、七言效法白居易的平易诗风，近体诗、绝句不乏清淡清远的格调。代表作《村行》 文：古文与四六文兼备，改变五代以来雕绘习气，创作古雅简淡之风，成为欧阳修改革文风的先声。同时他的文章有现实政治内容和鲜明的思想倾向，代表作《唐河店妪传》。 杨亿和西昆体、晚唐体西昆体： 广义：兼指四六文。 狭义：单指其近体律诗。 杨亿：宋初著名文臣，与王钦若等编撰《册府元龟》。诗风学李商隐，讲究辞采，风格典丽，表现才学和功力，亦有清峭感怆的讽喻之作。 西昆体成为流派的标志：《西昆酬唱集》的编撰。主张“历览遗编，研味前作，挹其芳润”。 西昆体讲究修辞，大量用典，以学问为诗，是宋初文学的突出特色，与后来的江西诗派有相同之处。 晚唐体： 模仿贾岛、姚合诗风，以清逸幽居为旨趣。 林逋：是颇受推重的晚唐体诗人，虽学贾岛诗的斟酌，其诗也有其性情的孤淡清逸，代表作《山梅小园》 晏殊的令词晏殊 晚唐五代过渡到北宋的关键人物，受南唐冯延巳影响。审美取向清丽典雅，词风风流闲雅，温润秀洁。继承唐五代词艺术经验上，以明净的语言、深刻而纤细的内心体验、曲折精巧的构思，表现了情感的经历和对人生的思考。精美圆熟的艺术表现，雅致含蓄的倾向，展示出宋词风格的新特色，直接影响欧阳修、晏几道等人。 代表作：《浣溪沙·一曲新词酒一杯》《玉楼春·绿杨芳草长亭路》 欧阳修与北宋诗文革新北宋中叶的古文运动确定了古文在散文领域的正宗地位，进而影响到诗歌，讲究“气格”，产生“以文为诗的现象”。因此这场文学变革被称为“诗文革新运动”。欧阳修是这场运动的领袖，有力推动了北宋文学的发展，使宋文、宋诗独树一帜。宋代士风和文风的根本转变，都是从他开始。 欧阳修的文学贡献欧阳修 文： 欧阳修散文成就最高，影响最大。虽以学习韩愈标榜，风格完全不同。欧阳修的文澄塘潋滟，情波荡漾、含蓄委婉。摒弃韩文艰涩怪奇，发展“文从子顺”，建立起平易流畅、委屈婉转的风格。绝妙之处在于平易流畅中富有曲折变化，含蓄蕴藉而又平易近人，富有诗味，是欧阳修散文的显著特点。 代表作：《醉翁亭记》《与高斯谏书》《原弊》《朋党论》 欧阳修的赋开了宋代文赋先河，变旧赋的骈偶对仗为骈散相间、奇偶错杂。保留铺陈的特性，又使文气趋于舒缓。 代表作：《秋声赋》 诗： 早年受西昆诗人的启蒙，故能从宋初诗歌的演变着眼，给西昆体以一定的肯定。大力提倡梅尧臣“诗穷而后工”的古淡奇峭、苏舜钦的横放雄豪。他自己则学韩愈的“以文为诗”，带有韩愈那种浩荡变怪的散文化倾向，变重情韵为重气格，开始了宋诗自具面目而有别于唐诗的时代。欧诗是唐转宋的枢纽，一方面保留了诗体相对整齐凝练的传统，一方面使诗体形式具有弹性，使诗的节奏、声律多变，语言自然流畅。在以均衡对称、声律和谐圆润为美的唐诗外，建立了不讲究均衡而以古拙取胜的宋诗格调。 欧阳修在古体诗中表现为散文化倾向，以古文章法写诗，讲究转折顿挫，句子彻底散行，长短句杂出，少用偶句，故意作得似对非对，造成散文调而非诗调，诗中常用语助词。由于常用古文的句法、气势入诗，故可称为古文诗体。其创作追求气格，其风格或曰古健、古硬、气雄、气豪，或曰怪奇、奇壮、奔放，皆重气格所致。 代表作《庐山高》 他的诗开创了取材广泛、命意新颖、以文为诗和以议论为诗的一代诗风。于命意上追求深刻创新，透过事物的表象进一步表达他对事物的认识，在描述中杂以议论。 代表作《和王介甫明妃曲》 欧阳修虽然学韩愈的痕迹，但能独树一帜、自成一家风格，其风格与其散文一样，也有平易的特色。 代表作《戏答元珍》 词： 欧阳修作词并不经意，仅为了“聊佐清欢”，其中情词的比例较大。受冯延巳影响，继承南唐“思深辞丽”的特点，在词中融入了更多感情体验。除了花间风味的温润秀洁之作，也有抒发其旷达胸怀，风格豪放的词章，他的豪放气概的词，是出于性情气质，并非有意追求新风格，这一点与苏轼词有所不同。 代表作《蝶恋花·庭院深深深几许》《踏莎行·候馆梅残》《朝中措·送刘仲原甫出守维扬》《玉楼春·尊前拟把归期说》 梅尧臣和苏舜钦他们两人开宋诗一代之面目，风格虽然不同，却推动了宋诗的发展。 梅尧臣：覃思精微，故宋诗之始峻、笔始遒； 苏舜钦：超迈横绝，而宋诗之势始雄、气始舒。 梅尧臣 字圣俞，宣州宣城人。与欧阳修同为北宋前期诗文革新运动领袖，是杜甫与江西诗派之间的承传者。与苏舜钦其名，时号“苏梅”。代表作《宛陵先生文集》。 梅尧臣的诗题材广泛，其内容有两类：一类是干预政治、反映社会现实和民生疾苦的作品；另一类是写个人日常生活的琐碎事物。他的多数作品以第二类为主，取材个人化、生活化、琐碎化的倾向。他寻找前人未曾注意的题材，或在前人写过的题材上翻新，同时以哲理性的人生思考贯穿其中，加深了诗歌内涵，开宋词好为新奇、力避陈熟、富于理趣的风气。 代表作《汝坟贫女》 宋代对于平淡有宽狭不同的解释，梅尧臣的“平淡”属于“古淡”，是老树着花的美。但他面临社会矛盾和个人身世的激变时，他的古淡趋向于劲峭苦硬；仕宦失意追求隐逸山林时，则发展为冲和恬淡而蕴涵深意。 代表作《鲁山山行》《东溪》 苏舜钦 字子美，是欧阳修为盟主的诗文革新的重要倡导者，代表作《苏文士文集》。 他是关心社会而力主改革弊政的诗人，忧国忧民的政治热情，患难悲愤的生活经历，豪迈刚烈的性格，都促使他用豪犷激切、直抒胸臆的方式写诗。 代表作《吴越大汉》《奉酬公素学士见招之作》 苏舜钦的诗歌以豪犷雄放的作品最引人注目，尤其是他前期的诗歌，揭露于抨击时弊无以避讳，充满一种奋不顾身的气概，但也难免粗燥、生硬，缺乏蕴藉隽永的韵味。在他贬谪过上闲居生活后，寄情山水自然景物的诗多了起来，不乏情景交融、精炼含蓄的佳作。 代表作《夏意》 王安石的文学成就及其他王安石 字介甫，号半山，抚州临川人。宋代杰出的政治家，在文学上也取得了相当高的成就，以“天变不足畏，祖宗不足法，人言不足恤”的魄力施行“熙宁变法”，以连遭挫折而失败。 文： 作为政治家，王安石的文论重在致用，把文章看作为政治服务的工具，具有忽视文学特性的倾向。王安石的散文一定程度上贯穿了他的文学主张，特别是在有关政令教化、适于世用的政论文中。王安石驾驭语言的能力非常强，简练明快，笔力雄健。近代政论家梁启超、严复等人文章受其影响，他的文章成就很高： 议论文字： 结构谨严，析理透辟； 叙事抒情之作：随笔挥洒，曲尽其妙。 王安石的政论文严谨，语言朴素简洁而说理透彻，概括性很强。代表作《答司马谏议书》 他的小品文尤脍炙人口，虽篇幅不长，而笔力雄健，富有感情，文风峻刻，与预见他那种刚毅勇敢的政治家风度。代表作《读孟尝君传》 诗词： 王安石诗歌“奇崛“，以瘦劲刚建为特征，是王安石追求的一种艺术境界，与其坚强刚毅，果敢有为的”拗相公“本色有关。但他的诗进入老境后，化奇崛于寻常之中，既有清新闲适，又有沉郁悲壮，被称为”半山体”（或称“王荆公体“）。晚年以绝句为主，雅丽精绝，含蓄深婉，体现了部分宋诗风貌特征，又有向唐诗复归的倾向。 王安石诗歌有早期和晚期之别。 早期诗直道其胸中事，意味较薄，也反映其独特的歌仍特征和精神风貌。写了不少感时、咏史或怀古的诗篇，寄托远大的政治抱负和批判精神，如：《河北民》。政治上力排众议、实行变法，在诗歌创作方面也尽力打破常规，语意求新，诗句求工，语调劲峭，如：《登飞来峰》。 晚年罢相归隐后，王安石浮躁之气消弭，性情老成含蓄，感慨的怀抱趋于冷淡，而艺术和修养更加进步，多创作描写自然山水的小诗，新颖别致而雅丽精绝，如：《泊船瓜洲》《书湖阴先生壁》《江上》 王安石的词成就不及诗歌，但富有自己的个性，不受五代以来绮靡柔弱词风的影响，开拓了词的题材内容和表现范围，为苏、辛词开了路，如： 《桂枝香·金陵怀古》 王令 字逢原，广陵人，病逝时年仅28岁。王令一生境遇困苦，但胸怀济世之志，识度高远。他是北宋诗文革新中能别开生面的重要诗人，独特的诗歌风格，在宋初诗人中独具面目。代表作《广陵先生文集》。 王令见知于王安石，被称为“奇才”。他的诗学韩愈、孟郊，追求奇、，内容多写胸襟抱负及当时的社会现实，气魄雄壮，风格奇崛豪放，峻拔劲健。他的诗想象力丰富，富于浪漫色彩。如： 《假山》。他的诗歌特点，主要在于气势雄壮，粗犷豪迈，如： 《暑热思风》。 曾巩、苏洵和苏辙曾巩 字子固，世称南丰先生，建昌南丰人。代表作《元丰类稿》。 曾巩的散文受欧阳修赏识，文学主张和古文与欧阳修风格相近。其文古雅平整，雍容冲和，卓然为一家。后代文学家看来，曾巩与欧阳修一道是开文章“义法”的人物。 他的恶写作手法和技巧风格具有自己特色，开阖、承转、起伏、回环有法度，显得规矩严密，因此在八大家中最易学习，明清的唐宋文派和桐城派散文作者，学古文多由模仿曾文入手。 曾巩的文章追求雍容典雅的艺术风格，叙事、议论都成河平淡，委屈周详。代表作《墨池记》 长于议论，引经据古，明白详尽； 布局完整谨严，节奏舒缓不破； 语言干净，思致明晰。 苏洵 字明允，眉州眉山人。是大器晚成的散文家，厚积薄发，作文以学养为基础而重气势，文字雄奇坚劲，喜议政议军，带有战国纵横家的色彩。他的文章以议论为主，结构严谨、说理周详、气势磅礴而曲折多变，如： 《上欧阳内翰第一书》。 苏辙 字子由，号颍滨遗老，眉山人。他的文章在接受父兄疏放洒脱文风影响的同时，以欧文为学习楷模，把委婉纡徐的艺术情趣融入自己的作品中，故“汪洋淡泊，有一唱三叹之声“，近乎欧文之神韵，如： 《黄州快哉亭记》。 苏辙文风淡泊平和，议论以稳健见长，而其秀杰之气终不可授，在宋代散文中，能做到独自树旗帜。","link":"/2019/02/23/宋代文学（二）北宋初期文学与诗文革新运动/"},{"title":"CSS浮动及其清除浮动的5种方法","text":"浮动是网络布局中常用的方法，但是使用了浮动会导致高度塌陷的问题，在这里为大家介绍5种清除浮动的方法 CSS定位机制在理解浮动之前，我们先来看看css定位的机制。 在不设置浮动及定位的情况下，html文案是按照标准流的形式对页面进行排版。 标准流是根据元素所属类型（块级或行内级）进行从左往右，从上往下的排列。 块级元素： 独占一行 可以设置宽、高 如果不设置宽度，宽度默认为容器的100% 例如：div、h1~h6、ul、ol等 行内元素： 与其他行内元素同行显示 不可以设置宽高 它的宽高就是其内容的宽高 例如:span、a、b、i、u、em等d 所示效果如图： Float（浮动）的基础知识 会使元素向左或向右移动，只能左右，不能上下 浮动元素碰到包含块或另一个浮动框，浮动停止 浮动元素之后的元素讲围绕它，之前的元素不受影响 浮动元素会脱离标准流 设置：float：none / left / right 图文环绕 在这个例子中，有3个元素（p、img、p），我想要实现图文环绕的效果，于是对中间的img元素加了一个浮动样式。 123img{ float:left;} 在设置了左浮动之后，可以看到img之前的p元素（蓝色框）并没有任何改变，img之后的p元素（红色框）挤压上来，将img元素包裹住了，形成了图文环绕的效果。 这也是就刚才基础知识所提到的浮动不会影响之前的元素，对之后元素有影响。 图文环绕的例子中， 在图片设置了浮动之后，它已经脱离了文档的标准流。在脱离标准流之后，下面的p元素随后挤压上来，占据了img本身的位置。 那么，为什么不是图片压着文字的样式，而是形成了图文环绕的效果呢？ 这是因为文字有特殊的解析机制，它会找一个不挡住它的地方来显示。所以不给p元素设置浮动它也不会和img元素重叠。 对于文字的特效情况我们记着就好。 下面来看一个非图文环绕的例子。 盒子的浮动这里我依然给出3个如下的盒子： 我们先来按照刚才设置图文环绕的方法，给中间的盒子2设置一个左浮动： 123.box2{ float:left} 然后我们会发现盒子3居然不见了！但是这是依然在盒子3的文字依然在下方： 按照我们刚才设置图文环绕的效果，盒子3应该会挨着盒子2并排放置啊，怎么会出现文字依然在下方盒子却不见的情况？其实这里就是刚才提到的文字的特殊解析情况。 实际浮动中，上面的盒子设置了浮动后，它自身就脱离了标准流，下面的盒子就会顶上来，占据它之前的位置。所以就会呈现出一种盒子不见了情况。 在这个例子中，实际上盒子3并不是不见了，而是被盒子2给挡住了，现在我给盒子2设置一个右浮动，把下面的盒子3给显示出来。 123.box2{ float:righ;} 在为盒子2设置了右浮动后，盒子3重新出现在我们的视野中。 那么要如何做到2个盒子（块级）并排显示呢？ 其实很简单，我们只需要给2个盒子都同时设置一个浮动就好： 123.box2,.box3{ float:left;} 在为2个盒子同时设置了左浮动之后，我们可以发现，现在盒子2并没有压住盒子3，两个盒子成一个并排排列的样子。 浮动固然好用，但是在网页开发中，使用了浮动还会导致一个高度塌陷的问题。 高度塌陷什么是高度塌陷呢？ 在实际的开发中，我们一般不会设置height来设置高度，一般使高度随者内容来改变。 所以高度塌陷父级盒子没有内容来填充时（设置浮动后盒子不占据位置），出现的一种高度缺失的情况。 举个例子来看，现在依然是刚才的3个盒子，我给他们设置了一个背景色为青色的父级盒子，为了效果展示，我还在父级盒子下创建了一个高度为100px的绿色盒子来演示高度塌陷问题。 123456789&lt;!--这是html代码--&gt;&lt;body&gt; &lt;div class=\"parent\"&gt; &lt;div class=\"box1\"&gt;我是盒子1&lt;/div&gt; &lt;div class=\"box2\"&gt;我是盒子2&lt;/div&gt; &lt;div class=\"box3\"&gt;我是盒子3&lt;/div&gt; &lt;/div&gt; &lt;div class=\"demo\"&gt;&lt;/div&gt;&lt;/body&gt; 12345678/*这是css代码*/.parent { background-color: powderblue }.demo { height:100px; background-color:green; } 下面我先让盒子2与盒子3浮动起来： 123.box2,.box3{ float:left;} 现在盒子2和盒子3的高度已经没有了，下面的绿色盒子挤压上来，父级盒子的高度由盒子1来撑开。 我再让盒子1左浮动： 123.box1{ float:left;} 现在父级盒子的高度已经完全没有了，绿色盒子挤压上来。 父级盒子的高度塌陷是因为它内部的3个盒子都设置了浮动，脱离了标准流，它没有内容撑开当然就会丢失高度。 假设与父级盒子处于相邻关系的绿色盒子他本身有内容，在父级盒子高度丢失后，它挤压上去了。那么它自身的内容就会被父元素内部的3个盒子挡住。 为了解决这个问题，我们必须清除浮动，使得3个盒子既排列显示，父级元素又有高度。 清除浮动的5种方法第一种：添加空元素我现在给父级元素的后面新加一个空的div，并且设立一个类名clear。 1234567891011&lt;!--这是html代码--&gt;&lt;body&gt; &lt;div class=\"parent\"&gt; &lt;div class=\"box1\"&gt;我是盒子1&lt;/div&gt; &lt;div class=\"box2\"&gt;我是盒子2&lt;/div&gt; &lt;div class=\"box3\"&gt;我是盒子3&lt;/div&gt; &lt;/div&gt; &lt;!--这是新增的代码--&gt; &lt;div class=\"clear\"&gt;&lt;/div&gt; &lt;div class=\"demo\"&gt;&lt;/div&gt;&lt;/body&gt; 在刷新页面后，发现并没有什么变化，父级盒子的高度依然不在。 我们现在再给clear做一些样式设置。 123.clear{ clear:both;} 现在我们的绿色盒子回到了3个盒子之下，但是原来的父盒子的背景颜色怎么不见了？ 打开谷歌的审查元素来看看： 在审查元素中我们可以看到，实际上现在父盒子和我们用来清除浮动的clear都没有高度，那么是怎么做到让绿色盒子掉下来回到原来的位置呢？ 其实就是这个clear：both在起作用。 clear有4个属性： clear：none（不清除浮动） clear：right（清除右侧的浮动） clear：left（清除左侧的浮动） clear：both（清除左右2侧的浮动） 简单的说来，为元素清除浮动就是不允许改元素的左侧或右侧有浮动元素的存在。 第二种：为父级元素设置overflow：hidden；现在我把第一种方法注释了，绿色的盒子又挤压上去： 我要使用overflow：hidden把绿色盒子给放置回3个盒子的下方，使得他自身的内容不被浮动元素遮挡： 123.parent{ overflow:hidden;} 在设置了hidden之后，我们的绿色盒子不但回归到3个盒子的下方，而且父级元素又重新回来了，打开审查元素来看，父级元素的高度就是内部盒子的高度。 为什么overflow：hidden就可以清除浮动，让父元素回归呢？ 这个涉及到BFC的原理，这里不展开讨论。因为我自己还没摸清楚 简单的来说，就是我这个元素里面的子孙元素，不会影响到外部元素布局。 第三种：使用css3的伪类元素:after我依然先把第二种方法注释掉，让绿色盒子又挤压上去 我给父级盒子添加一个类名clear 12345678910&lt;!--这里是html代码--&gt;&lt;body&gt; &lt;div class=\"parent clear\"&gt; &lt;div class=\"box1\"&gt;我是盒子1&lt;/div&gt; &lt;div class=\"box2\"&gt;我是盒子2&lt;/div&gt; &lt;div class=\"box3\"&gt;我是盒子3&lt;/div&gt; &lt;/div&gt; &lt;!-- &lt;div class=\"clear\"&gt;&lt;/div&gt; --&gt; &lt;div class=\"demo\"&gt;&lt;/div&gt;&lt;/body&gt; 刷新网页后，并没有任何变化，我又来设置css代码 12345678/*这里是css代码*/ .clear:after { content: \".\"; height: 0; display: block; visibility: hidden; clear: both; } 再次刷新网页后，绿色盒子在3个盒子下方了，父级盒子也同时回来了 这个方法虽然好用，但是在低版本的IE上有兼容问题，所以我没还需要设置： 123.clear { zoom:1； } 第四种方法：给父元素设置高度我注释了第三种方法，使绿色盒子挤压上来。然后我为父级元素设置了固定的高度： 1234.parent { background-color: powderblue; height: 100px; } 现在又达到了我们的目的，但是这个方法只有在涉及高度固定的时候才能使用。 第五种：父级元素一起浮动我注释了第四种方法，使绿色盒子挤压上来，为父级元素设置css代码,然后刷新页面： 1234.parent { background-color: powderblue; float: left; } 是不是没有任何变化呢?我们打开审查元素来看看 现在的父元素的宽和高都有了，是他内部3个盒子的宽和高。 这种方式会导致新的浮动问题，不建议使用。","link":"/2019/11/21/清除浮动的五种方法/"},{"title":"【转载】林语堂——英语学习法","text":"为了学习更前沿的技术，英语是必备的技能。但是我从一开始英语就很差，各种学习方法了解不少，但是都没有深入的尝试。 林语堂英语学习法，是一个自号“秃飞猛进”的朋友推荐，虽说是早就了解到的方法，却依然没有实践。现在决定按照此方法，再次尝试英语学习。 一．目标英文是活的语言，现代通用的语言。凡是学习英文的人务必认定这个目标，学习现代通行活用的英语。这个目标认定，方法才不会错误。 若把英文看作死的，固定的语言，将来对于文法，读物，发音都要偏重于迂腐的语汇，拘泥的文法，呆板的读音，结果就所学非用了。 二．听讲写读四事并重因为英文是活的应用的语言，所以在会话写读都得注意。语言之为物，自身不能存在，必有写者说者欲传达其意象，也必有读者听者由语言之传达吸收作者说者的意思，然后完成语言之功用。语言也必因说者听者作者读者地位或心境之不同而发生变化。 譬如讲文法，以简单的“你”一字为例，这you字，在中文无不译为“你”，但是在语言活用上，你不必you ，you也不必你，因为在实际上，语言与所与语者之间，有身份高低、交情疏密之不同。明白这you 字在实际上之用法，然后可谓懂得you字之意义。中文对非深交的人，总避免“你”字，或称“杨先生”，或称“石甫先生”，而在英文却一律普遍可用you字。 再如英文wife，或通常译为“妻”，然在实用上或等于“夫人”或等于“内子”，或等于“太太”，或等于“老婆”，或等于“女人”；必须知道用wife字之时的条件，然后攫得住wife字之神髓。 以上二例，都证明辞语非抽象之物，能脱离尔我而巍然独存。文章无缠绵，只是作者读者之兴感；诗歌无悲壮，只是诗人墨客之骚情。不有听讲写读，何以有语言文字？假如偏于任何方面，就所学的也无非半身不遂貌合神离之英语而已，最多如看古代美人的肖像，相貌犹存，音容已邈，发生不起恋爱。 再就学习的能率而言，凡遇一新字，必口诵耳闻手写目视，然后容易认得，容易记得。犹如习字之人，不但要多阅碑帖，且必肯研墨挥毫，下实际工夫，才有实际成效。现在中国学生念英文，多犯这种毛病，只肯玩赏宝帖，不肯执笔临摹，结果不能真实领会书法之笔意，且失了习帖上之真正快乐。昔王羲之习字，池水尽黑，有了这样苦工，才是得了此中的乐处。学习英文道理也正如此。 三．口讲之重要在听讲写读中，口讲尤为重要，尤其是在初级的时候。这并非说我们学习英文的目标，只在能讲几句英语，实在因为方法上应当如此。自然能看不能讲，只可说是半身不遂的英语，但即使目的不在口讲的人，在学习之程序上，为求基础之稳固习惯之养成，进步之神速，文理之清顺，都得如此。 这有几种理由： 第一，口讲可多得练习，因为口讲是学习的最轻便的方法。如在班上，大家肯讲，每小时总可说十几名英语，对不对且不管，但已确多得练习机会无疑了。如教员令学生在家造句，每课最多交三句，已经有点困难。 第二，文法对不对，全在习惯，造句总是慢慢推敲出来，养不成什么习惯。口讲之妙，在使学习的人在不知不觉之间吸收英文的句法，有一句话，不费心思，脱口而出，初有疑难，久而久之，自能顺口，到了顺口之时，英文句法已在不知不觉之间学来，比写作时算什么主格宾格，强似多多了。 第三，口讲的话都是自自然然说出来，少有堆砌奇字，矫揉造作之弊，因为口讲应答之间，不容你矫揉造作。试将通常社论与名人演讲稿比较一下，就可显然看出这个分别。英文最重自然清顺，写英文必有这口讲为基础，写出来才读得下去，不然满纸都是字典上找来填上的奇语僻字，用上去一无是处。所以概括的讲，英文写作必须以口讲为基础。 第四，文字之有音调，犹如人之有声容，许多诗歌散文抑扬顿挫之妙，都须朗诵才可体会出来。不会读好的人，总不会完全领略此中的妙处。所以口讲的练习，于将来文学之玩昧，也很有裨益。 四．直接教授法之用处与范围凡谈外国语教授法的人，都讲到直接教授法。所谓“直接”是外国语直接表示意思，不靠本国语翻译。因此法是小孩学话的法，故又称为“自然教授法”（凡侨居外地直接学外国语，也可谓直接法）。因为抽象观念不易直接表示，故直接法每由具体物件，如衣帽、钟表、耳目五官等教起，故此法又称为“物体教授法”。但是物体教授法范围极狭，臂如教家禽野兽时，不能全数将家禽野兽搬到课室来，所以平常总限于最初的二十课而已。其余须以图画代替实物。或用联想方法表示抽象意义。在此层上，有便有不便。譬如糖盐可以带到课室来，而甜咸之味，却不易表示，除非由教员表演尝味之神情不可。 所以极端主张不用鄱译者矫枉过正，常自讨苦恼而已。专重翻译以为练习，固然根本不对，因为鄱译时使学者心中时有本国语观念，译入英文，定然不成功，但是在许多解释意义的地方，一二字翻译出来，省却许多周折。再如叫学生译整句的意义，或述其大旨，再令以自然英语译出，是有益无损的；若令字字对译，再使叠字成句，则利少弊多。 例如“快下雨了”一句话，若整句译来，为it will rain soon，可译为it is going to rain now 也未尝不可，因为这译法不背整句的意义。若用字字对译，学生心中必先形成quick come rain already 这么一句，待来改正，已有文法上、习惯上的种种困难了，况且把这四个字如何改，都改不像真正的英语。 五．注重仿效与熟诵学习英语唯一的正轨，不出仿效与熟诵；仿效即整句的仿效，熟诵则仿效之后必回环练习，必使能顺口而出而后已。凡能依这方法读英文的，无不成功，而且这极容易，真是学习英语的康庄大道，其应用远超出于物体教授法之上，初级高级都可适用。 须知小儿学语神速之秘诀，也不过仿效与重叠练习而已。这是与旧式以文法入门的方法，根本相反。譬如文法第一课说a是indefinite article，the是definite article，但知道这有什么用处？a , the 二字的用法与省略，一百个留学生中没有五个人能有十分把握，可见所讲文法完全不是这么一回事。 旧式的文法家以为下定界说，指出造句的楷则，叫学者按这楷则字字照填，便可成句，实在完全是梦呓。不但这方法极迂腐难行，就使按规则填好，也未必是顺口的英语。学者最要的警语，是少用堆砌工夫，学时必整句吞下去，再整句吐出来，其文必顺，其音必正，句法必通，用字必当。若凭字字译成英语，再依文法规则慢慢叠成句读，必一无是处，劳而无补。 例如以上“快下雨了” it will rain soon一句只须整句念好，三数次已可成诵，文法关系，暂时都可不管，只把这句法吸入脑中，不但再出口时可保无误，下次要说it will clear up soon . it will stop soon . he will come soon. You will die soon .心中早有此句的模范，不期然而然，说出都能合于正轨。 所以学者最要二事： 凡学英语，必学整句，不觉中将其句法音调整个吸入。 每日选二三句，回环熟诵，此数句读音必正，出口必熟。如此半年，操英语能力必大进。 六．普通原则以上所述，可大略合并为具体的学习要则十数条。兹将《开明英文读本》卷前之普通原则中有关系的十三条译出如下： 打定口讲的基础。只要能达到这目的，任何方法都可用。 学生在课堂上，必须踊跃参加练习，不怕错，不怕扣分数。假如分数足减少学生练习的勇气，则教员应暂时毅然废弃分数。 凡遇新字，必耳闻口讲手写阅读四事并重。 应尽量在课室里操英语，听英语，借以吸收英文句法。 注重仿效与熟诵为养成正当习惯之最好方法；不可偏重理智的分析及文法规则等。 句义字义不明时，可鄱译方法，但不可专用翻译为练习方法，翻译句义之用处，在于作比较，研究本国语与外国语说法之不同。 注重字之用法；字义应看做活的，生动的，有变换的。不知一字之用法，不能算为懂其意义。 注意日用成语虚字；常见之字用好，大体已备，生僻之字不难安插下去。 凡有意思要表现，必因教员的利导，毅然尝试。 凡说英语，必说全句，不可仅限于yes, no 等字。初时或觉其难，日后必有进步。 用客观归纳的方法学习文法，即时时注意字之形体变化及其用法。在读本上，看见同类的变化，发生疑问，即求文法的指示，以为解决。得了文法的指示之后，又须时时在读本上观其应变，以为印证。 必须有写作的练习。 拼音须精，读音须正。 七．语汇语法语音之分语汇就是vocabulaly，就是语言的内容本质。 语法（文法）英文叫做grammar，是讲某种语言中表示意念关系的种种方法。 语音就是读音（phonetics）。 这三个区别略与中国小学家所分形、声、义三学相仿佛。说文等于文法；音韵等于发音学；训诂等于语汇。 所不同者中国小学业是以文字为主，学英语者却必须以语言为主。故如在中国小学，说文及金石之讲文字的变化构造，而在文法，却须讲语言字句的变化与构造。然其同属于一类的研究，注重构造化合的原则，则两者实处于相等的地位。（旧式文法一部分专讲字形的演变，名为“形态学”（morphology），则与字形之义尤近。） 八．目标之重要语汇既为语言之本身内容，其概本重要可知。所谓巧妇难为无米之你炊，必先有米，然后用得着巧妇的烹饪功夫。学英语者每病辞字缺乏，不能达意，犹如初写白话文的人，只能说美人“好看”，她也“好看”，而别一个她也“非常好看”，第三个她“不大好看”，却不能用“娉婷”，“曼丽”，“轻盈”，“绰约”等字样。说人不好看，就说“难看”，也不能用“其貌不扬”“面目可憎”等字样。 反过来说，文章做不好的人，专会堆砌僻字，使弄玄虚，用些什么“颜如舜华”，“沉鱼落雁”，“羞花闭月”等搔不着痒处的俗套，而不能用明眸皓齿，纤妍洁白，不长不短，不肥不瘦等自然通用的成语。所以对于学习语汇的目标不能不注意。 九．语汇贵自然中国留学生及非留学生写起英文来，都是韩三苏的变相。须知韩文柳文好则好矣，无如在英文里边读起来，总是高雅有余，切实不足。上焉者还有韩文之古气磅礴，下焉者只像童生学做不通的六朝文，不但读者不知所云为何物，结果言之无物，落了虚浮的毛病。实则三代古文所以胜于六朝，一句话说，不外自然本色而已。 说其所当说，其义足以应付，其文又能自然符合当日的语调。太史公之文所以高不可及，其实就是他能自然充实，倘使不人做起太史公语汇之研究，必发现其言辞之丰富，且多实质器用动作之形容词。总说一句话，文贵实质，后人徒取腴词而弃实质应用动作之名词，文遂疲靡不振，到了后来要用文言做描写文写小说简直为不可能的事，至于文人集中的什么墓志铬，行状等寻常的叙事文，费九牛二虎之力做成，读起来还是可怜和很，处处感觉束缚，痿弱，平庸，就是因为那语汇中少古代实质名词，而现代实质名词又弃为鄙野不敢应用。黠者乃用浮美空泛之典故辞句以为掩饰，回去读点《左传》《史记》的文，乃相顾失色，叹其文“高不可及”。 因为中国文学有这样的一种传统观念，所以学英文的人也最喜用长字，拉丁名词。然而现代英文固是一种雄健丰富、不离本色的语言，英文文学也未入了萎靡浮华的时期。真正的好英文还是多少带点街谈巷议或是文士雅谈的气味，英文谓之有smell of the soil, 正与司马迁之文相近。 譬如swift称为“英文散文巨擘”（master of English prose），我们看他的《小人国》，文是如何的浅显流利，味同嚼菜根，并不像吃燕窝鱼翅，然而真懂饮食的人才知道“尝尽天下美味不如菜根甜”。学英文的人必须注重学这种浅常见的字的用法。这种字用得好，用得老，才是入了英文文章的正宗。 现在且举几个例。我在《开明英文文法》第188页曾经说到这个道理，举五个例。在这几个例中，B条的成语都是最易而最好的英文，A条的成语都是不如B条的成语的生动达意。 （甲）有一位大学教务主任说所计划的课程科目足以代表中国今日社会的各方面变迁，用了这么一句 （A）”it epitomizes the processes of modernization of China,”这是真正哲学博士的英文，同这一句话，可以说 （B）”it sums up ,in a nutshell ,the various phases of changing China.” （乙）有一位文字极漂亮的语言学家沙比尔氏，他要说语言演变之趋势不说 （A）the tendency of language ，却用一个比较不抽象的drift 字，说 （B）the drift of language （丙）要说劳意乔治与守旧党吊膀子，与其说 （A）Mr. Lloyd George’s efforts at pleasing the Conservatives,不如说 （B）Mr. Lloyd George’s flirtations with the Conservatives （丁）要说麦唐纳首相认真对付问题，与其说 （A）Mr MacDonald began to deal with the problem directly.不如说 （B）he came to close grips with the problem. （戊）要说根究经济困难的焦点，与其说 （A）try to locate the economic distress不如说 （B）try to find out where the shoe pinches. 所以英文要学好的人，不应先注重epetomize, processes ,modernization, tendency, locate 等字，应先注重nutshell, drift, grip, flirtation ,shoe ,pinch等比较不抽象，比较有实质印象的字。这一类字用得好，英文必好。 十．注重常用的字照上所讲，这道理已很明白。凡学者必由所谓成语学起，常用成语学好，抽象的字如“趋向”（tendency）“近代化”（modernization）不难安插下去。 中国学生喜欢读Macaulay的论文，其实这种文章尽管到大学程度时看了念了，不值得如何咀嚼。要尽量吸收英文常用成语，还是读Stevenson ,Dickens ,Bennett 等的小说，及Chesterton,Shaw,Heywood Broun, Hilaire Belloc的小品文。大概小品文、戏剧、游记、书札一类的文字，都富于常用成语，因为近于语体。 十一．注重近代文近代英文历史虽不很长，但文字的用法各代不同。现代人总须学现代文。例如Addison,Goldsmith十八世纪的文章固然很好，但决不能给我们学习现代成语的机会。 现代语言是与现代文化俱进的。所以学生到了第四五年时候须赶紧读日报杂志一类的英文。自然第四五年未必有看日报的能力，但是选得精当，实在有不少现代游记，谈话，访问，记事，书札浅易文章可以做阅读材料，如通常应用会话等。好的文法也应用现代话为例，不应如纳氏《文法》，专引英文名家著作之句为例。 能做文法的人，为什么不会做几句现代语为例？好的字典，如《简明牛津字典》，举例都是由通常报章集下来的，或由作者自撰（见该书序言），并不要去引经据典，拉一莎士比亚、米尔顿等人做招牌。这部字典的好处，就是名副其实，真正是现代通行英的字典“dictionary of current English ”。我久有意编一现代文选，作《开明英文第四读本》，材料全由现代报章搜集，可惜到现在尚未着手，至为抱歉。 十二．学习语汇的方法凡一人讲话时所用的字必与看书时所不懂的字不尽同，看书时所能用的字，又未必做文时都能使用。譬如我们读得懂莎士比亚文章的人，未必就能使用莎士比亚文章中的辞字。犹如我们能看林琴南的小说，自己未必能，而且大半不能写出林琴南的文句。 所以这所谓语汇，有个区别。通常语言学家分四种： 听得懂的字,hearing vocabulary, 讲得出的字,speaking vocabulary, 能阅读的字,reading vocabulary 能写作的字,writing vocabulary 同时又可分为能使用的(active vocabulary)，及仅能了解的(passive vocabulary)二种。自然多半的人是能了解的字比能使用的字多。 学习英语的人，各因他方法的不同，而各种辞汇的比例生出大别。自然最理想的就是四种都会，某字能听能讲能读能写，才算是真正充分的认识。这就是“知行合一”，必要能行，才算真知。能使用某字，才算真正能懂得某字。在实际上，听及讲的字，都靠实地听讲的练习。而阅读及写作所学的字的问题，比较复杂，应特别讨论学习的方法。无论那一课英文，学生读来必有不少生字，在不懂教授法的人，总是注重生字，问了字义，考了拼音，而把已认识的字忽略过去。 我知道有些教员，如遇本课无生字，竟全然叫学生不要念，真是荒谬之至。这种的方法，无意中偏重于了解的消极的字汇，而忽略使用的积极的字汇。须知学生一见新字，固然须认识记住，然无论如何强记，总有的易记，有的难记，求其一百分全数记住，不但不可能，且也可不必。能记住固好，不能也无妨，要在以下各课有多遇见用字的机会，自然学习得来。 凡生字，必先经过能了解能认识一步，再于他处见过二次，三次，四五六次，十余次，始完全吸入学者脑中，自然能记得住用得来。教者能每课教学生于最低限度认识生字已足；而对于前已认识的字，却不可不反复研究其用法，练习其使用，如此始有确实学会用字的能力，不然字字“似曾相识”，有“一面之缘”，而终无确切认识，知犹不知，识犹不识，用工多而收效少。犹如不善交情的人，人人面善，一无知交，将来在社会上孤立，才知道苦痛。字虽小道，其出没变化，令人莫测，倘无真正认识，将来阅读时处处错解，写作时处处误用。愈平常的字，愈容易使人上当。中国译家常闹出笑话，就是闹在寻常的it,follow,pleasure,as 等字上面。 总说一句，所谓认字，有生熟程度的分别，不得谓知某字之义，记得某字的拼音，便为认字的止境。“认字”是一长期的继续的经过，与交友同，时间愈长，相知愈深。通常专重认生字的方法是错误的。至于认生字，也不应凭一次的强记，一次的强记是不永久的，过后定必遗忘。似心理学的道理，（詹姆士说过）我们是“冬天学游泳，夏天学溜冰”，凡学一事，记一物，必经过相当的期间，丢在脑后，再来得第二第三次的经验，这种的记忆才不会遗忘。至于真记得住的次数，须凭天资之高低而定。有人一二次，便已记得，有人须四五次，但是无论天资如何迟钝，也决不至七八次见过尚且遗忘。 所谓聪明学生，次数少，而所记的成分多。譬如一班同级的学生，一样同读过某读本，见过某字的次数相同，而聪明的学生能用书中的字比迟钝的字生多。推而至于将来，某人文章做得好，某人文章做不好，根本的差别，就在这学习记性及吸收能力之相差。 十三．咀嚼照以上心理的依据，现代语言教学家都认“精读”（intensive reading ）与“泛览”（extensive reading ）一样的重要。精读就是咀嚼，泛览就是涉猎。同时也有“朗诵”与“静阅”（silent reading 又称“快读”rapid reading ）的分别。精读咀嚼自然重要，然非博览，快读，则所阅过的文字有限，无论如何精细，不会有好成绩。因为精读近于强记，博览才得多次重叠的经验。但是所谓精读，也有个方法，不是临时抱佛脚，硬记下去所能成功。 有四点最重要： 第一就是朗诵及朗诵之变通方式—默诵 凡字句，必求得声音之正，然后念出来。 声音不正，脑中声音的印象（auditory image）模糊，必念不好。脑中的印象清楚，在朗诵不便之时，也可默诵。 第二就是体会 背诵有活法与死法之别，鹦鹉能言的背法是无认识而无用的。 正当的背诵应与体会同为事，就是书上看了一句，得其句法句义，然后闭书体会其意义，试用英语说出。说不出再看书，再闭书，再体会，再尝试，这是正当的背诵方法。譬如我们看见一句I want to see if the bird is dead ,知道这see if的成语是很有用的，就闭书体会这个意思，看看传达得出来否。用这方法，无论读何书，都可凝神体会，默诵，自己试说一次，这样读书易得益处。但是读音必清楚，不清楚就不易默诵，因为缺少那字句的声音印象。 第三以成语或全句为主 譬如单记sharp字很难，学者最多在心中“sharp —sharp –sharp –s-h –a –r –p –sharp 尖利”念了几遍，然而因为缺少联想的内容，这五分十分又便忘记。又如学claw 字，学者心中claw –c –l –a –w –claw 这样念，也觉得吃力而无意义。 但是如这样念一句The woodpecker has sharp，同时可学claws,woodpedker,sharp,claws三字，三字又各有实在联母的关系，记起来就省力。有时不必全句体会默诵，只须默诵有用的半句或一部便可。 第四（最重要）明字的用法 所谓咀嚼，就是把字义用法精细的咀嚼出来。从前有学生来问我某字之义，我正答一中文译语，而尚未讲下去，他已满足走开了，这种学生，英文一世也念不好。 譬如某人的演讲冗长无味，英文叫做tedious ，学生来问，我说tedious是“讨厌”，学生满足回去，启一隅不以三隅反，后来做出论文，说在电影院看见前排一对男女卿卿我我的蜜语，甚觉讨厌，就写了一句I felt very tedious.这种人读书不精，永无好成绩，犹如不通的熟师，一世考不得功名。因为我们细把tedious 的用法咀嚼玩味一会，知道: （一）冗长无味之演说书籍科目功课叫做tedious （二）刺刺不休的人也可说是tedious， （三）事情麻也叫做tedious 。 然麻烦固然讨厌，而讨厌未必麻烦。那位学生却说真光电影院的一对男女切切私语甚觉“麻烦”，自然是不通。那位学生若肯让我讲下去，举以上的例说明其用法，就不至于做出这种不通的句子。而且讨人厌的人可以说是tedious，自己觉某事讨厌的人，在英文却不能讲I felt very tedious。讨人厌之事叫做boring(主动的)，而觉得讨厌的人，只好说bored(被动的)，如此分别清楚，精细玩味，才不会做出似通不通的文章。凡遇一字，必澈底明白其用法及精义，然后可以放弃。 这种的咀嚼法子，用功虽苦，乐处也不少，而收获必大，因为他玩味过的字，都易记得，而能使用适当。其实中文西文读书方法相同，读中文的人，若不能精细玩味“孱弱”、“萎弱”、“懦弱”的不同，用字必然不当。 从前北大考新生的卷子，我就看见“夫以中国广大之历史，据磊落之神州，民种富强，土地肥壮，而至今日昌盛不如列强者何也”这样的妙文。这种人在概是没有办法的。 十四．泛览精读之外，必要博览，上段已经说明。大概英语在初中时代，务必专用精读工夫。到了高中，务必多看多读。不但读得精，也要读得快，读得多。泛览快读时，自然不能字字咀嚼，但是其中偶有好字佳句，也须随时体会默诵。 精读的根基打得好，习惯已成，多看多读是有益无害的。个人的经验，在此时期，凡遇新字仍不能轻轻放过，还是仔细认定其精义用法，如此用了两年泛览的苦工，差不多读书能力已经养成，写作也就够用了。 十五．文法家与反文法家关于文法一层，通常英文学生及教员最乏确切的了解。一班的人深信文法，自己对文法的确用过苦工，到了做教员的时候，自然也有他得意之时，仿佛苦媳妇升为婆婆，必定叫学生用这种苦工才算快意。 而且问题愈难，愈感觉兴味，略如算学教师一样。又有一班人明明看见学习文法规则的无补实际，发为偏激之论，谓只须多读多讲，文法可以不学。这一派的人的毛病在于放肆，读书不求甚解。 若以两个极端比较，按成效讲，还是后者容易得实益。但是反对荒谬的文法学习法可以，反对文法自身的研究却也一样的说不过去。背诵表格，强记规则，固然不能使人写出好的英文，但是正当的学习文法，决是有利无损的，能增加学生使用英文的能力。因为文法并不只是一些空洞的法规，叫人背诵。真正的文法的研究，是对于英文作精密的观察与有系统的练习，自然精密的观察比懵懂没有观察好，而有系统的练习比没有系统好。 十六．主张文法的理由这话可分做两层讲: 系统的研究。 多看书不念文法者成绩所以好，因为多阅读的人自然而会吸收英文句法。其强处在于学者只看见实例。而这种实例都是在有意义的真正的英文中见到，学来省力而不易错，不像一种旧式文法中的例句，向壁虚构，都是似是而非，似可能而实不可能的句子。（例如某种文法课本中甲说“这是你的马吗”？乙答“不，这是我的洋伞”，因为编者要练习this is,that is not,又要用本课的“马”字与“洋伞”字。其实哪里有人会把洋伞看做马的？又有课本叫学生说I was born yesterday,I am born today,I shall be born tomorrow,末了一句当然然是事实上所无的话。） 但是自然阅读虽是很好，却是无系统的。譬如单看书不念文法的人看见help me do it ,聪明一点的便注意到有一个to 字省去，但是他要再看到同样的例，至少须经过相当的时间，或是再读下去几十页，才能遇到。假如有好的文法，把这种句子做系统的研究，学者同时不但看见一句help me do it ,并且可看见help me pay it, help them collect the money, help you overcome the difficulty.许多同样构造的例，自然学得更快，更清楚，更有把握。 第二，系统的练习。 比如以上的例，有这许多同样的例句可以念，便可养成习惯，以后说来脱口而出，毫不踌躇。 若没有这种系统的练习，习惯的养成恨慢，甚至也许全养不成，如许多读化学工程的留学生用起英文来常不敢自信。所以这样讲法，文法是不应该反对的。 十七. 反对文法的理由通常文法固然有被人反对的理由。 通常文法太不实用。 譬如有的文法告诉人家“代名词通共三十二个”，教师“像煞有介事”的教，学生也“像煞有介事”的学，其实这种文法知识一点用处都没有。 又如纳氏的文法说形容词有六种，什么demonstrative, descriptive, proper, quantitative, numeral, distributive, 试问六种便如何，五种便如何？教员考试时问形容词有几种，学生答“六种”，自以为懂得形容词的文法。 其实纳氏说有六种，Mother Tongue 偏说只有三种，你又怎么样？而且知道某字是quantitative adj.,某字是numeral adjl, 一点没有实用。所以纳氏一派的文法早就该“扔入茅厕里”，不应来空费学生有用的精神与宝贵的光阴。 重繁杂的规则。 有名的语言学家Sapir说过，“文法规则没有一条没有漏洞的。”譬如说“无动词不能成句”一条总算文法中最基本的原则，然有学生看见学监来了，嚷出“学监！”何尝不是很好的句子？ 到底语言是活用的东西，不能受几个冬烘学者造出来的规则所束缚。学者强记规则，又强记规则之例外，自以为英文“通”了，其实差实际远甚，结果所得不偿所失，用工大而收效小。譬如有人好好的说the boat sails next Monday ,被文法专家改为will sail(future tense)，这才是冤孽罪过。 十八．什么叫做文法我们若明了文法之真义，就不会反对文法。 依我的意见，文法的研究只是对于词形体用法之变换作精密的有系统的观察。凡人读书必精，头脑要清，系统要明，分辨要细。惟基精，才不会似是而非，含糊了事。 譬如中文不精用心不细的人，常要写别字，或是偏旁写错，这种糊涂了事的读法，无论中文西文，都要弄出笑话，叫人看不起。读英文的人自然应时时留心所读文字的用法及形体之变易。不可把文法看为一事，读本看为事。这是学习文法的正当态度。请再分别讨论于下。 十九．学习文法之正轨 可分三项： 精细的观察 比如上面的例，看见help me do it 一句就得细心注意help 之后动词之前可不用to ，而如cause him to sell the house 便有to 字。这样细心读法，文法必好，不然虽念透几本文法也是无用。所以提倡观察，就是表示不信任规则。规则是笼统的，而文字的用法却是各有个性的。 若单凭空洞的规则，而不处处留心各字之用法，常要上文法规则的当。（以上sail之用法便是一例。因为此字虽指未来，也可以用时之方式，这种地方，哪有规则可以限制？）再举一平常的例，有许多学生常讲at every time I go to see him,he is absent,这是有文法而无观察的结果。at this time ,at that time 是很好的prepositional phrase，所以学生只敢用at every time 而不敢把at 字删去，结果读起来很不顺口。因为every这字常是这样用法：我们常说I will see him on Monday ,I see him every Monday 却不常说I see him on every Monday。（这末一句叫做grammatically right, but idiomatically wrong 文法上对，但习惯上错，alf ,any 字用法也有可注意之处，如half of it is gone.. half of them are gone. Is any of your sisters out? Are any of your sisters out?像这种地方规则是讲不到，而根本不能讲到的。 所以新的文法专重这种成语或词字之分别用法，而不多立规则以惑视听。好的文法应该就这种地方分别指导，才能亲切而有意味。旧式文法只讲singular, plural,而如以上half, any之用法，任凭读者自己去揣摩，临到用half , any 时，不知用is 好还是用are 好。 系统研究 以上所说精密的观察，注重各字各成语的个性，这种的观察学者凡阅读时自应留神。但观察必有系统，所以有学文法专书的必要。文法专书的所谓系统含义有二义： 系统的练习 集多少构造相同的句于一处，使读者格外易明其用法，如上所引help 字用法之例，同时与help字用法的字可以合并研究。如make,have,let,bid,see,hear这些字后面的动词也与help 相同，可省去to字（make him come, have him do it, hear him say,etc.），这样一比较，可看见有些应省去to,有些不可省去，有些可省可不省（如help, bid）就更加系统分明，这是文法专书的用处。 系统的观念 可为将来阅读时自由观察的基础，因为若读者心中不明文法自身系统，也就不会作有系统的观察。 拿名词而论，学生必先由文法书中学得具体与抽象观念的分别，知道具体名词复数可加S，而抽象名词复数通常不加，后来阅读时遇见leave word for him一句，看见word不加S（又非单数，因不言a word）就明白这word字在此地用法是指抽象意义等于message即“留言”。 但若不先有这系统观念，也就莫明其所以不加S之故。又如go to bed, go to hospital, in a school, after church, have supper with me皆不用a (a bed)也不加S（beds ），也就可以明白是因为这些bed, hospital, school, church, supper 字皆指半抽象动作（上床，就医，上学，做礼拜）非指具体物名（床，医院，校舍，礼堂）。 所以观察有文法的系统观念为基础。又拿动词而论，关于时间，必先有“霎时”与“时期”（point of time , period of time ）观念，然后对于since 的用法能够明了。如he hasn’t been feeling well at all ,since his mother died 这母亲之“死”是霎时之事，所以用died，而从母亲死去之后至今是“长期”的时间，故用hasn’t been feeling。若说he felt very bad since his mother was dead.便不合文法，因为凡言“从某时起”此时必是“霎时”，而was dead（形容词）却是形容长期的，所以不通。 文法专书的用处就是教人明白这些根本观念的区别，知道这些区别再去阅读观察，才易得益。要学英国话，应先明英国人的意象。 意象的系统有的与中国同的，有的与中国异的，有的为中国语所无的，都得一一指出，这才是好的文法，才是学习文法的正轨。旧式文法对于这些系统观念大都略而不详，实未尽文法书的职务。 养成习惯 通常文法教学最大的错误就是把文法看做一种纯属被动的分析的工作，不把他看做主动的创造的练习。 旧式文法是假定先有某句，再来做分析这句子的工夫。假如分析得通，各字的功用及文法关系明白，就算懂得这句的文法。这种对于句法的理解自然也很重要，但用这方法，必不能增加学生造句作文的能力。理解的工作是被动的，创作造句是主动的。假使我们承认文法的目的应该教学生不但能理解并且能应用文法构造，就不得不承认这个办法是错误的。事上大家知道文法念得很透的人，自己不一定能写很好的英文。理论固然很深，应用起来却毫无把握。 譬如常看学生造出文法很对但极不通的句子。如Hehad been sick before yesterday noon,英国人决没有这样说法；又如Reading in the roon ,I was sitting in the armchair ，这个participial pharse 构造不错，但读起来极不自然。学生都明白第上部叫做participial pharse，但是实在不能合用participial pharse。要矫正这个错误，须注重养成习惯，而比较减少分析的研究。譬如讲participial pharse就得多举这种句子的用法，多练习这种句子的使用，如knowing that , fearing that ,seeing that, thinking that ,regarding ,considering 等字起头的子句，连这子句的位置在前在后都一齐学好。 大概注重理解方法，偏重重僻奇怪的用法，犹如数学练习，越难越觉得有趣，而注重养成习惯的方法，偏重常用的句子，且对于常用的句子也主张重叠反复的练习，如以上所引knowing that , fearing that一类句子，可以三次四次至十数次重叠练习，同一句子，也要口诵多次，到能顺口说出，习惯养成，才算把这participial phrase交代清楚。这种的方法，习一种句法便能应用一种，很容易见效。 再举一条例，譬如英文he came , he comes . did he come ? does he come ?he did not come .he does not come.若注重分析，一看便了然，非常简单，但要学生能随时随地说出不误却不很容易。在这种地方只好重叠朗诵，多多练习，到能自然应用，才可放过。 二十．新旧文法之不同因为旧式文法普遍不得学者的同情，又因为文法自身不能废弃，所以文法的教习正在改良时期。大概这新的文法书与旧的不同有许多点。 旧式文法是百科全书式的，专在分类界说上用功夫，新的文法比较实在，取其有用有意义的部分而加以亲切精细的研究，不作空洞的分类工作。譬如止式a,the 分为difinite与indefinite article二类，定此二类之界说，便算完事，而对于此二字极复杂的用法，付之缺如，新的文法并不注重这个分类名称（因为不过是名称而已，除作百科分类外毫无用处），面对于此二字之用法，反复讨论，不厌其详。 旧式文法以体裁为主（如字尾变易等），新的文法以意象为主，不仅限于体裁的变易。 旧式文法注重表现之分析，新的文法注重表现的能力。 旧式文法好立规则，新的文法对于规则表示不信任，而易以详细的讨论。换一句话说，旧式文法好作概括之词，新式文法却于逐条另作精细的研究。 旧式文法重文字之夫肤廓体式，不问用此体式者之心理：新的文法必先求得各种文法变易的说者心理，认为文法变易只是表现心理意象之一种工具。（详见《旧文法之推翻与新文法之建造》） 二十一．规则 界说 图案旧式文法最特色的东西就是规则、界说与图案。这三项的价值各个不同，须分别估定。 规则：文法规则原有用处，犹学校定了章程，国家定了法律，使人有所秉承遵守。但章程太多，就没有道德行为，法规太繁，人民就不能安居乐业。文法之有规则，特为学者之指导而已，若以规则界说变为文法之主体，学生读文法犹如流氓诵刑律，处处只怕误触法网，造一句必问其subject 如何，predicate如何，用一代名必考量其person ,number 。这样念英文，学造句，未免太苦了。凡规则有一正当用处，这用处就是解决学生心中所感觉的难题。善为人师的人必先领导学生便叫做“法则”。这样的教法，每条规则都是有意义的，都会受学生的欢迎。若是先没有预备，叫学生把一条一条的规则念下去，而心中并未感觉疑问，必不能真明规则之意义。 界说：规则还有点用处，界说便居于更次要之地位。大半的界说都是因规则而来的；因为要定规则，所以要分门别类，因为要分门别类，所以不能不用专门名辞，因为不专门名辞，所以不能不定各名辞之定义。所以专门名词越繁，界说也越多。实际上许多专门腊丁名词可以裁汰。文法中最重要的界说及专门名辞不过一二个，其余的都是文法家装做门面的东西，白白的浪费学生的光阴。而结果使学生视文法为畏途。 图案：图案是很好的教授分析的方法，因为学生学习图案时不得不字字顶真，字字交代清楚，不得含糊过去。字句的分析为文法中应研究之一部，而学分析时最好方法莫如用图案练习。 二十二．作文作文并不是与读本文法可截然分开的科目。也许教授时可分定作文特别的时间，但是作文的基础是在研究英文全部的工作。犹如韩愈学做三代古文，非圣贤之书不敢诵，非圣贤之道不敢言，如此昼夜思维，几十年寝馈其中，然后执笔挥毫，无所不合于三代文风。所谓“文以载道”，实在就是说文是思想自然的表现，“非圣贤之书不敢诵”就是竭力吸收经书中的语法。 现代人要学外国语一样的须用这种决心，下这种苦工。朝夕诵读，然后写出来会与外国人相同。中国有几位英文法文写得很好的人，其所以好，因为不懂中文，所以写作时，无从受中国语法中国思想的影响，自然很合外国语的文体。通常学生自然不能做到这个地步，但是其作文之好坏仍在于阅读会话其余预备的工夫。倘是平时不用工，临时找字典查文法一字一字的填上，结果必写不出一句像样的句子。 二十三．会话会话不是很难的事，只要有相当练习机会。大概半年的专工实地练习，都可以成功。因为我们日常会话所应用的句极有限，日常需要的名词、口头话套总是说了又说，颠来倒去还是那些辞句。所以我们以为俄文最难学，但是一个在哈尔滨做过外国裁缝不学无术的中国人却会讲得十分流利，这就可以证明会话决不很难。 通常学生不会讲外国语，就是因为缺少实地练习而已，并无他故。 二十四．语音学之用处近来大家注意语音学，但是语音学自是一事，语音学之应用于英文教学又是一事。英文教员应该多少懂得语音学的概要，但是语间学的许多东西却不是普通学生所必须知道的。 比如讲，发音机关之位置，舌头舌上之高低，国际音标的读法，这些都是许多人所注意的。但是这些发音学理，教员自应知道，而普通要求英文正音的人，却不必完全知道。换一句话，如果目的专在正音，学生不一定要知道这些，因为譬如讲舌头的高低，学生知道00音舌的形状，不一定便会发出正确的音。但是教员却不得知道发音学理，不如此： 使不能辨音的正误，也不能指出误处 不能用适当方法矫正不正确的读音 根本不明英文辞字的读法 连读音的标准都会弄错 因此我们也可推知发音学对于英文教学的用处， 使教员能辨出音之正误及误处之所在 使教员能以适当方法矫正音误 使教员确知每字之读音 使教员明白到底什么是标准读法。 二十五．学习读音的方法这个问题很简单，就是耳闻口讲，竭力摹仿。 所谓look and say method，教员指出某字自己读出，教学生跟着读。假如读不对，教员便应当负分辨矫正的责任。若单对学生讲太多音理，很少有成效的。因为发间与文法相同，重在养成习惯，不重在分析学理。 教员要紧在于自己发音发得正，辨音辨得精，学生自然容易明白，譬如学生把have读做 hive ，教员自然可以告诉他们 是单纯的短音，i是ah+i合成的双音，但是最要紧的就是： 教员听得出这错误之所在 能自己发正确的音给学生听 发间有错误，必重叠反复练习，到习惯养成为止，这习惯的养成不是一朝一夕之事，必时时得正当的指导。犹如对学生讲“张猛龙碑”的字是怎样挺拔，而不是给他亲眼看见，学生终不能明了所言为何物。 简单一句讲，学读音必亲耳听见，必直接。在没有人指导之时，唯一的方法是用留声机片，不过普通留声机片教元音，声调，快慢都很好，而教辅音却十分不清楚。 二十六．各音符读法在没有教员指导及留声机片之时，惟一的方法，是用中文相当的音素比较。但是读者应知道这比较方法是很危险的，有的音中文英文正同，有的音中文英文仅相近而已，有的音英文所有中文所无，最多做一种比拟而已。现就可能范围，讲明各音符的音读。","link":"/2019/11/19/林语堂英语学习法/"},{"title":"【转】利用css3实现各种有趣形状","text":"利用css3可以做许多有趣的事，本篇博客就是介绍利用css3来实现各种形状 长方形 12345678/*这里是css*/#Rectangle{width: 200px;height: 50px;background-color: red;color: white;text-align: center;} 正方形 12345678/*这里是css*/#square{width: 200px;height: 200px;background-color: red;color: white;text-align: center;} 实心圆 123456789/*这里是css*/#perfect-circle{width: 200px;height: 200px;background-color: red;color: white;text-align: center;border-radius: 100px;} 圆圈 12345678910/*这里是css*/#circle{width: 200px;height: 200px;background-color: white;color: black;text-align: center;border-radius: 100px;border:3px red solid;} 椭圆 123456789/*这里是css*/#ellipse{width: 200px;height: 100px;background-color: red;color: white;text-align: center;border-radius: 100px/50px;} 上三角 12345678910/*这里是css*/#triangle-up{width: 0px;height: 0px;color: white;text-align: center;border-left: 50px solid transparent;border-right: 50px solid transparent;border-bottom: 100px solid red;} 下三角 12345678910/*这里是css*/#triangle-down{width: 0px;height: 0px;color: white;text-align: center;border-top: 100px solid red;border-left: 50px solid transparent;border-right: 50px solid transparent;} 左三角 12345678910/*这里是css*/#triangle-left{width: 0px;height: 0px;color: white;text-align: center;border-top: 50px solid transparent;border-left: 100px solid red;border-bottom: 50px solid transparent;} 右三角 12345678910/*这里是css*/#triangle-right{width: 0px;height: 0px;color: white;text-align: center;border-top: 50px solid transparent;border-right: 100px solid red;border-bottom: 50px solid transparent;} 顶左 1234567/*这里是css*/#triangle-topleft{width: 0px;height: 0px;border-top: 100px solid red;border-right: 100px solid transparent;} 顶右 1234567/*这里是css*/#triangle-topright{width: 0px;height: 0px;border-top: 100 solid red;border-left: 100 solid transparent;} 底左 123456/*这里是css*/#triangle-bottomleft{width: 0px;height: 0px;border-bottom: 100px solid red;border-right: 100px solid transparent; 底右 1234567/*这里是css*/#triangle-bottomright{width: 0px;height: 0px;border-bottom: 100px solid red;border-left: 100px solid transparent;} 平行四边形 1234567891011/*这里是css*/#parallelogram{width: 200px;height: 150px;margin-left: 30px;/*-webkit-transform: skew(-30deg); -moz-transform: skew(200deg); -o-transform: skew(200deg);*/ transform: skew(200deg);background-color: red;} 梯形 12345678/*这里是css*/#trapezoid{border-bottom: 100px solid red; border-left: 50px solid transparent; border-right: 50px solid transparent; width: 100px;height: 0px;} 五角星 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455/*这里是css*/#star-five{width: 0;height: 0;color: red;margin: 50px 0;position: relative;display: block;border-left: 100px solid transparent;border-right: 100px solid transparent;border-bottom: 70px solid red;/*-webkit-transform:rotate(35deg); -moz-transfrom:rotate(35deg); -ms-transform:rotate(35deg); -o-transform:rotate(35deg);*/ transfrom:rotate(35deg);}#star-five:before{width: 0;height: 0;border-left: 30px solid transparent;border-right: 30px solid transparent;border-bottom: 80px solid red;position: absolute;top: -45px;left: -65px;color: white;display: block;content: \"\";/*-webkit-transform:rotate(-35deg); -moz-transform:rotate(-35deg); -ms-transform:rotate(-35deg); -o-transform:rotate(-35deg); */ transform:rotate(-35deg);}#star-five:after{width: 0;height: 0;display: block;position: absolute;color: red;top: 3px;left: -105px;border-left: 100px solid transparent;border-right: 100px solid transparent;border-bottom: 70px solid red;content: \"\";/*-webkit-transform:rotate(-70deg); -moz-transform:rotate(-70deg); -ms-transform:rotate(-70deg); -o-transform:rotate(-70deg);*/ transform:rotate(-70deg);} 六芒星 1234567891011121314151617181920/*这里是css*/#star-six{width: 0;height: 0;border-left: 50px solid transparent;border-right: 50px solid transparent;border-bottom: 100px solid red;position: relative;}#star-six:after{width: 0;height: 0;border-top: 100px solid red;border-left: 50px solid transparent;border-right: 50px solid transparent;position: absolute;content: \"\";top: 30px;left: -50px;} 五边形 12345678910111213141516171819/*这里是css*/#pentagon{width: 54px;position: relative;border-width: 50px 18px 0;border-style: solid;border-color: red transparent;}#pentagon:before{content: \"\";position: absolute;width: 0;height: 0;top: -85px;left: -18px;border-width: 0 45px 35px;border-style: solid;border-color: transparent transparent red;} 六边形 12345678910111213141516171819202122232425262728293031/*这里是css*/#hexagon{width: 100px;height: 55px;background-color: red;position: relative;}#hexagon:before{content: \"\";position: absolute;top: -25px;left: 0;width: 0;height: ;border-left: 50px solid transparent;border-right: 50px solid transparent;border-bottom: 25px solid red;}#hexagon:after{content: \"\";left: 0;width: 0;height: 0;bottom: -25px;position: absolute;border-left: 50px solid transparent;border-right: 50px solid transparent;border-top: 25px solid red;} 八边形 123456789101112131415161718192021222324252627282930#octagon{width: 100px;height: 100px;background-color: red;position: relative;}#octagon:before{width: 42px;height: 0;top: 0;left: 0;position: absolute;content: \"\";border-left: 29px solid #eee;border-right: 29px solid #eee;border-bottom: 29px solid red;}#octagon:after{width: 42px;height: 0;left: 0;bottom: 0;position: absolute;content: \"\";border-left: 29px solid #eee;border-right: 29px solid #eee;border-top: 29px solid red;} 心形 123456789101112131415161718192021222324252627282930313233343536373839404142/*这里是css*/#heart{width: 100px;height: 90px;position: relative;}#heart:before,#heart:after{width: 50px;height: 80px;left: 50px;top: 0;background-color: red;position: absolute;content: \"\";border-radius: 50px 50px 0 0;/*-webkit-transform:rotate(-45deg); -ms-transform:rotate(-45deg); -moz-transform:rotate(-45deg); -o-transform:rotate(-45deg);*/ transform:rotate(-45deg);/*-webkit-transform-origin:0 100%; -ms-transform-origin:0 100%; -moz-transform-origin:0 100%; -o-transform-origin:0 100%;*/ tansform-origin:0 100%;}#heart:after{left: 0;/*-webkit-transform:rotate(45deg); -ms-transform:rotate(45deg); -moz-transform:rotate(45deg); -o-transform:rotate(45deg);*/ transform:rotate(45deg);/*-webkit-transform-origin:100% 100%; -ms-transform-origin:100% 100%; -moz-transform-origin:100% 100%; -o-transform-origin:100% 100%;*/ transform-origin:100% 100%;} 无穷 123456789101112131415161718192021222324252627282930313233/*这里是css*/#infinity{width: 212px;height: 100px;position: relative;}#infinity:before,#infinity:after{width: 60px;height: 60px;top: 0;left: 0;border: 20px solid red;position: absolute;content: \"\";border-radius: 50px 50px 0 50px;/*-webkit-transform:rotate(-45deg); -ms-transform:rotate(-45deg); -moz-transform:rotate(-45deg); -o-transform:rotate(-45deg);*/ transform:rotate(-45deg);}#infinity:after{left: auto;right: 0;border-radius: 50px 50px 50px 0;/*-webkit-transform:rotate(45deg); -moz-transform:rotate(45deg); -ms-transform:rotate(45deg); -o-transform:rotate(45deg);*/ transform:rotate(45deg);} 鸡蛋 12345678/*这里是css*/#egg{width: 126px;height: 180px;background-color: red;display: block;border-radius: 50% 50% 50% 50%/60% 60% 40% 40%;} 食豆人 12345678910111213/*这里是css*/#pacman{width: 0;height: 0;border-right: 60px solid transparent;border-left: 60px solid red;border-top: 60px solid red;border-bottom: 60px solid red;border-top-left-radius: 60px;border-top-right-radius: 60px;border-bottom-left-radius: 60px;border-bottom-right-radius: 60px;} 对话框 1234567891011121314151617181920/*这里是css*/#talkbubble{width: 200px;height: 100px;background-color: red;position: relative;border-radius: 10px;}#talkbubble:before{width: 0;height: 0;right: 100%;top: 30px;position: absolute;content: \"\";border-top: 15px solid transparent;border-right: 30px solid red;border-bottom: 15px solid transparent;} 12角星 12345678910111213141516171819202122232425262728293031323334/*这里是css*/#burst-12{width: 80px;height: 80px;background-color: red;position: relative;text-align: center;}#burst-12:before,#burst-12:after{width: 80px;height: 80px;top: 0;left: 0;background-color: red;position: absolute;content: \"\";}#burst-12:before{transform:rotate(30deg);-webkit-transform:rotate(30deg);-ms-transform:rotate(30deg);-moz-transform:rotate(30deg);-o-transform:rotate(30deg);}#burst-12:after{/*-webkit-transform:rotate(60deg); -ms-transform:rotate(60deg); -moz-transform:rotate(60deg); -o-transform:rotate(60deg);*/ transform:rotate(60deg);} 八角星 12345678910111213141516171819202122232425262728/*这里是css*/#burst-8{width: 80px;height: 80px;background-color: red;text-align: center;position: relative;/*-webkit-transform:rotate(20deg); -ms-transform:rotate(20deg); -moz-transform:rotate(20deg); -o-transform:rotate(20deg);*/ transform:rotate(20deg);}#burst-8:before{width: 80px;height: 80px;top: 0;left: 0;background-color: red;position: absolute;content: \"\";/*-webkit-transform:rotate(135deg); -ms-transform:rotate(135deg); -moz-transform:rotate(135deg); -o-transform:rotate(135deg);*/ transform:rotate(135deg);} 钻石 12345678910111213141516171819202122/*这里是css*/#diamond{width: 50px;height: 0;border-style: solid;border-color: transparent transparent red transparent;border-width: 0 25px 25px 25px;position: relative;margin: 20px 0 50px 0;}#diamond:after{width: 0;height: 0;top: 25px;left: -25px;border-style: solid;border-color: red transparent transparent transparent;border-width: 70px 50px 0 50px;position: absolute;content: \"\";} 太极图1234567891011121314151617181920212223242526272829303132333435/*这里是css*/#yin-yang{width: 96px; height: 48px; background-color: #fff; border-color: red; border-style: solid; border-width: 2px 2px 50px 2px; border-radius: 100%; position: relative; }#yin-yang:before {width: 12px; height: 12px;top: 50%; left: 0; content: \"\"; position: absolute; background-color: #fff; border: 18px solid red; border-radius: 100%; } #yin-yang:after {width: 12px; height: 12px;top: 50%; left: 50%;background-color: red;border: 18px solid #fff; border-radius:100%; content: \"\"; position: absolute; } 说明：本文做了部分代码的排版及调整，查看原文，请点击下方链接 本文作者：ching126 原文链接： https://blog.csdn.net/chenhongwu666/article/details/38905803 版权声明：本文为博主原创文章，遵循 CC 4.0 BY-SA 版权协议，转载请附上原文出处链接和本声明。","link":"/2019/12/04/利用border属性实现各种有趣形状/"}],"tags":[{"name":"JavaScript","slug":"JavaScript","link":"/tags/JavaScript/"},{"name":"诗词类","slug":"诗词类","link":"/tags/诗词类/"},{"name":"网站推荐","slug":"网站推荐","link":"/tags/网站推荐/"},{"name":"笔记：西方哲学史","slug":"笔记：西方哲学史","link":"/tags/笔记：西方哲学史/"},{"name":"笔记：中国文学","slug":"笔记：中国文学","link":"/tags/笔记：中国文学/"},{"name":"HTML/CSS","slug":"HTML-CSS","link":"/tags/HTML-CSS/"},{"name":"英语","slug":"英语","link":"/tags/英语/"}],"categories":[{"name":"前端","slug":"前端","link":"/categories/前端/"},{"name":"创作","slug":"创作","link":"/categories/创作/"},{"name":"哲学","slug":"哲学","link":"/categories/哲学/"},{"name":"文学史","slug":"文学史","link":"/categories/文学史/"},{"name":"学习：英语","slug":"学习：英语","link":"/categories/学习：英语/"}]}